from models import ResourceStats


def add_check_in_resources(resource_stats: ResourceStats):
    resource_stats.add('应急理智浓缩液×1 龙门币×30000',
                       '2024-08 沉沙赫日签到活动', '2024-08-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2024-08 沉沙赫日签到活动', '2024-08-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('饰牌《橙味》×1 中级作战记录×20',
                       '2024-08 沉沙赫日签到活动', '2024-08-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 加急许可×5',
                       '2024-08 沉沙赫日签到活动', '2024-08-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('“橙味沙暴”×1 中级作战记录×20',
                       '2024-08 沉沙赫日签到活动', '2024-08-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×20',
                       '2024-08 沉沙赫日签到活动', '2024-08-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×3 技巧概要·卷2×20',
                       '2024-08 沉沙赫日签到活动', '2024-08-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 龙门币×30000',
                       '2024-08 沉沙赫日签到活动', '2024-08-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 家具零件×300',
                       '2024-08 沉沙赫日签到活动', '2024-08-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 技巧概要·卷3×8',
                       '2024-08 沉沙赫日签到活动', '2024-08-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 技巧概要·卷1×30',
                       '2024-07 无终奇语签到活动', '2024-07-09 12:00:00+08:00', '#签到活动')
    resource_stats.add('专业干员特训邀请函×1 招聘许可×5',
                       '2024-07 无终奇语签到活动', '2024-07-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×30000 初级作战记录×20',
                       '2024-07 无终奇语签到活动', '2024-07-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('“勇闯天涯”×1 技巧概要·卷2×20',
                       '2024-07 无终奇语签到活动', '2024-07-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('高级作战记录×10 加急许可×5',
                       '2024-07 无终奇语签到活动', '2024-07-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 赤金×20',
                       '2024-07 无终奇语签到活动', '2024-07-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('资深干员技巧集×1 家具零件×300',
                       '2024-07 无终奇语签到活动', '2024-07-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('残夜厝薪寻访凭证×1 应急理智浓缩液×3',
                       '2024-05 五周年庆典签到活动', '2024-05-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('PhonoR-0×1 招聘许可×5',
                       '2024-05 五周年庆典签到活动', '2024-05-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 龙门币×30000',
                       '2024-05 五周年庆典签到活动', '2024-05-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('花圃×1 中级作战记录×20',
                       '2024-05 五周年庆典签到活动', '2024-05-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 加急许可×5',
                       '2024-05 五周年庆典签到活动', '2024-05-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 技巧概要·卷2×20',
                       '2024-05 五周年庆典签到活动', '2024-05-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('周年庆典沙漏摆件×1 赤金×20',
                       '2024-05 五周年庆典签到活动', '2024-05-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 数据增补条×10',
                       '2024-05 五周年庆典签到活动', '2024-05-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('地底三百米×1 技巧概要·卷3×8',
                       '2024-05 五周年庆典签到活动', '2024-05-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 数据增补仪×3',
                       '2024-05 五周年庆典签到活动', '2024-05-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 龙门币×30000',
                       '2024-03 围攻签到活动', '2024-03-07 12:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 招聘许可×5',
                       '2024-03 围攻签到活动', '2024-03-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 数据增补条×10',
                       '2024-03 围攻签到活动', '2024-03-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('中级作战记录×20 加急许可×5',
                       '2024-03 围攻签到活动', '2024-03-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 家具零件×300',
                       '2024-03 围攻签到活动', '2024-03-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷2×20 高级作战记录×10',
                       '2024-03 围攻签到活动', '2024-03-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 龙门币×30000',
                       '2024-03 围攻签到活动', '2024-03-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('特勤专家寻访凭证×1 数据增补仪×3',
                       '2024-03 围攻签到活动', '2024-03-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 技巧概要·卷3×8',
                       '2024-03 围攻签到活动', '2024-03-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('“一览无余”×1 赤金×20',
                       '2024-03 围攻签到活动', '2024-03-16 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 龙门币×30000',
                       '2023-12 跨年纪念签到活动', '2023-12-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2023-12 跨年纪念签到活动', '2023-12-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 技巧概要·卷2×20',
                       '2023-12 跨年纪念签到活动', '2023-12-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 家具零件×300',
                       '2023-12 跨年纪念签到活动', '2023-12-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 中级作战记录×20',
                       '2023-12 跨年纪念签到活动', '2023-12-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('“欢聚定格”×1 赤金×20',
                       '2023-12 跨年纪念签到活动', '2023-12-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×3 技巧概要·卷3×8',
                       '2023-12 跨年纪念签到活动', '2023-12-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('晚间咖啡店×1 龙门币×30000',
                       '2023-12 跨年纪念签到活动', '2023-12-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 加急许可×5',
                       '2023-12 跨年纪念签到活动', '2024-01-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 中级作战记录×20',
                       '2023-12 跨年纪念签到活动', '2024-01-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 招聘许可×5',
                       '2023-11 烛照弦鸣签到活动', '2023-11-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×5 技巧概要·卷1×30',
                       '2023-11 烛照弦鸣签到活动', '2023-11-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 加急许可×5',
                       '2023-11 烛照弦鸣签到活动', '2023-11-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('“扬升”×1 家具零件×300',
                       '2023-11 烛照弦鸣签到活动', '2023-11-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('转质盐聚块×1 龙门币×30000',
                       '2023-11 烛照弦鸣签到活动', '2023-11-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 转质盐组×3',
                       '2023-11 烛照弦鸣签到活动', '2023-11-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 中级作战记录×20',
                       '2023-11 烛照弦鸣签到活动', '2023-11-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('星橼林×1 赤金×20',
                       '2023-11 烛照弦鸣签到活动', '2023-11-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 技巧概要·卷2×20',
                       '2023-11 烛照弦鸣签到活动', '2023-11-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 龙门币×30000',
                       '2023-11 烛照弦鸣签到活动', '2023-11-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 龙门币×30000',
                       '2023-09 清光邀月签到活动', '2023-09-27 16:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2023-09 清光邀月签到活动', '2023-09-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('ItemInfoList()',
                       '2023-09 清光邀月签到活动', '2023-09-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 技巧概要·卷1×30',
                       '2023-09 清光邀月签到活动', '2023-09-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 家具零件×300',
                       '2023-09 清光邀月签到活动', '2023-10-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷2×20 赤金×20',
                       '2023-09 清光邀月签到活动', '2023-10-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷3×8 高级作战记录×10',
                       '2023-09 清光邀月签到活动', '2023-10-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 龙门币×30000',
                       '2023-09 清光邀月签到活动', '2023-10-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×3 加急许可×5',
                       '2023-09 清光邀月签到活动', '2023-10-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 中级作战记录×20',
                       '2023-09 清光邀月签到活动', '2023-10-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 龙门币×30000',
                       '2023-08 氤氲奇境签到活动', '2023-08-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2023-08 氤氲奇境签到活动', '2023-08-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('“暖身浴”×1 技巧概要·卷2×20',
                       '2023-08 氤氲奇境签到活动', '2023-08-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 家具零件×300',
                       '2023-08 氤氲奇境签到活动', '2023-08-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 中级作战记录×20',
                       '2023-08 氤氲奇境签到活动', '2023-08-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×20',
                       '2023-08 氤氲奇境签到活动', '2023-08-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×3 技巧概要·卷3×8',
                       '2023-08 氤氲奇境签到活动', '2023-08-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('悠然假日\\sHDm57×1 龙门币×30000',
                       '2023-08 氤氲奇境签到活动', '2023-08-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 加急许可×5',
                       '2023-08 氤氲奇境签到活动', '2023-08-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 中级作战记录×20',
                       '2023-08 氤氲奇境签到活动', '2023-08-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('喜上梢头×1 应急理智浓缩液×1',
                       '2023-01 新春限时签到活动', '2023-01-22 04:00:00+08:00', '#签到活动')
    resource_stats.add('转质盐组×3 龙门币×30000',
                       '2023-01 新春限时签到活动', '2023-01-23 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 招聘许可×5',
                       '2023-01 新春限时签到活动', '2023-01-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷3×8 应急理智浓缩液×1',
                       '2023-01 新春限时签到活动', '2023-01-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('化合切削液×3 初级作战记录×25',
                       '2023-01 新春限时签到活动', '2023-01-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 技巧概要·卷2×20',
                       '2023-01 新春限时签到活动', '2023-01-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 加急许可×5',
                       '2023-01 新春限时签到活动', '2023-01-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('转质盐聚块×1 家具零件×200',
                       '2023-01 新春限时签到活动', '2023-01-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('枯木逢春×1 招聘许可×5',
                       '2023-01 新春限时签到活动', '2023-01-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×5 赤金×20',
                       '2023-01 新春限时签到活动', '2023-01-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('切削原液×1 中级作战记录×20',
                       '2023-01 新春限时签到活动', '2023-02-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('高级作战记录×15 应急理智浓缩液×1',
                       '2023-01 新春限时签到活动', '2023-02-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 家具零件×200',
                       '2023-01 新春限时签到活动', '2023-02-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 加急许可×5',
                       '2023-01 新春限时签到活动', '2023-02-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷3×8 龙门币×30000',
                       '2023-01 新春限时签到活动', '2023-02-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×800',
                       '2023-01 新春限时签到活动', '2023-01-22 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×580',
                       '2023-01 新春限时签到活动', '2023-01-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200',
                       '2023-01 新春限时签到活动', '2023-01-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×660',
                       '2023-01 新春限时签到活动', '2023-02-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 龙门币×30000',
                       '2022-12 跨年纪念签到活动', '2022-12-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2022-12 跨年纪念签到活动', '2022-12-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 技巧概要·卷1×30',
                       '2022-12 跨年纪念签到活动', '2022-12-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 家具零件×300',
                       '2022-12 跨年纪念签到活动', '2022-12-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('火树灵×1 中级作战记录×20',
                       '2022-12 跨年纪念签到活动', '2022-12-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×20',
                       '2022-12 跨年纪念签到活动', '2022-12-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×3 技巧概要·卷2×20',
                       '2022-12 跨年纪念签到活动', '2022-12-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 龙门币×30000',
                       '2022-12 跨年纪念签到活动', '2022-12-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('兔兔贺年立牌×1 加急许可×5',
                       '2022-12 跨年纪念签到活动', '2023-01-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 中级作战记录×20',
                       '2022-12 跨年纪念签到活动', '2023-01-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 招聘许可×5',
                       '2022-11 正逢雨季签到活动', '2022-11-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 技巧概要·卷1×30',
                       '2022-11 正逢雨季签到活动', '2022-11-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 加急许可×5',
                       '2022-11 正逢雨季签到活动', '2022-11-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('遥乡之径×1 家具零件×300',
                       '2022-11 正逢雨季签到活动', '2022-11-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×5 龙门币×30000',
                       '2022-11 正逢雨季签到活动', '2022-11-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('转质盐聚块×1 转质盐组×3',
                       '2022-11 正逢雨季签到活动', '2022-11-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷3×8 中级作战记录×20',
                       '2022-11 正逢雨季签到活动', '2022-11-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×20',
                       '2022-11 正逢雨季签到活动', '2022-11-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 技巧概要·卷2×20',
                       '2022-11 正逢雨季签到活动', '2022-11-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 龙门币×30000',
                       '2022-11 正逢雨季签到活动', '2022-11-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 技巧概要·卷2×10',
                       '2022-10 秋风送爽签到活动', '2022-10-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 中级作战记录×20',
                       '2022-10 秋风送爽签到活动', '2022-10-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('一体式休闲座舱×1 招聘许可×5',
                       '2022-10 秋风送爽签到活动', '2022-10-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 家具零件×300',
                       '2022-10 秋风送爽签到活动', '2022-10-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('风雪邀请×1 赤金×15',
                       '2022-10 秋风送爽签到活动', '2022-10-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 高级作战记录×10',
                       '2022-10 秋风送爽签到活动', '2022-10-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 龙门币×30000',
                       '2022-10 秋风送爽签到活动', '2022-10-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 中级作战记录×25',
                       '2022-09 桂时逢月签到活动', '2022-09-08 12:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷3×8 龙门币×30000',
                       '2022-09 桂时逢月签到活动', '2022-09-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('ItemInfoList()',
                       '2022-09 桂时逢月签到活动', '2022-09-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2022-09 桂时逢月签到活动', '2022-09-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 家具零件×300',
                       '2022-09 桂时逢月签到活动', '2022-09-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 加急许可×5',
                       '2022-09 桂时逢月签到活动', '2022-09-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 高级作战记录×15',
                       '2022-09 桂时逢月签到活动', '2022-09-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 高级作战记录×20',
                       '2022-08 夏日限时签到活动', '2022-08-11 12:00:00+08:00', '#签到活动')
    resource_stats.add('玻璃柜风扇×1 龙门币×30000',
                       '2022-08 夏日限时签到活动', '2022-08-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 化合切削液×5',
                       '2022-08 夏日限时签到活动', '2022-08-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 技巧概要·卷1×30',
                       '2022-08 夏日限时签到活动', '2022-08-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 赤金×20',
                       '2022-08 夏日限时签到活动', '2022-08-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2022-08 夏日限时签到活动', '2022-08-16 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 加急许可×5',
                       '2022-08 夏日限时签到活动', '2022-08-17 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 技巧概要·卷2×20',
                       '2022-08 夏日限时签到活动', '2022-08-18 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 龙门币×30000',
                       '2022-08 夏日限时签到活动', '2022-08-19 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 家具零件×200',
                       '2022-08 夏日限时签到活动', '2022-08-20 04:00:00+08:00', '#签到活动')
    resource_stats.add('艾草落地灯×1 应急理智浓缩液×1',
                       '2022-06 端阳正午签到活动', '2022-06-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×10000 招聘许可×5',
                       '2022-06 端阳正午签到活动', '2022-06-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('赤金×55 应急理智浓缩液×1',
                       '2022-06 端阳正午签到活动', '2022-06-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('高级作战记录×10 加急许可×5',
                       '2022-06 端阳正午签到活动', '2022-06-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×20000 合成玉×200',
                       '2022-06 端阳正午签到活动', '2022-06-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 至纯源石×1',
                       '2022-06 端阳正午签到活动', '2022-06-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 技巧概要·卷2×15',
                       '2022-06 端阳正午签到活动', '2022-06-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×2 周年庆典转盘×1',
                       '2022-05 周年庆典签到活动', '2022-05-01 15:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 高级作战记录×10',
                       '2022-05 周年庆典签到活动', '2022-05-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('医疗芯片×2 龙门币×30000',
                       '2022-05 周年庆典签到活动', '2022-05-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 破冰×1',
                       '2022-05 周年庆典签到活动', '2022-05-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 技巧概要·卷2×20',
                       '2022-05 周年庆典签到活动', '2022-05-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 高级作战记录×10',
                       '2022-05 周年庆典签到活动', '2022-05-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 招聘许可×5',
                       '2022-05 周年庆典签到活动', '2022-05-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 加急许可×5',
                       '2022-05 周年庆典签到活动', '2022-05-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 家具零件×200',
                       '2022-05 周年庆典签到活动', '2022-05-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 龙门币×30000',
                       '2022-05 周年庆典签到活动', '2022-05-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('“山中弈”×1 应急理智顶液×1',
                       '2022-02 福至岁来签到活动', '2022-02-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('辅助芯片×2 龙门币×30000',
                       '2022-02 福至岁来签到活动', '2022-02-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 特种芯片×2',
                       '2022-02 福至岁来签到活动', '2022-02-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('招聘许可×5 初级作战记录×25',
                       '2022-02 福至岁来签到活动', '2022-02-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 半自然溶剂×5',
                       '2022-02 福至岁来签到活动', '2022-02-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('待晴日×1 技巧概要·卷1×20',
                       '2022-02 福至岁来签到活动', '2022-02-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 家具零件×200',
                       '2022-02 福至岁来签到活动', '2022-02-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 龙门币×30000',
                       '2022-02 福至岁来签到活动', '2022-02-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷2×15 中级作战记录×20',
                       '2022-02 福至岁来签到活动', '2022-02-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 加急许可×5',
                       '2022-02 福至岁来签到活动', '2022-02-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×2 赤金×20',
                       '2022-02 福至岁来签到活动', '2022-02-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 化合切削液×5',
                       '2022-02 福至岁来签到活动', '2022-02-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 高级作战记录×10',
                       '2022-02 福至岁来签到活动', '2022-02-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 技巧概要·卷3×10',
                       '2022-02 福至岁来签到活动', '2022-02-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('“亭上雪”×1 龙门币×30000',
                       '2022-02 福至岁来签到活动', '2022-02-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('九色鹿×1 应急理智顶液×1',
                       '2022-01 吉兆呈祥签到活动', '2022-01-10 16:00:00+08:00', '#签到活动')
    resource_stats.add('三水锰矿×3 招聘许可×5',
                       '2022-01 吉兆呈祥签到活动', '2022-01-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 中级作战记录×20',
                       '2022-01 吉兆呈祥签到活动', '2022-01-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 晶体元件×5',
                       '2022-01 吉兆呈祥签到活动', '2022-01-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 家具零件×200',
                       '2022-01 吉兆呈祥签到活动', '2022-01-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 龙门币×20000',
                       '2022-01 吉兆呈祥签到活动', '2022-01-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('“缥缈云间”×1 加急许可×5',
                       '2022-01 吉兆呈祥签到活动', '2022-01-16 04:00:00+08:00', '#签到活动')
    resource_stats.add('大黑的节日新居×1 辅助芯片组×3',
                       '2021-12 跨年纪念签到活动', '2021-12-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('未完成的礼物×1 龙门币×30000',
                       '2021-12 跨年纪念签到活动', '2021-12-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×15',
                       '2021-12 跨年纪念签到活动', '2021-12-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 中级作战记录×15',
                       '2021-12 跨年纪念签到活动', '2021-12-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 技巧概要·卷2×15',
                       '2021-12 跨年纪念签到活动', '2021-12-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 招聘许可×5',
                       '2021-12 跨年纪念签到活动', '2021-12-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 龙门币×30000',
                       '2021-12 跨年纪念签到活动', '2021-12-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('高级作战记录×15 应急理智顶液×1',
                       '2021-12 跨年纪念签到活动', '2021-12-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('炎式梳妆案×1 技巧概要·卷3×10',
                       '2021-12 跨年纪念签到活动', '2022-01-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 家具零件×100',
                       '2021-12 跨年纪念签到活动', '2022-01-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 “他日幻景”×1',
                       '2021-11 感谢庆典签到活动', '2021-11-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 正义骑士号×1',
                       '2021-11 感谢庆典签到活动', '2021-11-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2021-11 感谢庆典签到活动', '2021-11-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 招聘许可×5',
                       '2021-11 感谢庆典签到活动', '2021-11-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 家具零件×200',
                       '2021-11 感谢庆典签到活动', '2021-11-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 龙门币×30000',
                       '2021-11 感谢庆典签到活动', '2021-11-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 技巧概要·卷2×20',
                       '2021-11 感谢庆典签到活动', '2021-11-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2021-11 感谢庆典签到活动', '2021-11-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 淡金庆典×1',
                       '2021-11 感谢庆典签到活动', '2021-11-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 芯片助剂×1',
                       '2021-11 感谢庆典签到活动', '2021-11-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('手工移动木梯×1 龙门币×30000',
                       '2021-10 秋意盎然签到活动', '2021-10-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 技巧概要·卷3×15',
                       '2021-10 秋意盎然签到活动', '2021-10-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 赤金×20',
                       '2021-10 秋意盎然签到活动', '2021-10-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('中级作战记录×25 RMA70-12×3',
                       '2021-10 秋意盎然签到活动', '2021-10-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2021-10 秋意盎然签到活动', '2021-10-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 龙门币×30000',
                       '2021-10 秋意盎然签到活动', '2021-10-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('诗人的假日×1 高级作战记录×20',
                       '2021-10 秋意盎然签到活动', '2021-10-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('宫殿风吊椅×1 应急理智顶液×1',
                       '2021-09 怀望桑梓签到活动', '2021-09-17 12:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 高级作战记录×25',
                       '2021-09 怀望桑梓签到活动', '2021-09-18 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×30000 赤金×20',
                       '2021-09 怀望桑梓签到活动', '2021-09-19 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 招聘许可×5',
                       '2021-09 怀望桑梓签到活动', '2021-09-20 04:00:00+08:00', '#签到活动')
    resource_stats.add('制茶案×1 技巧概要·卷3×10',
                       '2021-09 怀望桑梓签到活动', '2021-09-21 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 家具零件×300',
                       '2021-09 怀望桑梓签到活动', '2021-09-22 04:00:00+08:00', '#签到活动')
    resource_stats.add('倾声歌唱×1 龙门币×30000',
                       '2021-09 怀望桑梓签到活动', '2021-09-23 04:00:00+08:00', '#签到活动')
    resource_stats.add('狙击芯片×2 应急理智顶液×1',
                       '2021-08 假日酬宾签到活动', '2021-08-03 12:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×20000 招聘许可×5',
                       '2021-08 假日酬宾签到活动', '2021-08-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('假日落地风扇×1 中级作战记录×10',
                       '2021-08 假日酬宾签到活动', '2021-08-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×15',
                       '2021-08 假日酬宾签到活动', '2021-08-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('高级作战记录×5 家具零件×200',
                       '2021-08 假日酬宾签到活动', '2021-08-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷2×15 全新装置×3',
                       '2021-08 假日酬宾签到活动', '2021-08-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 加急许可×5',
                       '2021-08 假日酬宾签到活动', '2021-08-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 应急理智顶液×1',
                       '2021-08 假日酬宾签到活动', '2021-08-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 龙门币×20000',
                       '2021-08 假日酬宾签到活动', '2021-08-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('海风水果刨冰车×1 技巧概要·卷3×10',
                       '2021-08 假日酬宾签到活动', '2021-08-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 龙门币×10000',
                       '2021-06 端阳正午签到活动', '2021-06-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 加急许可×5',
                       '2021-06 端阳正午签到活动', '2021-06-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷2×15 招聘许可×5',
                       '2021-06 端阳正午签到活动', '2021-06-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 龙门币×20000',
                       '2021-06 端阳正午签到活动', '2021-06-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙舟榻（首）×1 赤金×55',
                       '2021-06 端阳正午签到活动', '2021-06-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 高级作战记录×10',
                       '2021-06 端阳正午签到活动', '2021-06-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙舟榻（尾）×1 芯片助剂×1',
                       '2021-06 端阳正午签到活动', '2021-06-16 04:00:00+08:00', '#签到活动')
    resource_stats.add('周年庆典茶柜×1 龙门币×30000',
                       '2021-05 周年庆典签到活动', '2021-05-01 15:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×30000 应急理智顶液×2',
                       '2021-05 周年庆典签到活动', '2021-05-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×25',
                       '2021-05 周年庆典签到活动', '2021-05-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 高级作战记录×10',
                       '2021-05 周年庆典签到活动', '2021-05-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 技巧概要·卷2×15',
                       '2021-05 周年庆典签到活动', '2021-05-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 招聘许可×5',
                       '2021-05 周年庆典签到活动', '2021-05-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 龙门币×30000',
                       '2021-05 周年庆典签到活动', '2021-05-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 应急理智顶液×2',
                       '2021-05 周年庆典签到活动', '2021-05-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 高级作战记录×15',
                       '2021-05 周年庆典签到活动', '2021-05-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('专业人士×1 加急许可×5',
                       '2021-05 周年庆典签到活动', '2021-05-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 龙门币×10000',
                       '2021-03 锋芒将现签到活动', '2021-03-09 12:00:00+08:00', '#签到活动')
    resource_stats.add('瞄具型望远镜×1 技巧概要·卷1×30',
                       '2021-03 锋芒将现签到活动', '2021-03-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 高级作战记录×10',
                       '2021-03 锋芒将现签到活动', '2021-03-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 固源岩×6',
                       '2021-03 锋芒将现签到活动', '2021-03-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 技巧概要·卷2×20',
                       '2021-03 锋芒将现签到活动', '2021-03-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('争夺目标×1 至纯源石×1',
                       '2021-03 锋芒将现签到活动', '2021-03-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('特勤专家寻访凭证×1 芯片助剂×1',
                       '2021-03 锋芒将现签到活动', '2021-03-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('祥纹摆扇×1 应急理智顶液×1',
                       '2021-02 岁暮点雪签到活动', '2021-02-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 龙门币×30000',
                       '2021-02 岁暮点雪签到活动', '2021-02-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 先锋芯片×2',
                       '2021-02 岁暮点雪签到活动', '2021-02-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 中级作战记录×20',
                       '2021-02 岁暮点雪签到活动', '2021-02-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 术师芯片×2',
                       '2021-02 岁暮点雪签到活动', '2021-02-16 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 招聘许可×5',
                       '2021-02 岁暮点雪签到活动', '2021-02-17 04:00:00+08:00', '#签到活动')
    resource_stats.add('兔兔打鼓玩具×1 技巧概要·卷2×15',
                       '2021-02 岁暮点雪签到活动', '2021-02-18 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×2 加急许可×5',
                       '2021-02 岁暮点雪签到活动', '2021-02-19 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 龙门币×30000',
                       '2021-02 岁暮点雪签到活动', '2021-02-20 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 应急理智顶液×1',
                       '2021-02 岁暮点雪签到活动', '2021-02-21 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 家具零件×200',
                       '2021-02 岁暮点雪签到活动', '2021-02-22 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 赤金×20',
                       '2021-02 岁暮点雪签到活动', '2021-02-23 04:00:00+08:00', '#签到活动')
    resource_stats.add('孤寒峭×1 高级作战记录×10',
                       '2021-02 岁暮点雪签到活动', '2021-02-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 技巧概要·卷3×10',
                       '2021-02 岁暮点雪签到活动', '2021-02-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('“曲树提灯”×1 龙门币×30000',
                       '2021-02 岁暮点雪签到活动', '2021-02-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('雪糕兔兔沙发×1 龙门币×30000',
                       '2020-12 跨年限时登录活动', '2020-12-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('“方块兄弟”×1 应急理智顶液×2',
                       '2020-12 跨年限时登录活动', '2020-12-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×25',
                       '2020-12 跨年限时登录活动', '2020-12-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 高级作战记录×10',
                       '2020-12 跨年限时登录活动', '2020-12-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 技巧概要·卷2×15',
                       '2020-12 跨年限时登录活动', '2020-12-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2020-12 跨年限时登录活动', '2020-12-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 龙门币×30000',
                       '2020-12 跨年限时登录活动', '2020-12-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('丝绒雪花毯×1 应急理智顶液×2',
                       '2020-12 跨年限时登录活动', '2020-12-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('八音蛋匠人×1 高级作战记录×15',
                       '2020-12 跨年限时登录活动', '2021-01-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 加急许可×5',
                       '2020-12 跨年限时登录活动', '2021-01-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 新款游乐机械×1',
                       '2020-11 感谢庆典签到活动', '2020-11-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2020-11 感谢庆典签到活动', '2020-11-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 晶体元件×4',
                       '2020-11 感谢庆典签到活动', '2020-11-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 中级作战记录×20',
                       '2020-11 感谢庆典签到活动', '2020-11-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 技巧概要·卷2×20',
                       '2020-11 感谢庆典签到活动', '2020-11-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 家具零件×200',
                       '2020-11 感谢庆典签到活动', '2020-11-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2020-11 感谢庆典签到活动', '2020-11-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 龙门币×30000',
                       '2020-11 感谢庆典签到活动', '2020-11-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 渗透×1',
                       '2020-11 感谢庆典签到活动', '2020-11-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 芯片助剂×1',
                       '2020-11 感谢庆典签到活动', '2020-11-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×600',
                       '2020-10 猎人补给进行中', '2020-10-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×800',
                       '2020-10 猎人补给进行中', '2020-10-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×1000',
                       '2020-10 猎人补给进行中', '2020-10-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×1300',
                       '2020-10 猎人补给进行中', '2020-10-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×1600',
                       '2020-10 猎人补给进行中', '2020-10-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×2000',
                       '2020-10 猎人补给进行中', '2020-10-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×2300',
                       '2020-10 猎人补给进行中', '2020-10-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×2500',
                       '2020-10 猎人补给进行中', '2020-10-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×2800',
                       '2020-10 猎人补给进行中', '2020-10-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('兔兔捣药机×1 应急理智顶液×2',
                       '2020-10 限时活动进行中', '2020-10-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 赤金×20',
                       '2020-10 限时活动进行中', '2020-10-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 高级作战记录×10',
                       '2020-10 限时活动进行中', '2020-10-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 芯片助剂×1',
                       '2020-10 限时活动进行中', '2020-10-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 龙门币×30000',
                       '2020-10 限时活动进行中', '2020-10-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('假日摇椅×1 加急许可×5',
                       '2020-10 限时活动进行中', '2020-10-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 家具零件×100',
                       '2020-10 限时活动进行中', '2020-10-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('端午粽子沙发×1 赤金×55',
                       '2020-06 限时活动进行中', '2020-06-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 招聘许可×5',
                       '2020-06 限时活动进行中', '2020-06-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷2×15 术师芯片×4',
                       '2020-06 限时活动进行中', '2020-06-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 医疗芯片×4',
                       '2020-06 限时活动进行中', '2020-06-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 高级作战记录×10',
                       '2020-06 限时活动进行中', '2020-06-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 技巧概要·卷3×10',
                       '2020-06 限时活动进行中', '2020-06-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('光影×1',
                       '2020-06 限时活动进行中', '2020-07-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 THRM-EX×1',
                       '2020-05 周年庆典签到活动', '2020-05-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 龙门币×40000',
                       '2020-05 周年庆典签到活动', '2020-05-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 高级作战记录×20',
                       '2020-05 周年庆典签到活动', '2020-05-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 改量装置×2',
                       '2020-05 周年庆典签到活动', '2020-05-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 芯片助剂×2',
                       '2020-05 周年庆典签到活动', '2020-05-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 家具零件×200',
                       '2020-05 周年庆典签到活动', '2020-05-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 周年庆典壁灯×1',
                       '2020-05 周年庆典签到活动', '2020-05-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 技巧概要·卷2×10',
                       '2020-05 周年庆典签到活动', '2020-05-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 周年庆典地毯×1',
                       '2020-05 周年庆典签到活动', '2020-05-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 白马醇×3',
                       '2020-05 周年庆典签到活动', '2020-05-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 周年庆典床榻×1',
                       '2020-05 周年庆典签到活动', '2020-05-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 提纯源岩×5',
                       '2020-05 周年庆典签到活动', '2020-05-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 家具零件×200',
                       '2020-05 周年庆典签到活动', '2020-05-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 见习联结者×1',
                       '2020-05 周年庆典签到活动', '2020-05-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 龙门币×10000',
                       '2020-03 限时活动进行中', '2020-03-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛物资补给×5 招聘许可×5',
                       '2020-03 限时活动进行中', '2020-03-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 加急许可×5',
                       '2020-03 限时活动进行中', '2020-03-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛物资补给×5 合成玉×300',
                       '2020-03 限时活动进行中', '2020-03-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 中级作战记录×20',
                       '2020-03 限时活动进行中', '2020-03-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛物资补给×5 芯片助剂×1',
                       '2020-03 限时活动进行中', '2020-03-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('高原访客×1 家具零件×200',
                       '2020-03 限时活动进行中', '2020-03-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛迎春红包×2 应急理智顶液×2',
                       '2020-01 限时活动进行中', '2020-01-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛迎春红包×2 龙门币×30000',
                       '2020-01 限时活动进行中', '2020-01-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛迎春红包×2 凝胶×5',
                       '2020-01 限时活动进行中', '2020-01-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛迎春红包×2 高级作战记录×20',
                       '2020-01 限时活动进行中', '2020-01-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛迎春红包×2 至纯源石×2',
                       '2020-01 限时活动进行中', '2020-01-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 炽合金×5',
                       '2020-01 限时活动进行中', '2020-01-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('君子兰×1',
                       '2020-01 限时活动进行中', '2020-01-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('招聘许可×5 加急许可×5',
                       '2020-01 限时活动进行中', '2020-02-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷3×10 技巧概要·卷2×10',
                       '2020-01 限时活动进行中', '2020-02-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 家具零件×200',
                       '2020-01 限时活动进行中', '2020-02-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 龙门币×30000',
                       '2019-12 限时活动进行中', '2019-12-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 快乐卫士×1',
                       '2019-12 限时活动进行中', '2019-12-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 中级作战记录×30',
                       '2019-12 限时活动进行中', '2019-12-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2019-12 限时活动进行中', '2019-12-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 家具零件×200',
                       '2019-12 限时活动进行中', '2019-12-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 招聘许可×5',
                       '2019-12 限时活动进行中', '2019-12-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 合成玉×300',
                       '2019-12 限时活动进行中', '2019-12-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 寻访凭证×1',
                       '2019-12 限时活动进行中', '2020-01-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门新印象壁纸×1 龙门新印象地板×1',
                       '2019-12 限时活动进行中', '2020-01-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 芯片助剂×1',
                       '2019-12 限时活动进行中', '2020-01-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2',
                       '2019-11 限时活动进行中', '2019-11-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('中级作战记录×30',
                       '2019-11 限时活动进行中', '2019-11-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('固源岩组×5 合成玉×300',
                       '2019-11 限时活动进行中', '2019-11-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('赤金×20 龙门币×30000',
                       '2019-11 限时活动进行中', '2019-11-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×2',
                       '2019-11 限时活动进行中', '2019-11-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 应急理智顶液×1',
                       '2019-11 限时活动进行中', '2019-11-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('小鬼当家×1 芯片助剂×1',
                       '2019-11 限时活动进行中', '2019-11-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2',
                       '2019-10 限时活动进行中', '2019-10-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×30000 中级作战记录×30',
                       '2019-10 限时活动进行中', '2019-10-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('酮凝集组×5 合成玉×300',
                       '2019-10 限时活动进行中', '2019-10-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('招聘许可×5 加急许可×5',
                       '2019-10 限时活动进行中', '2019-10-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×2',
                       '2019-10 限时活动进行中', '2019-10-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 应急理智顶液×1',
                       '2019-10 限时活动进行中', '2019-10-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('威塞克斯的信件×1 芯片助剂×1',
                       '2019-10 限时活动进行中', '2019-10-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2',
                       '2019-08 限时活动进行中', '2019-08-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×30000',
                       '2019-08 限时活动进行中', '2019-08-16 04:00:00+08:00', '#签到活动')
    resource_stats.add('异铁组×5 合成玉×300',
                       '2019-08 限时活动进行中', '2019-08-17 04:00:00+08:00', '#签到活动')
    resource_stats.add('中级作战记录×30',
                       '2019-08 限时活动进行中', '2019-08-18 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×2',
                       '2019-08 限时活动进行中', '2019-08-19 04:00:00+08:00', '#签到活动')
    resource_stats.add('招聘许可×5 赤金×20',
                       '2019-08 限时活动进行中', '2019-08-20 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 芯片助剂×1',
                       '2019-08 限时活动进行中', '2019-08-21 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 轻锰矿×5',
                       '2019-07 限时活动进行中', '2019-07-22 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2019-07 限时活动进行中', '2019-07-23 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2',
                       '2019-07 限时活动进行中', '2019-07-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 招聘许可×5',
                       '2019-07 限时活动进行中', '2019-07-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×2',
                       '2019-07 限时活动进行中', '2019-07-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 寻访凭证×1',
                       '2019-07 限时活动进行中', '2019-07-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 辛味×1 芯片助剂×2',
                       '2019-07 限时活动进行中', '2019-07-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 RMA70-12×5',
                       '2019-07 限时活动进行中', '2019-07-09 16:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2019-07 限时活动进行中', '2019-07-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 斑点×1',
                       '2019-07 限时活动进行中', '2019-07-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 招聘许可×5',
                       '2019-07 限时活动进行中', '2019-07-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×2',
                       '2019-07 限时活动进行中', '2019-07-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 寻访凭证×1',
                       '2019-07 限时活动进行中', '2019-07-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 植物种志×1 芯片助剂×2',
                       '2019-07 限时活动进行中', '2019-07-15 04:00:00+08:00', '#签到活动')
