from models import ResourceStats

from .manager import manager


@manager.register
def add_dev_news_rewards(resource_stats: ResourceStats):
    resource_stats.add('合成玉×200 RMA70-12×5',
                       '制作组通讯#0', '2020-04-14 13:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 研磨石×5',
                       '制作组通讯#1', '2020-05-19 16:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 轻锰矿×5',
                       '制作组通讯#2', '2020-06-24 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 固源岩组×5',
                       '制作组通讯#3', '2020-08-04 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 扭转醇×5',
                       '制作组通讯#4', '2020-08-08 15:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 糖组×5',
                       '制作组通讯#5', '2020-09-10 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 聚酸酯组×5',
                       '制作组通讯#6', '2020-10-20 16:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 异铁组×5',
                       '制作组通讯#7', '2020-12-03 16:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 全新装置×5',
                       '制作组通讯#8', '2021-01-11 16:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 酮凝集组×5',
                       '制作组通讯#9', '2021-02-23 16:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 凝胶×5',
                       '制作组通讯#10', '2021-04-06 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 炽合金×5',
                       '制作组通讯#11', '2021-05-20 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 固源岩组×5',
                       '制作组通讯#12', '2021-06-23 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 研磨石×5',
                       '制作组通讯#13', '2021-09-02 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 轻锰矿×5',
                       '制作组通讯#14', '2021-10-19 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 固源岩组×5',
                       '制作组通讯#15', '2021-12-08 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 扭转醇×5',
                       '制作组通讯#16', '2022-01-11 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 糖组×5',
                       '制作组通讯#17', '2022-03-04 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 聚酸酯组×5',
                       '制作组通讯#18', '2022-03-31 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 异铁组×5',
                       '制作组通讯#19', '2022-05-26 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 全新装置×5',
                       '制作组通讯#20', '2022-06-22 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 酮凝集组×5',
                       '制作组通讯#21', '2022-07-28 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 凝胶×5',
                       '制作组通讯#22', '2022-08-26 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 炽合金×5',
                       '制作组通讯#23', '2022-09-13 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 固源岩组×5',
                       '制作组通讯#24', '2022-10-16 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 RMA70-12×5',
                       '制作组通讯#25', '2022-12-01 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 研磨石×5',
                       '制作组通讯#26', '2023-01-01 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 晶体元件×5',
                       '制作组通讯#27', '2023-02-22 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 半自然溶剂×5',
                       '制作组通讯#28', '2023-03-23 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 化合切削液×5',
                       '制作组通讯#29', '2023-04-14 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 转质盐组×5',
                       '制作组通讯#30', '2023-05-25 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 轻锰矿×5',
                       '制作组通讯#31', '2023-06-22 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 固源岩组×5',
                       '制作组通讯#32', '2023-07-17 19:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 扭转醇×5',
                       '制作组通讯#33', '2023-08-27 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 糖组×5',
                       '制作组通讯#34', '2023-09-25 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 聚酸酯组×5',
                       '制作组通讯#35', '2023-10-16 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 异铁组×5',
                       '制作组通讯#36', '2023-11-26 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 全新装置×5',
                       '制作组通讯#37', '2023-12-26 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 酮凝集组×5',
                       '制作组通讯#38', '2024-01-20 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 凝胶×5',
                       '制作组通讯#39', '2024-02-23 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 炽合金×5',
                       '制作组通讯#40', '2024-03-28 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 固源岩组×5',
                       '制作组通讯#41', '2024-04-20 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 RMA70-12×5',
                       '制作组通讯#42', '2024-05-22 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 研磨石×5',
                       '制作组通讯#43', '2024-06-20 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 晶体元件×5',
                       '制作组通讯#44', '2024-07-20 17:00:00+08:00', '#制作组通讯')
    resource_stats.add('合成玉×200 半自然溶剂×5',
                       '制作组通讯#45', '2024-08-19 17:00:00+08:00', '#制作组通讯')
