from models import ResourceStats


def add_event_mission_resources(resource_stats: ResourceStats):
    resource_stats.add(
        '流光之沙×50 流光之沙×50 流光之沙×50 流光之沙×80 流光之沙×80 莎草×1 流光之沙×80 模组数据块×1 流光之沙×100 柱形称量仪×1 存储组合架×1 流光之沙×120 隐秘隔墙×1 晴空壁纸×1 流光之沙×120 城市步行道×1 模组数据块×1 流光之沙×40 流光之沙×40 流光之沙×60 流光之沙×60 流光之沙×60 流光之沙×60 流光之沙×80 流光之沙×80 饰牌《亘古》×1 流光之沙×40 流光之沙×40 流光之沙×60 流光之沙×60 流光之沙×80 流光之沙×80 流光之沙×100 流光之沙×120',
        '太阳甩在身后任务',
        '2024-08-01 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '圣像碎片×50 情报凭证×130 圣像碎片×50 情报凭证×50 圣像碎片×50 情报凭证×65 圣像碎片×70 隐现×1 圣像碎片×70 情报凭证×155 模组数据块×1 圣像碎片×100 情报凭证×115 情报凭证×110 圣像碎片×100 情报凭证×160 情报凭证×145 圣像碎片×100 情报凭证×145 模组数据块×1 圣像碎片×60 圣像碎片×60 圣像碎片×80 圣像碎片×80 圣像碎片×80 圣像碎片×80 圣像碎片×100 圣像碎片×100 情报凭证×150 圣像碎片×80 圣像碎片×100 圣像碎片×120',
        '空想花庭·复刻任务',
        '2024-06-25 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '“应急物资”蓝图芯片×40 “应急物资”蓝图芯片×40 “应急物资”蓝图芯片×50 “应急物资”蓝图芯片×50 深巡×1 “应急物资”蓝图芯片×50 休眠溶胶床×1 模组数据块×1 “应急物资”蓝图芯片×60 辅助机械“小帮手”×1 “海洋的肌理”×1 “应急物资”蓝图芯片×60 “星空的足迹”×1 交互式全息屏×1 “应急物资”蓝图芯片×60 功能未定义的立柱×1 地面重力轨道×1 “应急物资”蓝图芯片×80 可演奏床头柜×1 模组数据块×1 “应急物资”蓝图芯片×40 “应急物资”蓝图芯片×40 “应急物资”蓝图芯片×50 “应急物资”蓝图芯片×50 “应急物资”蓝图芯片×60 “应急物资”蓝图芯片×60 “应急物资”蓝图芯片×80 “应急物资”蓝图芯片×100 饰牌《猎逐》×1 “应急物资”蓝图芯片×80 “应急物资”蓝图芯片×100 “应急物资”蓝图芯片×120',
        '生路任务',
        '2024-06-05 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '飞行数据记录芯片×50 飞行数据记录芯片×50 飞行数据记录芯片×50 飞行数据记录芯片×80 飞行数据记录芯片×80 淬羽赫默×1 飞行数据记录芯片×80 模组数据块×1 飞行数据记录芯片×100 情报凭证×100 飞行数据记录芯片×120 情报凭证×140 飞行数据记录芯片×120 情报凭证×140 飞行数据记录芯片×120 模组数据块×1 飞行数据记录芯片×40 飞行数据记录芯片×40 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×80 飞行数据记录芯片×80 情报凭证×150 飞行数据记录芯片×40 飞行数据记录芯片×40 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×80 飞行数据记录芯片×80 飞行数据记录芯片×100 飞行数据记录芯片×80 飞行数据记录芯片×100 飞行数据记录芯片×120',
        '孤星·复刻任务',
        '2024-05-24 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '参赛纪念×60 参赛纪念×60 参赛纪念×60 参赛纪念×60 参赛纪念×60 参赛纪念×60 参赛纪念×60 参赛纪念×100 参赛纪念×100 参赛纪念×100 参赛纪念×100 参赛纪念×100 参赛纪念×100 参赛纪念×100 参赛纪念×30 参赛纪念×30 参赛纪念×60 参赛纪念×50 参赛纪念×50 参赛纪念×100 参赛纪念×30 参赛纪念×30 参赛纪念×60 参赛纪念×50 参赛纪念×50 参赛纪念×100',
        '罗德岛促融共竞任务',
        '2024-05-15 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '粗制糖块×50 粗制糖块×50 梢头向下的枯枝×1 粗制糖块×50 “供养死者”×1 粗制糖块×80 长条枯枝×1 粗制糖块×80 奥达×1 粗制糖块×80 梢头向上的枯枝×1 模组数据块×1 粗制糖块×100 炭火箱×1 方形铁凳×1 粗制糖块×120 通用工作台×1 铁皮地垫×1 粗制糖块×120 挂壁收折凳×1 粗制糖块×120 “有限的艺术设想”×1 模组数据块×1 粗制糖块×40 粗制糖块×40 粗制糖块×60 粗制糖块×60 粗制糖块×60 粗制糖块×60 粗制糖块×80 粗制糖块×80 饰牌《甘苦》×1 粗制糖块×40 粗制糖块×40 粗制糖块×60 粗制糖块×60 粗制糖块×80 粗制糖块×80 粗制糖块×100 粗制糖块×120',
        '巴别塔任务',
        '2024-04-11 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '艺术馆集章卡×40 艺术馆集章卡×40 艺术馆讲解系统×1 艺术馆集章卡×50 艺术馆宣传台×1 艺术馆集章卡×50 导火索×1 艺术馆集章卡×50 艺术馆围栏×1 模组数据块×1 艺术馆集章卡×60 艺术馆全景显示屏×1 艺术馆集章卡×60 艺术馆地板×1 艺术馆集章卡×60 “破浪”×1 模组数据块×1 艺术馆集章卡×40 艺术馆集章卡×40 艺术馆集章卡×50 艺术馆集章卡×50 艺术馆集章卡×60 艺术馆集章卡×60 艺术馆集章卡×80 艺术馆集章卡×100 艺术馆集章卡×100 艺术馆集章卡×80 艺术馆集章卡×100 艺术馆集章卡×120',
        '水晶箭行动任务',
        '2024-03-07 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '罗德岛物资配给证书×20 罗德岛物资配给证书×20 罗德岛物资配给证书×30 情报凭证×145 罗德岛物资配给证书×30 战车×1 罗德岛物资配给证书×30 情报凭证×180 罗德岛物资配给证书×60 情报凭证×60 罗德岛物资配给证书×60 情报凭证×180 罗德岛物资配给证书×60 情报凭证×200 罗德岛物资配给证书×20 情报凭证×220 罗德岛物资配给证书×30 罗德岛物资配给证书×30 罗德岛物资配给证书×30 罗德岛物资配给证书×30 罗德岛物资配给证书×80 罗德岛物资配给证书×80 罗德岛物资配给证书×40 罗德岛物资配给证书×60 罗德岛物资配给证书×80',
        '源石尘行动·复刻任务',
        '2024-03-21 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '试炼经验×50 试炼经验×50 试炼经验×50 试炼经验×100 核心预热×1 集群优势×1 渐进超频\\n×1 试炼经验×100 试炼经验×100 试炼经验×100 试炼经验×150 试炼经验×150 试炼经验×150 试炼经验×150',
        '2024-02 引航者试炼任务',
        '2024-02-22 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '天桩×50 天桩×50 方石隔断灯架×1 天桩×50 自动化展架×1 天桩×80 “夜如意”×1 天桩×80 万顷×1 天桩×80 “闲人勿近”×1 模组数据块×1 天桩×100 组合斗拱灯×1 天师苑长椅×1 天桩×120 求索2.0×1 天师苑内墙×1 天桩×120 天师苑地板×1 模组数据块×1 天桩×40 天桩×40 天桩×60 天桩×60 天桩×60 天桩×60 天桩×80 天桩×80 饰牌《昌明》×1 天桩×40 天桩×40 天桩×60 天桩×60 天桩×80 天桩×80 天桩×100 天桩×120',
        '怀黍离任务',
        '2024-02-01 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '新酿烈刀子×50 情报凭证×125 新酿烈刀子×50 情报凭证×100 新酿烈刀子×50 情报凭证×115 新酿烈刀子×70 情报凭证×140 新酿烈刀子×70 截云×1 模组数据块×1 新酿烈刀子×80 情报凭证×140 情报凭证×185 新酿烈刀子×100 情报凭证×145 新酿烈刀子×100 情报凭证×105 新酿烈刀子×100 模组数据块×1 新酿烈刀子×60 新酿烈刀子×60 新酿烈刀子×80 新酿烈刀子×80 新酿烈刀子×80 新酿烈刀子×80 新酿烈刀子×100 新酿烈刀子×100 情报凭证×150 新酿烈刀子×80 新酿烈刀子×100 新酿烈刀子×120',
        '登临意·复刻任务',
        '2024-01-18 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '手抄歌谣集×50 情报凭证×90 手抄歌谣集×50 情报凭证×105 手抄歌谣集×50 情报凭证×90 手抄歌谣集×70 情报凭证×105 手抄歌谣集×70 谜图×1 模组数据块×1 手抄歌谣集×80 情报凭证×100 情报凭证×85 手抄歌谣集×100 情报凭证×125 情报凭证×145 手抄歌谣集×100 情报凭证×145 模组数据块×1 手抄歌谣集×60 手抄歌谣集×60 手抄歌谣集×80 手抄歌谣集×80 手抄歌谣集×80 手抄歌谣集×80 手抄歌谣集×100 手抄歌谣集×100 情报凭证×150 手抄歌谣集×80 手抄歌谣集×100 手抄歌谣集×120',
        '照我以火·复刻任务',
        '2023-12-22 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '驮兽盲盒×50 物流地秤×1 驮兽盲盒×50 无明火暖炉×1 驮兽盲盒×50 “暖阳之拥”×1 驮兽盲盒×70 哈洛德×1 驮兽盲盒×70 “谢拉格山石”×1 模组数据块×1 驮兽盲盒×100 登山包×1 绒毛靠背椅×1 驮兽盲盒×100 临“石”货架×1 邮件柜×1 驮兽盲盒×100 “雪山之景”×1 模组数据块×1 驮兽盲盒×60 驮兽盲盒×60 驮兽盲盒×80 驮兽盲盒×80 驮兽盲盒×80 驮兽盲盒×80 驮兽盲盒×100 驮兽盲盒×100 饰牌《雪境》×1 驮兽盲盒×80 驮兽盲盒×100 驮兽盲盒×120',
        '银心湖列车任务',
        '2023-12-05 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '调律追忆×60 调律追忆×60 双月奖杯座×1 调律追忆×60 调律追忆×80 “空教座”×1 调律追忆×80 调律追忆×80 调律追忆×100 “求索何方”×1 模组数据块×1 调律追忆×100 盘旋八音盒×1 崭新乐谱架×1 调律追忆×100 “无障碍音乐”×1 “历史结晶”×1 调律追忆×120 演奏家席位×1 模组数据块×1 调律追忆×60 调律追忆×60 调律追忆×80 调律追忆×80 调律追忆×80 调律追忆×80 调律追忆×100 调律追忆×100 饰牌《余音》×1 调律追忆×80 调律追忆×80 调律追忆×100 调律追忆×100 调律追忆×120 调律追忆×80 调律追忆×100 调律追忆×120 改量装置×2 数据增补条×30 D32钢×1 模组数据块×1 晶体电子单元×1',
        '崔林特尔梅之金任务',
        '2023-11-01 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '进货通行证×50 进货通行证×50 情报凭证×110 进货通行证×50 进货通行证×80 进货通行证×80 情报凭证×230 进货通行证×80 进货通行证×100 模组数据块×1 进货通行证×120 情报凭证×335 进货通行证×120 情报凭证×555 进货通行证×120 模组数据块×1 进货通行证×40 进货通行证×40 进货通行证×60 进货通行证×60 进货通行证×60 进货通行证×60 进货通行证×80 进货通行证×80 情报凭证×150 进货通行证×80 进货通行证×80 进货通行证×100 进货通行证×100 进货通行证×120 进货通行证×80 进货通行证×100 进货通行证×120',
        '叙拉古人·复刻任务',
        '2023-10-22 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '里程碑碎片×1500 应急理智加强剂×1 里程碑碎片×1500 应急理智加强剂×1 里程碑碎片×1500 应急理智加强剂×1 里程碑碎片×1500 应急理智加强剂×1 里程碑碎片×1500 龙门币×15000 里程碑碎片×2000 应急理智加强剂×1 里程碑碎片×2000 应急理智加强剂×1 里程碑碎片×2000 应急理智加强剂×1 里程碑碎片×1500 技巧概要·卷2×15 里程碑碎片×1500 龙门币×30000 里程碑碎片×2000 应急理智浓缩液×1 里程碑碎片×2000 应急理智浓缩液×1 里程碑碎片×2000 应急理智浓缩液×1 里程碑碎片×1500 采购凭证×120 里程碑碎片×5000 里程碑碎片×5000 褐素纤维×4 里程碑碎片×5000 固化纤维板×1 里程碑碎片×5000 环烃聚质×4 里程碑碎片×5000 环烃预制体×1 里程碑碎片×5000',
        '战备支援任务',
        '2023-09-24 04:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '劣质燃料×50 吊顶维生设备×1 劣质燃料×50 多用途折叠椅（左）×1 劣质燃料×50 “安然时刻”×1 劣质燃料×70 冰酿×1 劣质燃料×70 管道移动灯具×1 模组数据块×1 劣质燃料×100 “安置”×1 “私人空间”×1 劣质燃料×100 标准阻燃地板×1 标准防护内墙×1 劣质燃料×100 多用途折叠椅（右）×1 模组数据块×1 劣质燃料×60 劣质燃料×60 劣质燃料×80 劣质燃料×80 劣质燃料×80 劣质燃料×80 劣质燃料×100 劣质燃料×100 饰牌《野心》×1 劣质燃料×80 劣质燃料×100 劣质燃料×120',
        '不义之财任务',
        '2023-09-05 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '《奇谈怪论》复印本×50 情报凭证×175 《奇谈怪论》复印本×50 情报凭证×275 《奇谈怪论》复印本×50 情报凭证×180 《奇谈怪论》复印本×80 情报凭证×150 《奇谈怪论》复印本×80 至简×1 《奇谈怪论》复印本×80 模组数据块×1 《奇谈怪论》复印本×100 情报凭证×165 《奇谈怪论》复印本×120 情报凭证×165 《奇谈怪论》复印本×120 模组数据块×1 “无尽之拳”×1 “赛事简化方案”×1 技巧概要·卷3×5 全新装置×2 “矛盾的爆发”×1 技巧概要·卷2×10 炽合金×2 炽合金块×1 RMA70-12×2 半自然溶剂×2 RMA70-24×1 精炼溶剂×1 聚合剂×1 固源岩组×2 提纯源岩×1 酮凝集组×2 酮阵列×1 《奇谈怪论》复印本×70 《奇谈怪论》复印本×70 《奇谈怪论》复印本×100 《奇谈怪论》复印本×100 《奇谈怪论》复印本×100 《奇谈怪论》复印本×100 《奇谈怪论》复印本×120 《奇谈怪论》复印本×120 情报凭证×150 龙门币×10000 RMA70-12×2 技巧概要·卷2×10 酮凝集组×2 晶体电子单元×1 芯片助剂×1 技巧概要·卷3×5 高级作战记录×5 《奇谈怪论》复印本×80 《奇谈怪论》复印本×100 《奇谈怪论》复印本×120',
        '理想城：长夏狂欢季·复刻任务',
        '2023-08-31 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '试炼经验×50 试炼经验×50 试炼经验×50 试炼经验×100 扩大化战略×1 经验习得×1 过热运转×1 试炼经验×100 试炼经验×100 试炼经验×100 试炼经验×150 试炼经验×150 试炼经验×150 试炼经验×150',
        '2023-08 引航者试炼任务',
        '2023-08-18 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '毛绒绒生物的毛×50 毛绒绒生物的毛×50 毛绒绒生物的毛×50 “风味魔法师”×1 毛绒绒生物的毛×80 “漂流掌舵手”×1 毛绒绒生物的毛×80 苍苔×1 模组数据块×1 毛绒绒生物的毛×100 “烈日抵御者”×1 “常青培育员”×1 毛绒绒生物的毛×100 风情街全景显示屏×1 “标志艺术家”×1 毛绒绒生物的毛×100 斑斓地砖×1 模组数据块×1 毛绒绒生物的毛×40 毛绒绒生物的毛×40 毛绒绒生物的毛×60 毛绒绒生物的毛×60 毛绒绒生物的毛×60 毛绒绒生物的毛×60 毛绒绒生物的毛×80 毛绒绒生物的毛×80 饰牌《显像》×1 毛绒绒生物的毛×40 毛绒绒生物的毛×40 毛绒绒生物的毛×60 毛绒绒生物的毛×60 毛绒绒生物的毛×80 毛绒绒生物的毛×80 毛绒绒生物的毛×100 毛绒绒生物的毛×120',
        '火山旅梦任务',
        '2023-08-01 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '神秘试剂×50 情报凭证×55 神秘试剂×50 情报凭证×170 神秘试剂×50 情报凭证×180 神秘试剂×70 星源×1 神秘试剂×70 情报凭证×435 模组数据块×1 神秘试剂×80 情报凭证×40 神秘试剂×100 情报凭证×170 神秘试剂×100 模组数据块×1 神秘试剂×60 神秘试剂×60 神秘试剂×80 神秘试剂×80 神秘试剂×80 神秘试剂×80 神秘试剂×100 神秘试剂×100 情报凭证×150 神秘试剂×80 神秘试剂×100 神秘试剂×120',
        '绿野幻梦·复刻任务',
        '2023-07-18 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '圣像碎片×50 “凝思之椅”×2 圣像碎片×50 安布罗修花纹地毯×1 圣像碎片×50 “明辨之灯”×1 圣像碎片×70 隐现×1 圣像碎片×70 有点长的长椅×1 模组数据块×1 圣像碎片×100 不太长的长椅×1 修道院吊灯×2 圣像碎片×100 “释解之桌”×1 花庭全景显示屏×1 圣像碎片×100 圣堂石砖×1 模组数据块×1 圣像碎片×60 圣像碎片×60 圣像碎片×80 圣像碎片×80 圣像碎片×80 圣像碎片×80 圣像碎片×100 圣像碎片×100 饰牌《飏升》×1 圣像碎片×80 圣像碎片×100 圣像碎片×120',
        '空想花庭任务',
        '2023-06-08 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '乐谱草稿×50 情报凭证×105 乐谱草稿×50 情报凭证×35 乐谱草稿×50 情报凭证×100 乐谱草稿×70 情报凭证×35 乐谱草稿×70 车尔尼×1 模组数据块×1 情报凭证×115 乐谱草稿×80 情报凭证×100 情报凭证×105 乐谱草稿×100 情报凭证×110 情报凭证×150 乐谱草稿×100 模组数据块×1 情报凭证×90 乐谱草稿×60 乐谱草稿×60 乐谱草稿×80 乐谱草稿×80 乐谱草稿×80 乐谱草稿×80 乐谱草稿×100 乐谱草稿×100 情报凭证×150 乐谱草稿×80 乐谱草稿×100 乐谱草稿×120',
        '尘影余音·复刻任务',
        '2023-06-20 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '飞行数据记录芯片×50 飞行数据记录芯片×50 飞行数据记录芯片×50 飞行数据记录芯片×80 飞行数据记录芯片×80 淬羽赫默×1 飞行数据记录芯片×80 模组数据块×1 飞行数据记录芯片×100 “浮游”×2 飞行数据记录芯片×120 “莱茵时代”×1 飞行数据记录芯片×120 “银色天空”×1 飞行数据记录芯片×120 模组数据块×1 飞行数据记录芯片×40 飞行数据记录芯片×40 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×80 飞行数据记录芯片×80 饰牌《陨落》×1 飞行数据记录芯片×40 飞行数据记录芯片×40 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×80 飞行数据记录芯片×80 飞行数据记录芯片×100 飞行数据记录芯片×80 飞行数据记录芯片×100 飞行数据记录芯片×120',
        '孤星任务',
        '2023-05-01 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        'ItemInfoList()',
        '愚人号·复刻任务',
        '2023-04-20 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '破碎的骨片×20 破碎的骨片×20 破碎的骨片×20 源石虫的硬壳×20 泰拉大陆调查团×1 源石虫的硬壳×20 模组数据块×1 源石虫的硬壳×20 鬣犄兽的尖锐齿×20 鬣犄兽的尖锐齿×20 鬣犄兽的尖锐齿×20 模组数据块×1 破碎的骨片×10 源石虫的硬壳×10 鬣犄兽的尖锐齿×10 凶豕兽的厚实皮×10 “兽之泪”×10 破碎的骨片×50 破碎的骨片×50 破碎的骨片×20 破碎的骨片×20 破碎的骨片×30 破碎的骨片×30 源石虫的硬壳×20 源石虫的硬壳×20 源石虫的硬壳×30 源石虫的硬壳×30',
        '落叶逐火任务',
        '2023-03-07 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '龙门币×15000 应急理智加强剂×1 应急理智加强剂×1 应急理智加强剂×1 技巧概要·卷2×15 龙门币×30000 应急理智浓缩液×1 应急理智浓缩液×1 应急理智浓缩液×1 采购凭证×120',
        '战备支援任务',
        '2023-03-23 04:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '蚀刻弹弹壳×30 情报凭证×255 蚀刻弹弹壳×30 情报凭证×135 蚀刻弹弹壳×30 情报凭证×195 蚀刻弹弹壳×50 蚀刻弹弹壳×50 见行者×1 情报凭证×100 蚀刻弹弹壳×60 情报凭证×170 情报凭证×155 蚀刻弹弹壳×80 情报凭证×225 蚀刻弹弹壳×80 情报凭证×170 蚀刻弹弹壳×40 蚀刻弹弹壳×40 蚀刻弹弹壳×60 蚀刻弹弹壳×60 蚀刻弹弹壳×60 蚀刻弹弹壳×60 蚀刻弹弹壳×80 蚀刻弹弹壳×80 情报凭证×150 蚀刻弹弹壳×60 蚀刻弹弹壳×80 蚀刻弹弹壳×100',
        '吾导先路·复刻任务',
        '2023-02-21 16:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '新酿烈刀子×50 “鼓声争鸣”×1 新酿烈刀子×50 “终觉浅”×1 新酿烈刀子×50 “冥心坐忘”×1 新酿烈刀子×70 “且去也”×1 新酿烈刀子×70 截云×1 模组数据块×1 新酿烈刀子×80 “念归人”×1 “塞上春生”×1 新酿烈刀子×100 “梁下安”×1 新酿烈刀子×100 “涤沙洗尘”×1 新酿烈刀子×100 模组数据块×1 新酿烈刀子×60 新酿烈刀子×60 新酿烈刀子×80 新酿烈刀子×80 新酿烈刀子×80 新酿烈刀子×80 新酿烈刀子×100 新酿烈刀子×100 饰牌《扣春》×1 新酿烈刀子×80 新酿烈刀子×100 新酿烈刀子×120',
        '登临意任务',
        '2023-01-17 12:00:00',
        '#活动任务',
    )
    resource_stats.add(
        '罐装晌午茶×40 情报凭证×125 罐装晌午茶×40 情报凭证×175 罐装晌午茶×60 情报凭证×160 罐装晌午茶×60 罐装晌午茶×80 寒芒克洛丝×1 情报凭证×135 罐装晌午茶×80 情报凭证×100 情报凭证×120 罐装晌午茶×80 情报凭证×125 罐装晌午茶×100 情报凭证×145 罐装晌午茶×100 情报凭证×145 罐装晌午茶×50 罐装晌午茶×50 罐装晌午茶×60 罐装晌午茶×60 罐装晌午茶×80 罐装晌午茶×80 罐装晌午茶×100 罐装晌午茶×100 情报凭证×150 罐装晌午茶×60 罐装晌午茶×80 罐装晌午茶×100',
        '将进酒·复刻任务',
        '2023-01-01 16:00:00',
        '#活动任务',
    )
