from models import ResourceStats
from time_utils import CST
from triggers import CronTrigger, DateTrigger


def add_generated_resources(resource_stats: ResourceStats):
    resource_stats.add(
        '资质凭证×4 初级作战记录×4 龙门币×4000 资质凭证×4 初级作战记录×6 龙门币×6000 资质凭证×8 初级作战记录×8 龙门币×8000 资质凭证×8 初级作战记录×10 龙门币×10000 高级凭证×4 中级作战记录×8 龙门币×15000 高级凭证×4 中级作战记录×10 龙门币×20000 高级凭证×8 中级作战记录×12 龙门币×25000 高级凭证×8 中级作战记录×15 龙门币×30000',
        '切尔诺伯格剿灭首次通关',
        '2019-04-30 10:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '资质凭证×5 初级作战记录×5 龙门币×5000 资质凭证×5 初级作战记录×8 龙门币×8000 资质凭证×10 初级作战记录×10 龙门币×10000 资质凭证×10 中级作战记录×8 龙门币×15000 高级凭证×5 中级作战记录×10 龙门币×20000 高级凭证×5 中级作战记录×12 龙门币×25000 高级凭证×10 中级作战记录×15 龙门币×30000 高级凭证×10 中级作战记录×20 龙门币×40000',
        '龙门外环剿灭首次通关',
        '2019-04-30 10:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '资质凭证×5 初级作战记录×5 龙门币×5000 资质凭证×5 初级作战记录×8 龙门币×8000 资质凭证×10 初级作战记录×10 龙门币×10000 资质凭证×10 中级作战记录×8 龙门币×15000 高级凭证×5 中级作战记录×10 龙门币×20000 高级凭证×5 中级作战记录×12 龙门币×25000 高级凭证×10 中级作战记录×15 龙门币×30000 高级凭证×10 中级作战记录×20 龙门币×40000',
        '龙门市区剿灭首次通关',
        '2019-07-22 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 固源岩组×3 合成玉×200 糖组×3 采购凭证×30 聚酸酯组×3 合成玉×300 异铁组×3 酮凝集组×3 采购凭证×40 全新装置×3 扭转醇×3 合成玉×400 三水锰矿×1 五水研磨石×1 采购凭证×60 芯片助剂×1 家具零件×100 合成玉×600 聚合剂×1 RMA70-24×1',
        '大骑士领郊外剿灭首次通关',
        '2020-11-02 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 凝胶×3 合成玉×200 炽合金×3 采购凭证×30 晶体元件×3 合成玉×300 固源岩组×3 糖组×3 采购凭证×40 聚酸酯组×3 异铁组×3 合成玉×400 酮阵列×1 改量装置×1 采购凭证×60 芯片助剂×1 家具零件×100 合成玉×600 聚合剂×1 白马醇×1',
        '北原冰封废城剿灭首次通关',
        '2021-01-04 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 轻锰矿×3 合成玉×200 研磨石×3 采购凭证×30 RMA70-12×3 合成玉×300 凝胶×3 炽合金×3 采购凭证×40 晶体元件×3 固源岩组×3 合成玉×400 糖聚块×1 聚酸酯块×1 采购凭证×60 芯片助剂×1 乌萨斯回声-废矿×1 合成玉×600 D32钢×1 异铁块×1',
        '废弃矿区剿灭首次通关',
        '2021-03-08 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 酮凝集组×3 合成玉×200 全新装置×3 采购凭证×30 扭转醇×3 合成玉×300 轻锰矿×3 研磨石×3 采购凭证×40 RMA70-12×3 凝胶×3 合成玉×400 炽合金块×1 晶体电路×1 采购凭证×60 芯片助剂×1 汐斯塔回声-海滨×1 合成玉×600 双极纳米片×1 提纯源岩×1',
        '潮没海滨剿灭首次通关',
        '2021-05-03 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 糖组×3 合成玉×200 聚酸酯组×3 采购凭证×30 异铁组×3 合成玉×300 酮凝集组×3 全新装置×3 采购凭证×40 扭转醇×3 轻锰矿×3 合成玉×400 五水研磨石×1 RMA70-24×1 采购凭证×60 芯片助剂×1 伊比利亚回声-潮窟×1 合成玉×600 双极纳米片×1 聚合凝胶×1',
        '积水潮窟剿灭首次通关',
        '2021-07-12 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 炽合金×3 合成玉×200 晶体元件×3 采购凭证×30 固源岩组×3 合成玉×300 糖组×3 聚酸酯组×3 采购凭证×40 异铁组×3 酮凝集组×3 合成玉×400 改量装置×1 白马醇×1 采购凭证×60 芯片助剂×1 萨尔贡回声-长泉×1 合成玉×600 双极纳米片×1 三水锰矿×1',
        '长泉镇郊野剿灭首次通关',
        '2021-09-06 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 研磨石×3 合成玉×200 RMA70-12×3 采购凭证×30 凝胶×3 合成玉×300 炽合金×3 晶体元件×3 采购凭证×40 固源岩组×3 糖组×3 合成玉×400 聚酸酯块×1 异铁块×1 采购凭证×60 芯片助剂×1 玻利瓦尔回声-换水口×1 合成玉×600 双极纳米片×1 酮阵列×1',
        '多索雷斯换水口剿灭首次通关',
        '2021-11-01 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 凝胶×3 合成玉×200 炽合金×3 采购凭证×30 化合切削液×3 合成玉×300 半自然溶剂×3 晶体元件×3 采购凭证×40 固源岩组×3 糖组×3 合成玉×400 聚酸酯块×1 异铁块×1 采购凭证×60 芯片助剂×1 哥伦比亚回声-监狱×1 合成玉×600 晶体电子单元×1 酮阵列×1',
        '南方监狱剿灭首次通关',
        '2022-01-10 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 半自然溶剂×3 合成玉×200 异铁组×3 采购凭证×30 酮凝集组×3 合成玉×300 全新装置×3 扭转醇×3 采购凭证×40 轻锰矿×3 研磨石×3 合成玉×400 RMA70-24×1 聚合凝胶×1 采购凭证×60 芯片助剂×1 维多利亚回声-小丘郡×1 合成玉×600 双极纳米片×1 炽合金块×1',
        '小丘郡郊野剿灭首次通关',
        '2022-03-07 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 晶体元件×3 合成玉×200 固源岩组×3 采购凭证×30 化合切削液×3 合成玉×300 半自然溶剂×3 异铁组×3 采购凭证×40 酮凝集组×3 全新装置×3 合成玉×400 白马醇×1 三水锰矿×1 采购凭证×60 芯片助剂×1 卡西米尔回声-竞技场×1 合成玉×600 D32钢×1 五水研磨石×1',
        '黑夜锦标秀剿灭首次通关',
        '2022-05-02 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 RMA70-12×3 合成玉×200 凝胶×3 采购凭证×30 炽合金×3 合成玉×300 晶体元件×3 固源岩组×3 采购凭证×40 化合切削液×3 半自然溶剂×3 合成玉×400 异铁块×1 酮阵列×1 采购凭证×60 芯片助剂×1 炎国回声-蜀道×1 合成玉×600 聚合剂×1 改量装置×1',
        '盘桓蜀道剿灭首次通关',
        '2022-07-11 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 扭转醇×3 合成玉×200 轻锰矿×3 采购凭证×30 研磨石×3 合成玉×300 RMA70-12×3 凝胶×3 采购凭证×40 炽合金×3 晶体元件×3 合成玉×400 提纯源岩×1 切削原液×1 采购凭证×60 芯片助剂×1 拉特兰回声-大街×1 合成玉×600 D32钢×1 精炼溶剂×1',
        '巧克力大街剿灭首次通关',
        '2022-09-05 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 转质盐组×3 合成玉×200 晶体元件×3 采购凭证×30 固源岩组×3 合成玉×300 化合切削液×3 半自然溶剂×3 采购凭证×40 异铁组×3 酮凝集组×3 合成玉×400 改量装置×1 白马醇×1 采购凭证×60 芯片助剂×1 伊比利亚回声-造船厂×1 合成玉×600 烧结核凝晶×1 三水锰矿×1',
        '昏黑造船厂剿灭首次通关',
        '2022-10-31 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 酮凝集组×3 合成玉×200 全新装置×3 采购凭证×30 扭转醇×3 合成玉×300 轻锰矿×3 研磨石×3 采购凭证×40 RMA70-12×3 凝胶×3 合成玉×400 炽合金块×1 转质盐聚块×1 采购凭证×60 芯片助剂×1 哥伦比亚回声-机库×1 合成玉×600 双极纳米片×1 晶体电路×1',
        '实验基地机库剿灭首次通关',
        '2023-01-09 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 固源岩组×3 合成玉×200 化合切削液×3 采购凭证×30 半自然溶剂×3 合成玉×300 异铁组×3 酮凝集组×3 采购凭证×40 全新装置×3 扭转醇×3 合成玉×400 三水锰矿×1 五水研磨石×1 采购凭证×60 芯片助剂×1 炎国龙门回声-商业街×1 合成玉×600 D32钢×1 RMA70-24×1',
        '龙门商业街剿灭首次通关',
        '2023-03-06 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 凝胶×3 合成玉×200 炽合金×3 采购凭证×30 转质盐组×3 合成玉×300 晶体元件×3 固源岩组×3 采购凭证×40 化合切削液×3 半自然溶剂×3 合成玉×400 异铁块×1 酮阵列×1 采购凭证×60 芯片助剂×1 莱塔尼亚回声-街道×1 合成玉×600 晶体电子单元×1 改量装置×1',
        '休止符街道剿灭首次通关',
        '2023-05-01 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 扭转醇×3 合成玉×200 轻锰矿×3 采购凭证×30 研磨石×3 合成玉×300 RMA70-12×3 凝胶×3 采购凭证×40 炽合金×3 转质盐组×3 合成玉×400 晶体电路×1 提纯源岩×1 采购凭证×60 芯片助剂×1 维多利亚回声-泥沼×1 合成玉×600 聚合剂×1 切削原液×1',
        '灰暗泥沼剿灭首次通关',
        '2023-07-10 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 半自然溶剂×3 合成玉×200 异铁组×3 采购凭证×30 酮凝集组×3 合成玉×300 全新装置×3 扭转醇×3 采购凭证×40 轻锰矿×3 研磨石×3 合成玉×400 RMA70-24×1 聚合凝胶×1 采购凭证×60 芯片助剂×1 萨尔贡回声-小水坑×1 合成玉×600 双极纳米片×1 炽合金块×1',
        '“特制小水坑”剿灭首次通关',
        '2023-09-04 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 转质盐组×3 合成玉×200 晶体元件×3 采购凭证×30 固源岩组×3 合成玉×300 化合切削液×3 半自然溶剂×3 采购凭证×40 异铁组×3 酮凝集组×3 合成玉×400 改量装置×1 白马醇×1 采购凭证×60 芯片助剂×1 维多利亚回声-荒野×1 合成玉×600 D32钢×1 三水锰矿×1',
        '腐烂荒野剿灭首次通关',
        '2023-10-30 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 转质盐组×3 合成玉×200 褐素纤维×3 采购凭证×30 环烃聚质×3 合成玉×300 晶体元件×3 固源岩组×3 采购凭证×40 化合切削液×3 半自然溶剂×3 合成玉×400 异铁块×1 酮阵列×1 采购凭证×60 芯片助剂×1 炎国回声-边城×1 合成玉×600 晶体电子单元×1 改量装置×1',
        '千嶂边城剿灭首次通关',
        '2024-01-08 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 扭转醇×3 合成玉×200 轻锰矿×3 采购凭证×30 研磨石×3 合成玉×300 RMA70-12×3 凝胶×3 采购凭证×40 炽合金×3 转质盐组×3 合成玉×400 固化纤维板×1 环烃预制体×1 采购凭证×60 芯片助剂×1 汐斯塔回声-大道×1 合成玉×600 烧结核凝晶×1 晶体电路×1',
        '新旅店大道剿灭首次通关',
        '2024-03-04 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 固源岩组×3 合成玉×200 化合切削液×3 采购凭证×30 半自然溶剂×3 合成玉×300 异铁组×3 酮凝集组×3 采购凭证×40 全新装置×3 扭转醇×3 合成玉×400 三水锰矿×1 五水研磨石×1 采购凭证×60 芯片助剂×1 哥伦比亚回声-实验室×1 合成玉×600 D32钢×1 RMA70-24×1',
        '“离心率”实验室剿灭首次通关',
        '2024-04-29 04:00:00+08:00',
        '#剿灭作战首次通关',
    )
    resource_stats.add(
        '采购凭证×20 凝胶×3 合成玉×200 炽合金×3 采购凭证×30 转质盐组×3 合成玉×300 褐素纤维×3 环烃聚质×3 采购凭证×40 晶体元件×3 固源岩组×3 合成玉×400 切削原液×1 精炼溶剂×1 采购凭证×60 芯片助剂×1 维多利亚回声-街区×1 合成玉×600 聚合剂×1 异铁块×1',
        '燃烧街区剿灭首次通关',
        '2024-07-08 04:00:00+08:00',
        '#剿灭作战首次通关',
    )

    resource_stats.add(
        '流光之沙×50 流光之沙×50 流光之沙×50 流光之沙×80 流光之沙×80 莎草×1 流光之沙×80 模组数据块×1 流光之沙×100 柱形称量仪×1 存储组合架×1 流光之沙×120 隐秘隔墙×1 晴空壁纸×1 流光之沙×120 城市步行道×1 模组数据块×1 流光之沙×40 流光之沙×40 流光之沙×60 流光之沙×60 流光之沙×60 流光之沙×60 流光之沙×80 流光之沙×80 饰牌《亘古》×1 流光之沙×40 流光之沙×40 流光之沙×60 流光之沙×60 流光之沙×80 流光之沙×80 流光之沙×100 流光之沙×120',
        '太阳甩在身后任务',
        '2024-08-01 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '圣像碎片×50 情报凭证×130 圣像碎片×50 情报凭证×50 圣像碎片×50 情报凭证×65 圣像碎片×70 隐现×1 圣像碎片×70 情报凭证×155 模组数据块×1 圣像碎片×100 情报凭证×115 情报凭证×110 圣像碎片×100 情报凭证×160 情报凭证×145 圣像碎片×100 情报凭证×145 模组数据块×1 圣像碎片×60 圣像碎片×60 圣像碎片×80 圣像碎片×80 圣像碎片×80 圣像碎片×80 圣像碎片×100 圣像碎片×100 情报凭证×150 圣像碎片×80 圣像碎片×100 圣像碎片×120',
        '空想花庭·复刻任务',
        '2024-06-25 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '“应急物资”蓝图芯片×40 “应急物资”蓝图芯片×40 “应急物资”蓝图芯片×50 “应急物资”蓝图芯片×50 深巡×1 “应急物资”蓝图芯片×50 休眠溶胶床×1 模组数据块×1 “应急物资”蓝图芯片×60 辅助机械“小帮手”×1 “海洋的肌理”×1 “应急物资”蓝图芯片×60 “星空的足迹”×1 交互式全息屏×1 “应急物资”蓝图芯片×60 功能未定义的立柱×1 地面重力轨道×1 “应急物资”蓝图芯片×80 可演奏床头柜×1 模组数据块×1 “应急物资”蓝图芯片×40 “应急物资”蓝图芯片×40 “应急物资”蓝图芯片×50 “应急物资”蓝图芯片×50 “应急物资”蓝图芯片×60 “应急物资”蓝图芯片×60 “应急物资”蓝图芯片×80 “应急物资”蓝图芯片×100 饰牌《猎逐》×1 “应急物资”蓝图芯片×80 “应急物资”蓝图芯片×100 “应急物资”蓝图芯片×120',
        '生路任务',
        '2024-06-05 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '飞行数据记录芯片×50 飞行数据记录芯片×50 飞行数据记录芯片×50 飞行数据记录芯片×80 飞行数据记录芯片×80 淬羽赫默×1 飞行数据记录芯片×80 模组数据块×1 飞行数据记录芯片×100 情报凭证×100 飞行数据记录芯片×120 情报凭证×140 飞行数据记录芯片×120 情报凭证×140 飞行数据记录芯片×120 模组数据块×1 飞行数据记录芯片×40 飞行数据记录芯片×40 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×80 飞行数据记录芯片×80 情报凭证×150 飞行数据记录芯片×40 飞行数据记录芯片×40 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×80 飞行数据记录芯片×80 飞行数据记录芯片×100 飞行数据记录芯片×80 飞行数据记录芯片×100 飞行数据记录芯片×120',
        '孤星·复刻任务',
        '2024-05-24 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '参赛纪念×60 参赛纪念×60 参赛纪念×60 参赛纪念×60 参赛纪念×60 参赛纪念×60 参赛纪念×60 参赛纪念×100 参赛纪念×100 参赛纪念×100 参赛纪念×100 参赛纪念×100 参赛纪念×100 参赛纪念×100 参赛纪念×30 参赛纪念×30 参赛纪念×60 参赛纪念×50 参赛纪念×50 参赛纪念×100 参赛纪念×30 参赛纪念×30 参赛纪念×60 参赛纪念×50 参赛纪念×50 参赛纪念×100',
        '罗德岛促融共竞任务',
        '2024-05-15 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '粗制糖块×50 粗制糖块×50 梢头向下的枯枝×1 粗制糖块×50 “供养死者”×1 粗制糖块×80 长条枯枝×1 粗制糖块×80 奥达×1 粗制糖块×80 梢头向上的枯枝×1 模组数据块×1 粗制糖块×100 炭火箱×1 方形铁凳×1 粗制糖块×120 通用工作台×1 铁皮地垫×1 粗制糖块×120 挂壁收折凳×1 粗制糖块×120 “有限的艺术设想”×1 模组数据块×1 粗制糖块×40 粗制糖块×40 粗制糖块×60 粗制糖块×60 粗制糖块×60 粗制糖块×60 粗制糖块×80 粗制糖块×80 饰牌《甘苦》×1 粗制糖块×40 粗制糖块×40 粗制糖块×60 粗制糖块×60 粗制糖块×80 粗制糖块×80 粗制糖块×100 粗制糖块×120',
        '巴别塔任务',
        '2024-04-11 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '艺术馆集章卡×40 艺术馆集章卡×40 艺术馆讲解系统×1 艺术馆集章卡×50 艺术馆宣传台×1 艺术馆集章卡×50 导火索×1 艺术馆集章卡×50 艺术馆围栏×1 模组数据块×1 艺术馆集章卡×60 艺术馆全景显示屏×1 艺术馆集章卡×60 艺术馆地板×1 艺术馆集章卡×60 “破浪”×1 模组数据块×1 艺术馆集章卡×40 艺术馆集章卡×40 艺术馆集章卡×50 艺术馆集章卡×50 艺术馆集章卡×60 艺术馆集章卡×60 艺术馆集章卡×80 艺术馆集章卡×100 艺术馆集章卡×100 艺术馆集章卡×80 艺术馆集章卡×100 艺术馆集章卡×120',
        '水晶箭行动任务',
        '2024-03-07 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '罗德岛物资配给证书×20 罗德岛物资配给证书×20 罗德岛物资配给证书×30 情报凭证×145 罗德岛物资配给证书×30 战车×1 罗德岛物资配给证书×30 情报凭证×180 罗德岛物资配给证书×60 情报凭证×60 罗德岛物资配给证书×60 情报凭证×180 罗德岛物资配给证书×60 情报凭证×200 罗德岛物资配给证书×20 情报凭证×220 罗德岛物资配给证书×30 罗德岛物资配给证书×30 罗德岛物资配给证书×30 罗德岛物资配给证书×30 罗德岛物资配给证书×80 罗德岛物资配给证书×80 罗德岛物资配给证书×40 罗德岛物资配给证书×60 罗德岛物资配给证书×80',
        '源石尘行动·复刻任务',
        '2024-03-21 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '试炼经验×50 试炼经验×50 试炼经验×50 试炼经验×100 核心预热×1 集群优势×1 渐进超频\\n×1 试炼经验×100 试炼经验×100 试炼经验×100 试炼经验×150 试炼经验×150 试炼经验×150 试炼经验×150',
        '2024-02 引航者试炼任务',
        '2024-02-22 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '天桩×50 天桩×50 方石隔断灯架×1 天桩×50 自动化展架×1 天桩×80 “夜如意”×1 天桩×80 万顷×1 天桩×80 “闲人勿近”×1 模组数据块×1 天桩×100 组合斗拱灯×1 天师苑长椅×1 天桩×120 求索2.0×1 天师苑内墙×1 天桩×120 天师苑地板×1 模组数据块×1 天桩×40 天桩×40 天桩×60 天桩×60 天桩×60 天桩×60 天桩×80 天桩×80 饰牌《昌明》×1 天桩×40 天桩×40 天桩×60 天桩×60 天桩×80 天桩×80 天桩×100 天桩×120',
        '怀黍离任务',
        '2024-02-01 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '新酿烈刀子×50 情报凭证×125 新酿烈刀子×50 情报凭证×100 新酿烈刀子×50 情报凭证×115 新酿烈刀子×70 情报凭证×140 新酿烈刀子×70 截云×1 模组数据块×1 新酿烈刀子×80 情报凭证×140 情报凭证×185 新酿烈刀子×100 情报凭证×145 新酿烈刀子×100 情报凭证×105 新酿烈刀子×100 模组数据块×1 新酿烈刀子×60 新酿烈刀子×60 新酿烈刀子×80 新酿烈刀子×80 新酿烈刀子×80 新酿烈刀子×80 新酿烈刀子×100 新酿烈刀子×100 情报凭证×150 新酿烈刀子×80 新酿烈刀子×100 新酿烈刀子×120',
        '登临意·复刻任务',
        '2024-01-18 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '手抄歌谣集×50 情报凭证×90 手抄歌谣集×50 情报凭证×105 手抄歌谣集×50 情报凭证×90 手抄歌谣集×70 情报凭证×105 手抄歌谣集×70 谜图×1 模组数据块×1 手抄歌谣集×80 情报凭证×100 情报凭证×85 手抄歌谣集×100 情报凭证×125 情报凭证×145 手抄歌谣集×100 情报凭证×145 模组数据块×1 手抄歌谣集×60 手抄歌谣集×60 手抄歌谣集×80 手抄歌谣集×80 手抄歌谣集×80 手抄歌谣集×80 手抄歌谣集×100 手抄歌谣集×100 情报凭证×150 手抄歌谣集×80 手抄歌谣集×100 手抄歌谣集×120',
        '照我以火·复刻任务',
        '2023-12-22 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '驮兽盲盒×50 物流地秤×1 驮兽盲盒×50 无明火暖炉×1 驮兽盲盒×50 “暖阳之拥”×1 驮兽盲盒×70 哈洛德×1 驮兽盲盒×70 “谢拉格山石”×1 模组数据块×1 驮兽盲盒×100 登山包×1 绒毛靠背椅×1 驮兽盲盒×100 临“石”货架×1 邮件柜×1 驮兽盲盒×100 “雪山之景”×1 模组数据块×1 驮兽盲盒×60 驮兽盲盒×60 驮兽盲盒×80 驮兽盲盒×80 驮兽盲盒×80 驮兽盲盒×80 驮兽盲盒×100 驮兽盲盒×100 饰牌《雪境》×1 驮兽盲盒×80 驮兽盲盒×100 驮兽盲盒×120',
        '银心湖列车任务',
        '2023-12-05 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '调律追忆×60 调律追忆×60 双月奖杯座×1 调律追忆×60 调律追忆×80 “空教座”×1 调律追忆×80 调律追忆×80 调律追忆×100 “求索何方”×1 模组数据块×1 调律追忆×100 盘旋八音盒×1 崭新乐谱架×1 调律追忆×100 “无障碍音乐”×1 “历史结晶”×1 调律追忆×120 演奏家席位×1 模组数据块×1 调律追忆×60 调律追忆×60 调律追忆×80 调律追忆×80 调律追忆×80 调律追忆×80 调律追忆×100 调律追忆×100 饰牌《余音》×1 调律追忆×80 调律追忆×80 调律追忆×100 调律追忆×100 调律追忆×120 调律追忆×80 调律追忆×100 调律追忆×120 改量装置×2 数据增补条×30 D32钢×1 模组数据块×1 晶体电子单元×1',
        '崔林特尔梅之金任务',
        '2023-11-01 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '进货通行证×50 进货通行证×50 情报凭证×110 进货通行证×50 进货通行证×80 进货通行证×80 情报凭证×230 进货通行证×80 进货通行证×100 模组数据块×1 进货通行证×120 情报凭证×335 进货通行证×120 情报凭证×555 进货通行证×120 模组数据块×1 进货通行证×40 进货通行证×40 进货通行证×60 进货通行证×60 进货通行证×60 进货通行证×60 进货通行证×80 进货通行证×80 情报凭证×150 进货通行证×80 进货通行证×80 进货通行证×100 进货通行证×100 进货通行证×120 进货通行证×80 进货通行证×100 进货通行证×120',
        '叙拉古人·复刻任务',
        '2023-10-22 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '里程碑碎片×1500 应急理智加强剂×1 里程碑碎片×1500 应急理智加强剂×1 里程碑碎片×1500 应急理智加强剂×1 里程碑碎片×1500 应急理智加强剂×1 里程碑碎片×1500 龙门币×15000 里程碑碎片×2000 应急理智加强剂×1 里程碑碎片×2000 应急理智加强剂×1 里程碑碎片×2000 应急理智加强剂×1 里程碑碎片×1500 技巧概要·卷2×15 里程碑碎片×1500 龙门币×30000 里程碑碎片×2000 应急理智浓缩液×1 里程碑碎片×2000 应急理智浓缩液×1 里程碑碎片×2000 应急理智浓缩液×1 里程碑碎片×1500 采购凭证×120 里程碑碎片×5000 里程碑碎片×5000 褐素纤维×4 里程碑碎片×5000 固化纤维板×1 里程碑碎片×5000 环烃聚质×4 里程碑碎片×5000 环烃预制体×1 里程碑碎片×5000',
        '战备支援任务',
        '2023-09-24 04:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '劣质燃料×50 吊顶维生设备×1 劣质燃料×50 多用途折叠椅（左）×1 劣质燃料×50 “安然时刻”×1 劣质燃料×70 冰酿×1 劣质燃料×70 管道移动灯具×1 模组数据块×1 劣质燃料×100 “安置”×1 “私人空间”×1 劣质燃料×100 标准阻燃地板×1 标准防护内墙×1 劣质燃料×100 多用途折叠椅（右）×1 模组数据块×1 劣质燃料×60 劣质燃料×60 劣质燃料×80 劣质燃料×80 劣质燃料×80 劣质燃料×80 劣质燃料×100 劣质燃料×100 饰牌《野心》×1 劣质燃料×80 劣质燃料×100 劣质燃料×120',
        '不义之财任务',
        '2023-09-05 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '《奇谈怪论》复印本×50 情报凭证×175 《奇谈怪论》复印本×50 情报凭证×275 《奇谈怪论》复印本×50 情报凭证×180 《奇谈怪论》复印本×80 情报凭证×150 《奇谈怪论》复印本×80 至简×1 《奇谈怪论》复印本×80 模组数据块×1 《奇谈怪论》复印本×100 情报凭证×165 《奇谈怪论》复印本×120 情报凭证×165 《奇谈怪论》复印本×120 模组数据块×1 “无尽之拳”×1 “赛事简化方案”×1 技巧概要·卷3×5 全新装置×2 “矛盾的爆发”×1 技巧概要·卷2×10 炽合金×2 炽合金块×1 RMA70-12×2 半自然溶剂×2 RMA70-24×1 精炼溶剂×1 聚合剂×1 固源岩组×2 提纯源岩×1 酮凝集组×2 酮阵列×1 《奇谈怪论》复印本×70 《奇谈怪论》复印本×70 《奇谈怪论》复印本×100 《奇谈怪论》复印本×100 《奇谈怪论》复印本×100 《奇谈怪论》复印本×100 《奇谈怪论》复印本×120 《奇谈怪论》复印本×120 情报凭证×150 龙门币×10000 RMA70-12×2 技巧概要·卷2×10 酮凝集组×2 晶体电子单元×1 芯片助剂×1 技巧概要·卷3×5 高级作战记录×5 《奇谈怪论》复印本×80 《奇谈怪论》复印本×100 《奇谈怪论》复印本×120',
        '理想城：长夏狂欢季·复刻任务',
        '2023-08-31 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '试炼经验×50 试炼经验×50 试炼经验×50 试炼经验×100 扩大化战略×1 经验习得×1 过热运转×1 试炼经验×100 试炼经验×100 试炼经验×100 试炼经验×150 试炼经验×150 试炼经验×150 试炼经验×150',
        '2023-08 引航者试炼任务',
        '2023-08-18 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '毛绒绒生物的毛×50 毛绒绒生物的毛×50 毛绒绒生物的毛×50 “风味魔法师”×1 毛绒绒生物的毛×80 “漂流掌舵手”×1 毛绒绒生物的毛×80 苍苔×1 模组数据块×1 毛绒绒生物的毛×100 “烈日抵御者”×1 “常青培育员”×1 毛绒绒生物的毛×100 风情街全景显示屏×1 “标志艺术家”×1 毛绒绒生物的毛×100 斑斓地砖×1 模组数据块×1 毛绒绒生物的毛×40 毛绒绒生物的毛×40 毛绒绒生物的毛×60 毛绒绒生物的毛×60 毛绒绒生物的毛×60 毛绒绒生物的毛×60 毛绒绒生物的毛×80 毛绒绒生物的毛×80 饰牌《显像》×1 毛绒绒生物的毛×40 毛绒绒生物的毛×40 毛绒绒生物的毛×60 毛绒绒生物的毛×60 毛绒绒生物的毛×80 毛绒绒生物的毛×80 毛绒绒生物的毛×100 毛绒绒生物的毛×120',
        '火山旅梦任务',
        '2023-08-01 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '神秘试剂×50 情报凭证×55 神秘试剂×50 情报凭证×170 神秘试剂×50 情报凭证×180 神秘试剂×70 星源×1 神秘试剂×70 情报凭证×435 模组数据块×1 神秘试剂×80 情报凭证×40 神秘试剂×100 情报凭证×170 神秘试剂×100 模组数据块×1 神秘试剂×60 神秘试剂×60 神秘试剂×80 神秘试剂×80 神秘试剂×80 神秘试剂×80 神秘试剂×100 神秘试剂×100 情报凭证×150 神秘试剂×80 神秘试剂×100 神秘试剂×120',
        '绿野幻梦·复刻任务',
        '2023-07-18 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '圣像碎片×50 “凝思之椅”×2 圣像碎片×50 安布罗修花纹地毯×1 圣像碎片×50 “明辨之灯”×1 圣像碎片×70 隐现×1 圣像碎片×70 有点长的长椅×1 模组数据块×1 圣像碎片×100 不太长的长椅×1 修道院吊灯×2 圣像碎片×100 “释解之桌”×1 花庭全景显示屏×1 圣像碎片×100 圣堂石砖×1 模组数据块×1 圣像碎片×60 圣像碎片×60 圣像碎片×80 圣像碎片×80 圣像碎片×80 圣像碎片×80 圣像碎片×100 圣像碎片×100 饰牌《飏升》×1 圣像碎片×80 圣像碎片×100 圣像碎片×120',
        '空想花庭任务',
        '2023-06-08 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '乐谱草稿×50 情报凭证×105 乐谱草稿×50 情报凭证×35 乐谱草稿×50 情报凭证×100 乐谱草稿×70 情报凭证×35 乐谱草稿×70 车尔尼×1 模组数据块×1 情报凭证×115 乐谱草稿×80 情报凭证×100 情报凭证×105 乐谱草稿×100 情报凭证×110 情报凭证×150 乐谱草稿×100 模组数据块×1 情报凭证×90 乐谱草稿×60 乐谱草稿×60 乐谱草稿×80 乐谱草稿×80 乐谱草稿×80 乐谱草稿×80 乐谱草稿×100 乐谱草稿×100 情报凭证×150 乐谱草稿×80 乐谱草稿×100 乐谱草稿×120',
        '尘影余音·复刻任务',
        '2023-06-20 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '飞行数据记录芯片×50 飞行数据记录芯片×50 飞行数据记录芯片×50 飞行数据记录芯片×80 飞行数据记录芯片×80 淬羽赫默×1 飞行数据记录芯片×80 模组数据块×1 飞行数据记录芯片×100 “浮游”×2 飞行数据记录芯片×120 “莱茵时代”×1 飞行数据记录芯片×120 “银色天空”×1 飞行数据记录芯片×120 模组数据块×1 飞行数据记录芯片×40 飞行数据记录芯片×40 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×80 飞行数据记录芯片×80 饰牌《陨落》×1 飞行数据记录芯片×40 飞行数据记录芯片×40 飞行数据记录芯片×60 飞行数据记录芯片×60 飞行数据记录芯片×80 飞行数据记录芯片×80 飞行数据记录芯片×100 飞行数据记录芯片×80 飞行数据记录芯片×100 飞行数据记录芯片×120',
        '孤星任务',
        '2023-05-01 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        'ItemInfoList()',
        '愚人号·复刻任务',
        '2023-04-20 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '破碎的骨片×20 破碎的骨片×20 破碎的骨片×20 源石虫的硬壳×20 泰拉大陆调查团×1 源石虫的硬壳×20 模组数据块×1 源石虫的硬壳×20 鬣犄兽的尖锐齿×20 鬣犄兽的尖锐齿×20 鬣犄兽的尖锐齿×20 模组数据块×1 破碎的骨片×10 源石虫的硬壳×10 鬣犄兽的尖锐齿×10 凶豕兽的厚实皮×10 “兽之泪”×10 破碎的骨片×50 破碎的骨片×50 破碎的骨片×20 破碎的骨片×20 破碎的骨片×30 破碎的骨片×30 源石虫的硬壳×20 源石虫的硬壳×20 源石虫的硬壳×30 源石虫的硬壳×30',
        '落叶逐火任务',
        '2023-03-07 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '龙门币×15000 应急理智加强剂×1 应急理智加强剂×1 应急理智加强剂×1 技巧概要·卷2×15 龙门币×30000 应急理智浓缩液×1 应急理智浓缩液×1 应急理智浓缩液×1 采购凭证×120',
        '战备支援任务',
        '2023-03-23 04:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '蚀刻弹弹壳×30 情报凭证×255 蚀刻弹弹壳×30 情报凭证×135 蚀刻弹弹壳×30 情报凭证×195 蚀刻弹弹壳×50 蚀刻弹弹壳×50 见行者×1 情报凭证×100 蚀刻弹弹壳×60 情报凭证×170 情报凭证×155 蚀刻弹弹壳×80 情报凭证×225 蚀刻弹弹壳×80 情报凭证×170 蚀刻弹弹壳×40 蚀刻弹弹壳×40 蚀刻弹弹壳×60 蚀刻弹弹壳×60 蚀刻弹弹壳×60 蚀刻弹弹壳×60 蚀刻弹弹壳×80 蚀刻弹弹壳×80 情报凭证×150 蚀刻弹弹壳×60 蚀刻弹弹壳×80 蚀刻弹弹壳×100',
        '吾导先路·复刻任务',
        '2023-02-21 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '新酿烈刀子×50 “鼓声争鸣”×1 新酿烈刀子×50 “终觉浅”×1 新酿烈刀子×50 “冥心坐忘”×1 新酿烈刀子×70 “且去也”×1 新酿烈刀子×70 截云×1 模组数据块×1 新酿烈刀子×80 “念归人”×1 “塞上春生”×1 新酿烈刀子×100 “梁下安”×1 新酿烈刀子×100 “涤沙洗尘”×1 新酿烈刀子×100 模组数据块×1 新酿烈刀子×60 新酿烈刀子×60 新酿烈刀子×80 新酿烈刀子×80 新酿烈刀子×80 新酿烈刀子×80 新酿烈刀子×100 新酿烈刀子×100 饰牌《扣春》×1 新酿烈刀子×80 新酿烈刀子×100 新酿烈刀子×120',
        '登临意任务',
        '2023-01-17 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '罐装晌午茶×40 情报凭证×125 罐装晌午茶×40 情报凭证×175 罐装晌午茶×60 情报凭证×160 罐装晌午茶×60 罐装晌午茶×80 寒芒克洛丝×1 情报凭证×135 罐装晌午茶×80 情报凭证×100 情报凭证×120 罐装晌午茶×80 情报凭证×125 罐装晌午茶×100 情报凭证×145 罐装晌午茶×100 情报凭证×145 罐装晌午茶×50 罐装晌午茶×50 罐装晌午茶×60 罐装晌午茶×60 罐装晌午茶×80 罐装晌午茶×80 罐装晌午茶×100 罐装晌午茶×100 情报凭证×150 罐装晌午茶×60 罐装晌午茶×80 罐装晌午茶×100',
        '将进酒·复刻任务',
        '2023-01-01 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '手抄歌谣集×50 木制果酱架×1 手抄歌谣集×50 草垛推车×1 手抄歌谣集×50 温馨烤箱×1 手抄歌谣集×70 食物储藏箱×1 手抄歌谣集×70 谜图×1 模组数据块×1 手抄歌谣集×80 百合织纹挂帘×1 石制隔断墙×1 手抄歌谣集×100 “内心的火光”×1 乡野全景显示屏×1 手抄歌谣集×100 软木彩色地板×1 模组数据块×1 手抄歌谣集×60 手抄歌谣集×60 手抄歌谣集×80 手抄歌谣集×80 手抄歌谣集×80 手抄歌谣集×80 手抄歌谣集×100 手抄歌谣集×100 饰牌《漫游》×1 手抄歌谣集×80 手抄歌谣集×100 手抄歌谣集×120',
        '照我以火任务',
        '2022-12-15 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '试炼经验×50 试炼经验×50 试炼经验×50 试炼经验×100 维续补丁×1 减退模块×1 调优重载×1 试炼经验×100 试炼经验×100 试炼经验×100 试炼经验×150 试炼经验×150 试炼经验×150 试炼经验×150',
        '2023-01 引航者试炼任务',
        '2023-01-10 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '进货通行证×50 进货通行证×50 法院吊灯×2 进货通行证×50 进货通行证×80 进货通行证×80 古典立柱×2 进货通行证×80 进货通行证×100 模组数据块×1 进货通行证×120 家族代表专座×1 进货通行证×120 灰色大地毯×1 进货通行证×120 模组数据块×1 进货通行证×40 进货通行证×40 进货通行证×60 进货通行证×60 进货通行证×60 进货通行证×60 进货通行证×80 进货通行证×80 饰牌《延续》×1 进货通行证×80 进货通行证×80 进货通行证×100 进货通行证×100 进货通行证×120 进货通行证×80 进货通行证×100 进货通行证×120',
        '叙拉古人任务',
        '2022-11-01 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '耶拉冈德之石×40 情报凭证×215 耶拉冈德之石×40 情报凭证×190 耶拉冈德之石×60 耶拉冈德之石×60 情报凭证×335 耶拉冈德之石×80 耶拉×1 情报凭证×110 耶拉冈德之石×80 情报凭证×190 情报凭证×65 耶拉冈德之石×80 情报凭证×90 耶拉冈德之石×100 情报凭证×150 耶拉冈德之石×30 耶拉冈德之石×30 耶拉冈德之石×40 耶拉冈德之石×40 耶拉冈德之石×60 耶拉冈德之石×60 耶拉冈德之石×80 耶拉冈德之石×80 情报凭证×150 耶拉冈德之石×60 耶拉冈德之石×80 耶拉冈德之石×100',
        '风雪过境·复刻任务',
        '2022-12-01 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '商业联合会声望×1 骑士领纪念模型×20 情报凭证×40 监正会声望×1 骑士领纪念模型×30 商业联合会声望×1 骑士领纪念模型×30 野鬃×1 监正会声望×1 骑士领纪念模型×40 商业联合会声望×1 骑士领纪念模型×20 情报凭证×85 监正会声望×1 骑士领纪念模型×60 商业联合会声望×1 骑士领纪念模型×60 商业联合会声望×2 情报凭证×105 监正会声望×1 骑士领纪念模型×80 监正会声望×2 情报凭证×120 商业联合会声望×1 骑士领纪念模型×80 商业联合会声望×2 情报凭证×135 监正会声望×1 骑士领纪念模型×80 监正会声望×2 情报凭证×135 商业联合会声望×4 骑士领纪念模型×40 监正会声望×4 骑士领纪念模型×40 商业联合会声望×4 骑士领纪念模型×60 监正会声望×4 骑士领纪念模型×60 商业联合会声望×4 骑士领纪念模型×60 监正会声望×4 骑士领纪念模型×60 商业联合会声望×4 骑士领纪念模型×80 商业联合会声望×4 骑士领纪念模型×100 监正会声望×4 骑士领纪念模型×80 监正会声望×4 情报凭证×150 商业联合会声望×2 骑士领纪念模型×60 商业联合会声望×2 骑士领纪念模型×80 商业联合会声望×2 骑士领纪念模型×100 监正会声望×2 骑士领纪念模型×60 监正会声望×2 骑士领纪念模型×80 监正会声望×2 骑士领纪念模型×100 无胄盟声望×6 骑士领纪念模型×40 无胄盟声望×7 骑士领纪念模型×80 无胄盟声望×6 骑士领纪念模型×60 无胄盟声望×7 骑士领纪念模型×100 无胄盟声望×6 骑士领纪念模型×80 无胄盟声望×7 骑士领纪念模型×120',
        '长夜临光·复刻任务',
        '2022-09-22 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '《奇谈怪论》复印本×50 石膏盆栽×1 《奇谈怪论》复印本×50 栏杆套件×1 《奇谈怪论》复印本×50 布制吊顶×1 《奇谈怪论》复印本×80 矮脚板凳×1 《奇谈怪论》复印本×80 至简×1 《奇谈怪论》复印本×80 模组数据块×1 《奇谈怪论》复印本×100 大水坑全景显示屏×1 《奇谈怪论》复印本×120 体验屋地板×1 《奇谈怪论》复印本×120 模组数据块×1 RMA70-12×5 “无尽之拳”×1 技巧概要·卷3×15 异铁组×5 数据增补条×10 “矛盾的爆发”×1 龙门币×30000 酮凝集组×5 数据增补条×10 酮阵列×2 双极纳米片×1 龙门币×30000 固源岩组×5 中级作战记录×30 数据增补条×10 技巧概要·卷2×25 RMA70-24×2 模组数据块×1 提纯源岩×2 异铁块×2 聚合剂×1 异铁组×5 酮凝集组×5 固源岩组×5 RMA70-12×5 《奇谈怪论》复印本×70 《奇谈怪论》复印本×70 《奇谈怪论》复印本×100 《奇谈怪论》复印本×100 《奇谈怪论》复印本×100 《奇谈怪论》复印本×100 《奇谈怪论》复印本×120 《奇谈怪论》复印本×120 饰牌《地外》×1 D32钢×1 “赛事简化方案”×1 中级作战记录×30 固源岩组×5 龙门币×20000 异铁组×5 龙门币×20000 RMA70-12×5 技巧概要·卷2×30 酮凝集组×5 晶体电子单元×1 芯片助剂×1 技巧概要·卷3×15 高级作战记录×15 《奇谈怪论》复印本×80 《奇谈怪论》复印本×100 《奇谈怪论》复印本×120',
        '理想城：长夏狂欢季任务',
        '2022-08-11 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '试炼经验×50 试炼经验×80 试炼经验×80 试炼经验×100 模块复用×1 超级闪存×1 推斥管控×1 试炼经验×80 试炼经验×100 试炼经验×100 试炼经验×150 试炼经验×150 试炼经验×150 试炼经验×150',
        '2022-08 引航者试炼任务',
        '2022-08-18 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×1 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×2 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×4 陈小姐纪念奖牌×4 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×4 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1',
        '多索雷斯假日·复刻任务',
        '2022-07-26 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '神秘试剂×50 莱茵专用文件夹（左）×1 神秘试剂×50 消毒门禁×1 神秘试剂×50 医用圆凳×2 神秘试剂×70 星源×1 神秘试剂×70 实验操作台×1 模组数据块×1 神秘试剂×80 莱茵专用文件夹（右）×1 神秘试剂×100 双屏显示台×1 神秘试剂×100 模组数据块×1 神秘试剂×60 神秘试剂×60 神秘试剂×80 神秘试剂×80 神秘试剂×80 神秘试剂×80 神秘试剂×100 神秘试剂×100 饰牌《慷慨》×1 神秘试剂×80 神秘试剂×100 神秘试剂×120',
        '绿野幻梦任务',
        '2022-07-05 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '乐谱草稿×50 三角茶几×1 乐谱草稿×50 焦糖咖啡地毯×1 乐谱草稿×50 “晚霞”×1 乐谱草稿×70 “夕照”×1 乐谱草稿×70 车尔尼×1 模组数据块×1 古朴的矮柜×1 乐谱草稿×80 典雅大提琴箱×1 仿古木制音箱×1 乐谱草稿×100 错落衣架×1 “夜幕”×1 乐谱草稿×100 模组数据块×1 艺术落地灯×1 乐谱草稿×60 乐谱草稿×60 乐谱草稿×80 乐谱草稿×80 乐谱草稿×80 乐谱草稿×80 乐谱草稿×100 乐谱草稿×100 饰牌《宽容》×1 乐谱草稿×80 乐谱草稿×100 乐谱草稿×120',
        '尘影余音任务',
        '2022-06-09 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '腐蚀的伊比利亚唱片×30 腐蚀的伊比利亚唱片×30 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×40 歌蕾蒂娅×1 腐蚀的伊比利亚唱片×60 腐蚀的伊比利亚唱片×60 情报凭证×265 腐蚀的伊比利亚唱片×60 情报凭证×310 腐蚀的伊比利亚唱片×80 情报凭证×400 腐蚀的伊比利亚唱片×80 情报凭证×250 腐蚀的伊比利亚唱片×30 腐蚀的伊比利亚唱片×30 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×80 腐蚀的伊比利亚唱片×80 情报凭证×70 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×60 腐蚀的伊比利亚唱片×80',
        '覆潮之下·复刻任务',
        '2022-05-30 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        'ItemInfoList()',
        '愚人号任务',
        '2022-05-01 15:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '手绘标本残页×40 手绘标本残页×40 手绘标本残页×60 手绘标本残页×60 暴雨×1 手绘标本残页×60 情报凭证×205 手绘标本残页×80 情报凭证×205 手绘标本残页×80 情报凭证×200 手绘标本残页×80 情报凭证×505 手绘标本残页×40 手绘标本残页×40 手绘标本残页×60 手绘标本残页×60 手绘标本残页×60 手绘标本残页×60 手绘标本残页×100 手绘标本残页×100 情报凭证×150 手绘标本残页×60 手绘标本残页×80 手绘标本残页×100',
        '遗尘漫步·复刻任务',
        '2022-03-29 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '蚀刻弹弹壳×30 “好前辈”展柜×1 蚀刻弹弹壳×30 置物架×1 蚀刻弹弹壳×30 大理石矮几×1 蚀刻弹弹壳×50 蚀刻弹弹壳×50 见行者×1 几何纹地毯×1 蚀刻弹弹壳×60 公证所地板×1 枝形悬空灯×1 蚀刻弹弹壳×80 实木坐榻×1 蚀刻弹弹壳×80 圣城全景显示屏×1 蚀刻弹弹壳×40 蚀刻弹弹壳×40 蚀刻弹弹壳×60 蚀刻弹弹壳×60 蚀刻弹弹壳×60 蚀刻弹弹壳×60 蚀刻弹弹壳×80 蚀刻弹弹壳×80 饰牌《罪责》×1 蚀刻弹弹壳×60 蚀刻弹弹壳×80 蚀刻弹弹壳×100',
        '吾导先路任务',
        '2022-03-15 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '罐装晌午茶×40 云雾盆景×1 罐装晌午茶×40 黄梨木茶桌×1 罐装晌午茶×60 黄梨木棋桌×1 罐装晌午茶×60 罐装晌午茶×80 寒芒克洛丝×1 玲笼×1 罐装晌午茶×80 诗轴×1 蜀绣纱柱×1 罐装晌午茶×80 湖光水色帘×1 罐装晌午茶×100 山城全景显示屏×1 罐装晌午茶×100 山城白玉砖×1 罐装晌午茶×50 罐装晌午茶×50 罐装晌午茶×60 罐装晌午茶×60 罐装晌午茶×80 罐装晌午茶×80 罐装晌午茶×100 罐装晌午茶×100 饰牌《同乐》×1 罐装晌午茶×60 罐装晌午茶×80 罐装晌午茶×100',
        '将进酒任务',
        '2022-01-25 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '夕墨×40 夕墨×40 夕墨×60 情报凭证×120 夕墨×60 炎狱炎熔×1 夕墨×60 情报凭证×155 夕墨×60 夕墨×60 夕墨×80 情报凭证×170 夕墨×80 情报凭证×170 夕墨×100 情报凭证×160 夕墨×100 情报凭证×350 夕墨×40 夕墨×40 夕墨×60 夕墨×60 夕墨×60 夕墨×60 夕墨×80 夕墨×80 情报凭证×150 夕墨×60 夕墨×80 夕墨×100',
        '画中人·复刻任务',
        '2022-01-10 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '耶拉冈德之石×40 尖顶立柜×1 耶拉冈德之石×40 手工纺织机×1 耶拉冈德之石×60 耶拉冈德之石×60 一体式实木床×1 耶拉冈德之石×80 耶拉×1 长毛毡毯×1 耶拉冈德之石×80 储藏用吊顶×1 防风吊灯×1 耶拉冈德之石×80 家用草药架×1 耶拉冈德之石×100 谢拉格驿站地板×1 耶拉冈德之石×30 耶拉冈德之石×30 耶拉冈德之石×40 耶拉冈德之石×40 耶拉冈德之石×60 耶拉冈德之石×60 耶拉冈德之石×80 耶拉冈德之石×80 饰牌《双峰》×1 耶拉冈德之石×60 耶拉冈德之石×80 耶拉冈德之石×100',
        '风雪过境任务',
        '2021-12-21 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '工厂铁片×30 工厂铁片×30 工厂铁片×40 情报凭证×160 工厂铁片×40 罗宾×1 工厂铁片×40 工厂铁片×60 工厂铁片×60 情报凭证×115 工厂铁片×80 工厂铁片×80 工厂铁片×80 情报凭证×310 工厂铁片×30 情报凭证×375 工厂铁片×30 工厂铁片×60 工厂铁片×60 工厂铁片×60 工厂铁片×90 工厂铁片×90 情报凭证×150 工厂铁片×60 工厂铁片×80 工厂铁片×100',
        '孤岛风云·复刻任务',
        '2021-12-07 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '商业联合会声望×1 骑士领纪念模型×20 简约透光显示屏×1 监正会声望×1 骑士领纪念模型×30 商业联合会声望×1 骑士领纪念模型×30 野鬃×1 监正会声望×1 骑士领纪念模型×40 商业联合会声望×1 骑士领纪念模型×20 白色皮质直播凳×1 监正会声望×1 骑士领纪念模型×60 商业联合会声望×1 骑士领纪念模型×60 商业联合会声望×2 “琢焰”×1 监正会声望×1 骑士领纪念模型×80 监正会声望×2 梯形矮脚访谈桌×1 商业联合会声望×1 骑士领纪念模型×80 商业联合会声望×2 访谈室双色移动挡板×1 监正会声望×1 骑士领纪念模型×80 监正会声望×2 环形显示屏吊灯×1 商业联合会声望×4 骑士领纪念模型×40 监正会声望×4 骑士领纪念模型×40 商业联合会声望×4 骑士领纪念模型×60 监正会声望×4 骑士领纪念模型×60 商业联合会声望×4 骑士领纪念模型×60 监正会声望×4 骑士领纪念模型×60 商业联合会声望×4 骑士领纪念模型×80 商业联合会声望×4 骑士领纪念模型×100 监正会声望×4 骑士领纪念模型×80 监正会声望×4 饰牌《改变》×1 商业联合会声望×2 骑士领纪念模型×60 商业联合会声望×2 骑士领纪念模型×80 商业联合会声望×2 骑士领纪念模型×100 监正会声望×2 骑士领纪念模型×60 监正会声望×2 骑士领纪念模型×80 监正会声望×2 骑士领纪念模型×100 无胄盟声望×6 骑士领纪念模型×40 无胄盟声望×7 骑士领纪念模型×80 无胄盟声望×6 骑士领纪念模型×60 无胄盟声望×7 骑士领纪念模型×100 无胄盟声望×6 骑士领纪念模型×80 无胄盟声望×7 骑士领纪念模型×120',
        '长夜临光任务',
        '2021-11-01 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '梅什科竞技证券×30 梅什科竞技证券×30 梅什科竞技证券×40 情报凭证×180 梅什科竞技证券×40 鞭刃×1 梅什科竞技证券×60 情报凭证×225 梅什科竞技证券×60 情报凭证×205 梅什科竞技证券×80 情报凭证×225 梅什科竞技证券×80 梅什科竞技证券×100 梅什科竞技证券×30 梅什科竞技证券×30 梅什科竞技证券×30 梅什科竞技证券×60 梅什科竞技证券×60 梅什科竞技证券×60 梅什科竞技证券×80 梅什科竞技证券×80 情报凭证×150 梅什科竞技证券×60 梅什科竞技证券×80 梅什科竞技证券×100 古堡清洁专家×1',
        '玛莉娅·临光·复刻任务',
        '2021-10-01 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×1 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×2 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×4 陈小姐纪念奖牌×4 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×4 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×3 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×2 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1 陈小姐纪念奖牌×1',
        '多索雷斯假日任务',
        '2021-08-03 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '机械零件×50 机械零件×50 机械零件×60 情报凭证×150 机械零件×60 特米米×1 机械零件×80 情报凭证×155 机械零件×80 情报凭证×175 机械零件×100 情报凭证×195 机械零件×100 情报凭证×190 机械零件×60 情报凭证×60 机械零件×80 情报凭证×50 机械零件×80 机械零件×100 机械零件×100 机械零件×100 情报凭证×150 机械零件×40 机械零件×60 机械零件×100',
        '密林悍将归来·复刻任务',
        '2021-07-20 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '赛事奖章×4 赛事奖章×4 赛事奖章×4 赛事奖章×4 赛事奖章×4 赛事奖章×4 赛事奖章×4 赛事奖章×4 赛事奖章×6 赛事奖章×8 赛事奖章×8 赛事奖章×10 赛事奖章×10',
        '荷谟伊智境任务',
        '2021-07-02 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '老旧贵族领铸币×50 老旧贵族领铸币×50 老旧贵族领铸币×60 情报凭证×85 老旧贵族领铸币×60 亚叶×1 老旧贵族领铸币×80 情报凭证×130 老旧贵族领铸币×80 情报凭证×160 老旧贵族领铸币×100 情报凭证×165 老旧贵族领铸币×100 情报凭证×165 老旧贵族领铸币×60 老旧贵族领铸币×60 老旧贵族领铸币×60 老旧贵族领铸币×80 老旧贵族领铸币×80 老旧贵族领铸币×80 老旧贵族领铸币×100 老旧贵族领铸币×100 情报凭证×150 老旧贵族领铸币×40 老旧贵族领铸币×60 老旧贵族领铸币×100 沃伦姆德搜查令×1 沃伦姆德搜查令×1 沃伦姆德搜查令×1 沃伦姆德搜查令×1 沃伦姆德搜查令×1',
        '沃伦姆德的薄暮·复刻任务',
        '2021-06-17 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '腐蚀的伊比利亚唱片×30 腐蚀的伊比利亚唱片×30 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×40 歌蕾蒂娅×1 腐蚀的伊比利亚唱片×60 腐蚀的伊比利亚唱片×60 便携折叠桌×1 腐蚀的伊比利亚唱片×60 折叠屏风×1 腐蚀的伊比利亚唱片×80 木架挂灯×1 腐蚀的伊比利亚唱片×80 度假村壁纸×1 腐蚀的伊比利亚唱片×30 腐蚀的伊比利亚唱片×30 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×80 腐蚀的伊比利亚唱片×80 饰牌《沉没》×1 腐蚀的伊比利亚唱片×40 腐蚀的伊比利亚唱片×60 腐蚀的伊比利亚唱片×80',
        '覆潮之下任务',
        '2021-05-01 15:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '手绘标本残页×20 手绘标本残页×20 手绘标本残页×30 手绘标本残页×30 手绘标本残页×30 暴雨×1 医疗部通用壁纸×1 手绘标本残页×60 医疗部通用地砖×1 手绘标本残页×60 卷轴式幕布×1 手绘标本残页×60 加长独立工作台×1 手绘标本残页×20 手绘标本残页×20 手绘标本残页×30 手绘标本残页×30 手绘标本残页×30 手绘标本残页×30 手绘标本残页×80 手绘标本残页×80 饰牌《针刺》×1 手绘标本残页×40 手绘标本残页×60 手绘标本残页×80',
        '遗尘漫步任务',
        '2021-04-15 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '无名的识别牌×40 情报凭证×60 无名的识别牌×40 情报凭证×165 无名的识别牌×60 铸铁×1 无名的识别牌×60 情报凭证×145 无名的识别牌×80 情报凭证×210 无名的识别牌×80 情报凭证×190 无名的识别牌×100 情报凭证×205 无名的识别牌×100 情报凭证×190 无名的识别牌×60 无名的识别牌×60 无名的识别牌×80 无名的识别牌×80 无名的识别牌×100 无名的识别牌×100 情报凭证×55 无名的识别牌×80 无名的识别牌×120 无名的识别牌×200',
        '生于黑夜·复刻任务',
        '2021-03-30 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '罗德岛物资配给证书×40 罗德岛物资配给证书×80 罗德岛物资配给证书×80 固源岩组×2 罗德岛物资配给证书×80 扭转醇×2 罗德岛物资配给证书×60 罗德岛物资配给证书×40 异铁块×1 罗德岛物资配给证书×40 酮阵列×1 罗德岛物资配给证书×40 罗德岛物资配给证书×80 糖组×2 罗德岛物资配给证书×80 罗德岛物资配给证书×80 聚酸酯组×2 罗德岛物资配给证书×80 罗德岛物资配给证书×60 聚合凝胶×1 罗德岛物资配给证书×40 罗德岛物资配给证书×40 炽合金块×1 罗德岛物资配给证书×40 罗德岛物资配给证书×80 全新装置×2 罗德岛物资配给证书×80 晶体元件×2 罗德岛物资配给证书×80 罗德岛物资配给证书×60 改量装置×1 罗德岛物资配给证书×40 提纯源岩×1 罗德岛物资配给证书×160',
        '罗德岛防御协议任务',
        '2021-02-03 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '罗德岛物资配给证书×20 罗德岛物资配给证书×20 罗德岛物资配给证书×30 便携式发电机×1 罗德岛物资配给证书×30 战车×1 罗德岛物资配给证书×30 便携式火力平台×1 罗德岛物资配给证书×60 黏着式震撼弹×1 罗德岛物资配给证书×60 展览室主吸顶灯×1 罗德岛物资配给证书×60 可破坏墙面×1 罗德岛物资配给证书×20 便携式护盾×1 罗德岛物资配给证书×30 罗德岛物资配给证书×30 罗德岛物资配给证书×30 罗德岛物资配给证书×30 罗德岛物资配给证书×80 罗德岛物资配给证书×80 罗德岛物资配给证书×40 罗德岛物资配给证书×60 罗德岛物资配给证书×80',
        '源石尘行动任务',
        '2021-02-03 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '夕墨×40 夕墨×40 夕墨×60 通透垂帘（窄）×1 夕墨×60 炎狱炎熔×1 夕墨×60 通透垂帘（宽）×1 夕墨×60 夕墨×60 夕墨×80 “如画山川"×1 夕墨×80 如水璃砖×1 夕墨×100 静水浮莲箱×1 夕墨×100 白玉黄梁榻×1 夕墨×40 夕墨×40 夕墨×60 夕墨×60 夕墨×60 夕墨×60 夕墨×80 夕墨×80 饰牌《终始》×1 夕墨×60 夕墨×80 夕墨×100',
        '画中人任务',
        '2021-02-05 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '工厂铁片×30 工厂铁片×30 工厂铁片×40 个人洗漱台×1 工厂铁片×40 罗宾×1 工厂铁片×40 工厂铁片×60 工厂铁片×60 裸露水管×1 工厂铁片×80 工厂铁片×80 工厂铁片×80 铁制风扇吊顶×1 工厂铁片×30 双层铁床×1 工厂铁片×30 工厂铁片×60 工厂铁片×60 工厂铁片×60 工厂铁片×90 工厂铁片×90 饰牌《至宝》×1 工厂铁片×60 工厂铁片×80 工厂铁片×100',
        '孤岛风云任务',
        '2020-12-17 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '梅什科竞技证券×30 梅什科竞技证券×30 梅什科竞技证券×40 净手盆×1 梅什科竞技证券×40 鞭刃×1 梅什科竞技证券×60 骑士贵族地砖×1 梅什科竞技证券×60 古典陈列柜×1 梅什科竞技证券×80 骑士贵族壁纸×1 梅什科竞技证券×80 梅什科竞技证券×100 梅什科竞技证券×30 梅什科竞技证券×30 梅什科竞技证券×30 梅什科竞技证券×60 梅什科竞技证券×60 梅什科竞技证券×60 梅什科竞技证券×80 梅什科竞技证券×80 饰牌《抗争》×1 梅什科竞技证券×60 梅什科竞技证券×80 梅什科竞技证券×100',
        '玛莉娅·临光任务',
        '2020-10-15 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '赏金猎人金币×200 赏金猎人金币×200 赏金猎人金币×400 赏金猎人金币×400 赏金猎人金币×600 赏金猎人金币×600 赏金猎人金币×800 赏金猎人金币×800 赏金猎人金币×800 赏金猎人金币×1000 赏金猎人金币×1000 情报凭证×150 赏金猎人金币×400 赏金猎人金币×800 赏金猎人金币×1200',
        '骑兵与猎人·复刻任务',
        '2020-10-01 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '机械零件×20 机械零件×20 机械零件×20 部落风沙发×1 机械零件×40 特米米×1 机械零件×40 图腾音响×1 机械零件×40 部落风地砖×1 机械零件×60 部落石墙×1 机械零件×60 大酋长宝座×1 机械零件×60 部落装饰吊灯×1 机械零件×60 部落装饰布帘×1 机械零件×60 机械零件×60 机械零件×60 机械零件×60 饰牌《畅想》×1 机械零件×60 机械零件×80 机械零件×100',
        '密林悍将归来任务',
        '2020-08-25 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '老旧贵族领铸币×20 老旧贵族领铸币×20 老旧贵族领铸币×30 “向日葵与美”×1 老旧贵族领铸币×30 亚叶×1 老旧贵族领铸币×40 莱塔尼亚饮料×1 老旧贵族领铸币×40 仿古唱片机×1 老旧贵族领铸币×50 厚重窗帘（左）×1 老旧贵族领铸币×50 厚重窗帘（右）×1 老旧贵族领铸币×40 老旧贵族领铸币×40 老旧贵族领铸币×40 老旧贵族领铸币×60 老旧贵族领铸币×60 老旧贵族领铸币×60 老旧贵族领铸币×80 老旧贵族领铸币×80 饰牌《安宁》×1 老旧贵族领铸币×40 老旧贵族领铸币×60 老旧贵族领铸币×100 沃伦姆德搜查令×1 沃伦姆德搜查令×1 沃伦姆德搜查令×1 沃伦姆德搜查令×1 沃伦姆德搜查令×1',
        '沃伦姆德的薄暮任务',
        '2020-07-09 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '无名的识别牌×20 复制版名画×1 无名的识别牌×20 临摹板名画×1 无名的识别牌×30 铸铁×1 无名的识别牌×30 七城式花纹墙纸×1 无名的识别牌×40 七城式花纹地板×1 无名的识别牌×40 大号宣传板×1 无名的识别牌×50 餐厅宣传板×1 无名的识别牌×50 双排沙发座（满位）×1 无名的识别牌×60 无名的识别牌×60 无名的识别牌×80 无名的识别牌×80 无名的识别牌×100 无名的识别牌×100 饰牌《热情》×1 无名的识别牌×20 无名的识别牌×30 无名的识别牌×50',
        '生于黑夜任务',
        '2020-04-21 12:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '赏金猎人金币×200 赏金猎人金币×200 赏金猎人金币×400 赏金猎人金币×400 赏金猎人金币×600 赏金猎人金币×600 赏金猎人金币×800 赏金猎人金币×800 赏金猎人金币×800 赏金猎人金币×1000 赏金猎人金币×1000 饰牌《日落》×1 赏金猎人金币×400 赏金猎人金币×800 赏金猎人金币×1200',
        '骑兵与猎人任务',
        '2019-05-30 10:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '报童×1 采购凭证×30 技巧概要·卷2×10 空爆×1 先锋传承信物×2 糖×6 聚酸酯×6 异铁组×3 先锋传承信物×2 招聘许可×3 招聘许可×5 寻访凭证×1 医疗传承信物×2 龙门币×10000 龙门币×15000 龙门币×20000 医疗传承信物×2',
        '限时任务任务',
        '2019-05-23 10:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×1 终极企鹅勋章×1 终极企鹅勋章×1 终极企鹅勋章×1 终极企鹅勋章×1',
        '喧闹法则·复刻任务',
        '2020-12-01 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×2 终极企鹅勋章×1 终极企鹅勋章×1 终极企鹅勋章×1 终极企鹅勋章×1 终极企鹅勋章×1',
        '喧闹法则任务',
        '2019-11-19 16:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150 游击队员徽章×50 游击队员徽章×100 游击队员徽章×150',
        '限时积分任务任务',
        '2020-05-15 04:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150 元宵通宝×50 元宵通宝×100 元宵通宝×150',
        '限时积分任务任务',
        '2020-02-08 04:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        'KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150 KFC积分×50 KFC积分×100 KFC积分×150',
        '限时积分任务任务',
        '2019-11-11 04:00:00+08:00',
        '#活动任务',
    )
    resource_stats.add(
        '黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150 黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150 黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150 黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150 黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150 黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150 黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150 黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150 黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150 黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150 黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150 黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150 黑曜石节手环×50 黑曜石节手环×100 黑曜石节手环×150',
        '限时积分任务任务',
        '2019-09-10 04:00:00+08:00',
        '#活动任务',
    )

    resource_stats.add(
        '璀璨闪耀寻访凭证×1',
        '2024-08 沉沙赫日登录活动',
        '2024-08-01 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '特勤专家寻访凭证×1',
        '2024-03 联动限时登录活动',
        '2024-03-07 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '时和岁丰寻访凭证×1',
        '2024-02 千秋一粟登录活动',
        '2024-02-01 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '烛照弦鸣寻访凭证×1',
        '2023-11 烛照弦鸣登录活动',
        '2023-11-01 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '龙门币×60000 合成玉×600 招聘许可×6 寒冬梦想放映机×1',
        '《明日方舟：冬隐归路》开播庆祝活动',
        '2023-10-06 04:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '云过天空寻访凭证×1',
        '2023-08 氤氲奇境登录活动',
        '2023-08-01 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '未来序曲寻访凭证×1',
        '2023-05 未来序曲登录活动',
        '2023-05-01 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '指引明路寻访凭证×1',
        '2023-03 砺火成锋登录活动',
        '2023-03-07 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '长风万里寻访凭证×1',
        '2023-01 万象伶仃登录活动',
        '2023-01-17 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '归狼踏影寻访凭证×1',
        '2022-11 归狼踏影登录活动',
        '2022-11-01 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '龙门币×60000 合成玉×600 招聘许可×6 希冀显影放映机×1',
        '《明日方舟：黎明前奏》开播纪念活动',
        '2022-10-28 04:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '淬火成诗寻访凭证×1',
        '2022-08 淬火成诗登录活动',
        '2022-08-11 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '晨雾灯塔寻访凭证×1',
        '2022-05 周年庆典登录活动',
        '2022-05-01 15:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '对酒当歌寻访凭证×1',
        '2022-01 浊酒澄心登录活动',
        '2022-01-25 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '唤曦炽焰寻访凭证×1',
        '2021-11 循光道途登录活动',
        '2021-11-01 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '乘风破浪寻访凭证×1',
        '2021-08 盛夏新星登录活动',
        '2021-08-03 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '幽海歌谣寻访凭证×1',
        '2021-05 周年庆典登录活动',
        '2021-05-01 15:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '特勤专家寻访凭证×1',
        '2021-03 联动限时登录活动',
        '2021-03-09 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '日落潮来寻访凭证×1',
        '2021-02 新春限时登录活动',
        '2021-02-05 16:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '只为铭记寻访凭证×1',
        '2020-11 感谢庆典登录活动',
        '2020-11-01 12:00:00+08:00',
        '#登录活动',
    )
    resource_stats.add(
        '苏醒纪念寻访凭证×1',
        '2020-05 周年庆典登录活动',
        '2020-05-01 15:00:00+08:00',
        '#登录活动',
    )

    resource_stats.add('应急理智浓缩液×1 龙门币×30000',
                       '2024-08 沉沙赫日签到活动', '2024-08-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2024-08 沉沙赫日签到活动', '2024-08-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('饰牌《橙味》×1 中级作战记录×20',
                       '2024-08 沉沙赫日签到活动', '2024-08-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 加急许可×5',
                       '2024-08 沉沙赫日签到活动', '2024-08-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('“橙味沙暴”×1 中级作战记录×20',
                       '2024-08 沉沙赫日签到活动', '2024-08-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×20',
                       '2024-08 沉沙赫日签到活动', '2024-08-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×3 技巧概要·卷2×20',
                       '2024-08 沉沙赫日签到活动', '2024-08-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 龙门币×30000',
                       '2024-08 沉沙赫日签到活动', '2024-08-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 家具零件×300',
                       '2024-08 沉沙赫日签到活动', '2024-08-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 技巧概要·卷3×8',
                       '2024-08 沉沙赫日签到活动', '2024-08-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 技巧概要·卷1×30',
                       '2024-07 无终奇语签到活动', '2024-07-09 12:00:00+08:00', '#签到活动')
    resource_stats.add('专业干员特训邀请函×1 招聘许可×5',
                       '2024-07 无终奇语签到活动', '2024-07-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×30000 初级作战记录×20',
                       '2024-07 无终奇语签到活动', '2024-07-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('“勇闯天涯”×1 技巧概要·卷2×20',
                       '2024-07 无终奇语签到活动', '2024-07-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('高级作战记录×10 加急许可×5',
                       '2024-07 无终奇语签到活动', '2024-07-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 赤金×20',
                       '2024-07 无终奇语签到活动', '2024-07-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('资深干员技巧集×1 家具零件×300',
                       '2024-07 无终奇语签到活动', '2024-07-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('残夜厝薪寻访凭证×1 应急理智浓缩液×3',
                       '2024-05 五周年庆典签到活动', '2024-05-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('PhonoR-0×1 招聘许可×5',
                       '2024-05 五周年庆典签到活动', '2024-05-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 龙门币×30000',
                       '2024-05 五周年庆典签到活动', '2024-05-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('花圃×1 中级作战记录×20',
                       '2024-05 五周年庆典签到活动', '2024-05-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 加急许可×5',
                       '2024-05 五周年庆典签到活动', '2024-05-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 技巧概要·卷2×20',
                       '2024-05 五周年庆典签到活动', '2024-05-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('周年庆典沙漏摆件×1 赤金×20',
                       '2024-05 五周年庆典签到活动', '2024-05-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 数据增补条×10',
                       '2024-05 五周年庆典签到活动', '2024-05-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('地底三百米×1 技巧概要·卷3×8',
                       '2024-05 五周年庆典签到活动', '2024-05-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 数据增补仪×3',
                       '2024-05 五周年庆典签到活动', '2024-05-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 龙门币×30000',
                       '2024-03 围攻签到活动', '2024-03-07 12:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 招聘许可×5',
                       '2024-03 围攻签到活动', '2024-03-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 数据增补条×10',
                       '2024-03 围攻签到活动', '2024-03-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('中级作战记录×20 加急许可×5',
                       '2024-03 围攻签到活动', '2024-03-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 家具零件×300',
                       '2024-03 围攻签到活动', '2024-03-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷2×20 高级作战记录×10',
                       '2024-03 围攻签到活动', '2024-03-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 龙门币×30000',
                       '2024-03 围攻签到活动', '2024-03-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('特勤专家寻访凭证×1 数据增补仪×3',
                       '2024-03 围攻签到活动', '2024-03-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 技巧概要·卷3×8',
                       '2024-03 围攻签到活动', '2024-03-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('“一览无余”×1 赤金×20',
                       '2024-03 围攻签到活动', '2024-03-16 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 龙门币×30000',
                       '2023-12 跨年纪念签到活动', '2023-12-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2023-12 跨年纪念签到活动', '2023-12-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 技巧概要·卷2×20',
                       '2023-12 跨年纪念签到活动', '2023-12-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 家具零件×300',
                       '2023-12 跨年纪念签到活动', '2023-12-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 中级作战记录×20',
                       '2023-12 跨年纪念签到活动', '2023-12-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('“欢聚定格”×1 赤金×20',
                       '2023-12 跨年纪念签到活动', '2023-12-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×3 技巧概要·卷3×8',
                       '2023-12 跨年纪念签到活动', '2023-12-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('晚间咖啡店×1 龙门币×30000',
                       '2023-12 跨年纪念签到活动', '2023-12-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 加急许可×5',
                       '2023-12 跨年纪念签到活动', '2024-01-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 中级作战记录×20',
                       '2023-12 跨年纪念签到活动', '2024-01-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 招聘许可×5',
                       '2023-11 烛照弦鸣签到活动', '2023-11-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×5 技巧概要·卷1×30',
                       '2023-11 烛照弦鸣签到活动', '2023-11-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 加急许可×5',
                       '2023-11 烛照弦鸣签到活动', '2023-11-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('“扬升”×1 家具零件×300',
                       '2023-11 烛照弦鸣签到活动', '2023-11-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('转质盐聚块×1 龙门币×30000',
                       '2023-11 烛照弦鸣签到活动', '2023-11-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 转质盐组×3',
                       '2023-11 烛照弦鸣签到活动', '2023-11-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 中级作战记录×20',
                       '2023-11 烛照弦鸣签到活动', '2023-11-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('星橼林×1 赤金×20',
                       '2023-11 烛照弦鸣签到活动', '2023-11-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 技巧概要·卷2×20',
                       '2023-11 烛照弦鸣签到活动', '2023-11-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 龙门币×30000',
                       '2023-11 烛照弦鸣签到活动', '2023-11-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 龙门币×30000',
                       '2023-09 清光邀月签到活动', '2023-09-27 16:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2023-09 清光邀月签到活动', '2023-09-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('ItemInfoList()',
                       '2023-09 清光邀月签到活动', '2023-09-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 技巧概要·卷1×30',
                       '2023-09 清光邀月签到活动', '2023-09-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 家具零件×300',
                       '2023-09 清光邀月签到活动', '2023-10-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷2×20 赤金×20',
                       '2023-09 清光邀月签到活动', '2023-10-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷3×8 高级作战记录×10',
                       '2023-09 清光邀月签到活动', '2023-10-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 龙门币×30000',
                       '2023-09 清光邀月签到活动', '2023-10-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×3 加急许可×5',
                       '2023-09 清光邀月签到活动', '2023-10-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 中级作战记录×20',
                       '2023-09 清光邀月签到活动', '2023-10-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 龙门币×30000',
                       '2023-08 氤氲奇境签到活动', '2023-08-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2023-08 氤氲奇境签到活动', '2023-08-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('“暖身浴”×1 技巧概要·卷2×20',
                       '2023-08 氤氲奇境签到活动', '2023-08-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 家具零件×300',
                       '2023-08 氤氲奇境签到活动', '2023-08-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 中级作战记录×20',
                       '2023-08 氤氲奇境签到活动', '2023-08-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×20',
                       '2023-08 氤氲奇境签到活动', '2023-08-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×3 技巧概要·卷3×8',
                       '2023-08 氤氲奇境签到活动', '2023-08-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('悠然假日\\sHDm57×1 龙门币×30000',
                       '2023-08 氤氲奇境签到活动', '2023-08-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 加急许可×5',
                       '2023-08 氤氲奇境签到活动', '2023-08-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 中级作战记录×20',
                       '2023-08 氤氲奇境签到活动', '2023-08-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('喜上梢头×1 应急理智浓缩液×1',
                       '2023-01 新春限时签到活动', '2023-01-22 04:00:00+08:00', '#签到活动')
    resource_stats.add('转质盐组×3 龙门币×30000',
                       '2023-01 新春限时签到活动', '2023-01-23 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 招聘许可×5',
                       '2023-01 新春限时签到活动', '2023-01-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷3×8 应急理智浓缩液×1',
                       '2023-01 新春限时签到活动', '2023-01-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('化合切削液×3 初级作战记录×25',
                       '2023-01 新春限时签到活动', '2023-01-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 技巧概要·卷2×20',
                       '2023-01 新春限时签到活动', '2023-01-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 加急许可×5',
                       '2023-01 新春限时签到活动', '2023-01-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('转质盐聚块×1 家具零件×200',
                       '2023-01 新春限时签到活动', '2023-01-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('枯木逢春×1 招聘许可×5',
                       '2023-01 新春限时签到活动', '2023-01-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×5 赤金×20',
                       '2023-01 新春限时签到活动', '2023-01-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('切削原液×1 中级作战记录×20',
                       '2023-01 新春限时签到活动', '2023-02-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('高级作战记录×15 应急理智浓缩液×1',
                       '2023-01 新春限时签到活动', '2023-02-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 家具零件×200',
                       '2023-01 新春限时签到活动', '2023-02-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 加急许可×5',
                       '2023-01 新春限时签到活动', '2023-02-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷3×8 龙门币×30000',
                       '2023-01 新春限时签到活动', '2023-02-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×800',
                       '2023-01 新春限时签到活动', '2023-01-22 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×580',
                       '2023-01 新春限时签到活动', '2023-01-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200',
                       '2023-01 新春限时签到活动', '2023-01-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×660',
                       '2023-01 新春限时签到活动', '2023-02-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 龙门币×30000',
                       '2022-12 跨年纪念签到活动', '2022-12-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2022-12 跨年纪念签到活动', '2022-12-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 技巧概要·卷1×30',
                       '2022-12 跨年纪念签到活动', '2022-12-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 家具零件×300',
                       '2022-12 跨年纪念签到活动', '2022-12-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('火树灵×1 中级作战记录×20',
                       '2022-12 跨年纪念签到活动', '2022-12-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×20',
                       '2022-12 跨年纪念签到活动', '2022-12-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×3 技巧概要·卷2×20',
                       '2022-12 跨年纪念签到活动', '2022-12-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 龙门币×30000',
                       '2022-12 跨年纪念签到活动', '2022-12-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('兔兔贺年立牌×1 加急许可×5',
                       '2022-12 跨年纪念签到活动', '2023-01-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 中级作战记录×20',
                       '2022-12 跨年纪念签到活动', '2023-01-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 招聘许可×5',
                       '2022-11 正逢雨季签到活动', '2022-11-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 技巧概要·卷1×30',
                       '2022-11 正逢雨季签到活动', '2022-11-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 加急许可×5',
                       '2022-11 正逢雨季签到活动', '2022-11-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('遥乡之径×1 家具零件×300',
                       '2022-11 正逢雨季签到活动', '2022-11-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补仪×5 龙门币×30000',
                       '2022-11 正逢雨季签到活动', '2022-11-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('转质盐聚块×1 转质盐组×3',
                       '2022-11 正逢雨季签到活动', '2022-11-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷3×8 中级作战记录×20',
                       '2022-11 正逢雨季签到活动', '2022-11-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×20',
                       '2022-11 正逢雨季签到活动', '2022-11-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 技巧概要·卷2×20',
                       '2022-11 正逢雨季签到活动', '2022-11-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 龙门币×30000',
                       '2022-11 正逢雨季签到活动', '2022-11-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 技巧概要·卷2×10',
                       '2022-10 秋风送爽签到活动', '2022-10-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 中级作战记录×20',
                       '2022-10 秋风送爽签到活动', '2022-10-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('一体式休闲座舱×1 招聘许可×5',
                       '2022-10 秋风送爽签到活动', '2022-10-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 家具零件×300',
                       '2022-10 秋风送爽签到活动', '2022-10-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('风雪邀请×1 赤金×15',
                       '2022-10 秋风送爽签到活动', '2022-10-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 高级作战记录×10',
                       '2022-10 秋风送爽签到活动', '2022-10-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 龙门币×30000',
                       '2022-10 秋风送爽签到活动', '2022-10-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 中级作战记录×25',
                       '2022-09 桂时逢月签到活动', '2022-09-08 12:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷3×8 龙门币×30000',
                       '2022-09 桂时逢月签到活动', '2022-09-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('ItemInfoList()',
                       '2022-09 桂时逢月签到活动', '2022-09-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2022-09 桂时逢月签到活动', '2022-09-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 家具零件×300',
                       '2022-09 桂时逢月签到活动', '2022-09-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 加急许可×5',
                       '2022-09 桂时逢月签到活动', '2022-09-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 高级作战记录×15',
                       '2022-09 桂时逢月签到活动', '2022-09-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 高级作战记录×20',
                       '2022-08 夏日限时签到活动', '2022-08-11 12:00:00+08:00', '#签到活动')
    resource_stats.add('玻璃柜风扇×1 龙门币×30000',
                       '2022-08 夏日限时签到活动', '2022-08-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 化合切削液×5',
                       '2022-08 夏日限时签到活动', '2022-08-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 技巧概要·卷1×30',
                       '2022-08 夏日限时签到活动', '2022-08-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 赤金×20',
                       '2022-08 夏日限时签到活动', '2022-08-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2022-08 夏日限时签到活动', '2022-08-16 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 加急许可×5',
                       '2022-08 夏日限时签到活动', '2022-08-17 04:00:00+08:00', '#签到活动')
    resource_stats.add('数据增补条×10 技巧概要·卷2×20',
                       '2022-08 夏日限时签到活动', '2022-08-18 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 龙门币×30000',
                       '2022-08 夏日限时签到活动', '2022-08-19 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 家具零件×200',
                       '2022-08 夏日限时签到活动', '2022-08-20 04:00:00+08:00', '#签到活动')
    resource_stats.add('艾草落地灯×1 应急理智浓缩液×1',
                       '2022-06 端阳正午签到活动', '2022-06-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×10000 招聘许可×5',
                       '2022-06 端阳正午签到活动', '2022-06-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('赤金×55 应急理智浓缩液×1',
                       '2022-06 端阳正午签到活动', '2022-06-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('高级作战记录×10 加急许可×5',
                       '2022-06 端阳正午签到活动', '2022-06-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×20000 合成玉×200',
                       '2022-06 端阳正午签到活动', '2022-06-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 至纯源石×1',
                       '2022-06 端阳正午签到活动', '2022-06-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 技巧概要·卷2×15',
                       '2022-06 端阳正午签到活动', '2022-06-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×2 周年庆典转盘×1',
                       '2022-05 周年庆典签到活动', '2022-05-01 15:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 高级作战记录×10',
                       '2022-05 周年庆典签到活动', '2022-05-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('医疗芯片×2 龙门币×30000',
                       '2022-05 周年庆典签到活动', '2022-05-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 破冰×1',
                       '2022-05 周年庆典签到活动', '2022-05-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 技巧概要·卷2×20',
                       '2022-05 周年庆典签到活动', '2022-05-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 高级作战记录×10',
                       '2022-05 周年庆典签到活动', '2022-05-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 招聘许可×5',
                       '2022-05 周年庆典签到活动', '2022-05-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智浓缩液×1 加急许可×5',
                       '2022-05 周年庆典签到活动', '2022-05-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('模组数据块×1 家具零件×200',
                       '2022-05 周年庆典签到活动', '2022-05-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 龙门币×30000',
                       '2022-05 周年庆典签到活动', '2022-05-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('“山中弈”×1 应急理智顶液×1',
                       '2022-02 福至岁来签到活动', '2022-02-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('辅助芯片×2 龙门币×30000',
                       '2022-02 福至岁来签到活动', '2022-02-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 特种芯片×2',
                       '2022-02 福至岁来签到活动', '2022-02-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('招聘许可×5 初级作战记录×25',
                       '2022-02 福至岁来签到活动', '2022-02-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 半自然溶剂×5',
                       '2022-02 福至岁来签到活动', '2022-02-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('待晴日×1 技巧概要·卷1×20',
                       '2022-02 福至岁来签到活动', '2022-02-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 家具零件×200',
                       '2022-02 福至岁来签到活动', '2022-02-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 龙门币×30000',
                       '2022-02 福至岁来签到活动', '2022-02-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷2×15 中级作战记录×20',
                       '2022-02 福至岁来签到活动', '2022-02-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 加急许可×5',
                       '2022-02 福至岁来签到活动', '2022-02-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×2 赤金×20',
                       '2022-02 福至岁来签到活动', '2022-02-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 化合切削液×5',
                       '2022-02 福至岁来签到活动', '2022-02-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 高级作战记录×10',
                       '2022-02 福至岁来签到活动', '2022-02-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 技巧概要·卷3×10',
                       '2022-02 福至岁来签到活动', '2022-02-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('“亭上雪”×1 龙门币×30000',
                       '2022-02 福至岁来签到活动', '2022-02-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('九色鹿×1 应急理智顶液×1',
                       '2022-01 吉兆呈祥签到活动', '2022-01-10 16:00:00+08:00', '#签到活动')
    resource_stats.add('三水锰矿×3 招聘许可×5',
                       '2022-01 吉兆呈祥签到活动', '2022-01-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 中级作战记录×20',
                       '2022-01 吉兆呈祥签到活动', '2022-01-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 晶体元件×5',
                       '2022-01 吉兆呈祥签到活动', '2022-01-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 家具零件×200',
                       '2022-01 吉兆呈祥签到活动', '2022-01-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 龙门币×20000',
                       '2022-01 吉兆呈祥签到活动', '2022-01-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('“缥缈云间”×1 加急许可×5',
                       '2022-01 吉兆呈祥签到活动', '2022-01-16 04:00:00+08:00', '#签到活动')
    resource_stats.add('大黑的节日新居×1 辅助芯片组×3',
                       '2021-12 跨年纪念签到活动', '2021-12-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('未完成的礼物×1 龙门币×30000',
                       '2021-12 跨年纪念签到活动', '2021-12-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×15',
                       '2021-12 跨年纪念签到活动', '2021-12-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 中级作战记录×15',
                       '2021-12 跨年纪念签到活动', '2021-12-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 技巧概要·卷2×15',
                       '2021-12 跨年纪念签到活动', '2021-12-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 招聘许可×5',
                       '2021-12 跨年纪念签到活动', '2021-12-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 龙门币×30000',
                       '2021-12 跨年纪念签到活动', '2021-12-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('高级作战记录×15 应急理智顶液×1',
                       '2021-12 跨年纪念签到活动', '2021-12-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('炎式梳妆案×1 技巧概要·卷3×10',
                       '2021-12 跨年纪念签到活动', '2022-01-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 家具零件×100',
                       '2021-12 跨年纪念签到活动', '2022-01-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 “他日幻景”×1',
                       '2021-11 感谢庆典签到活动', '2021-11-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 正义骑士号×1',
                       '2021-11 感谢庆典签到活动', '2021-11-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2021-11 感谢庆典签到活动', '2021-11-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 招聘许可×5',
                       '2021-11 感谢庆典签到活动', '2021-11-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 家具零件×200',
                       '2021-11 感谢庆典签到活动', '2021-11-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 龙门币×30000',
                       '2021-11 感谢庆典签到活动', '2021-11-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 技巧概要·卷2×20',
                       '2021-11 感谢庆典签到活动', '2021-11-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2021-11 感谢庆典签到活动', '2021-11-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 淡金庆典×1',
                       '2021-11 感谢庆典签到活动', '2021-11-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 芯片助剂×1',
                       '2021-11 感谢庆典签到活动', '2021-11-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('手工移动木梯×1 龙门币×30000',
                       '2021-10 秋意盎然签到活动', '2021-10-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 技巧概要·卷3×15',
                       '2021-10 秋意盎然签到活动', '2021-10-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 赤金×20',
                       '2021-10 秋意盎然签到活动', '2021-10-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('中级作战记录×25 RMA70-12×3',
                       '2021-10 秋意盎然签到活动', '2021-10-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2021-10 秋意盎然签到活动', '2021-10-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 龙门币×30000',
                       '2021-10 秋意盎然签到活动', '2021-10-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('诗人的假日×1 高级作战记录×20',
                       '2021-10 秋意盎然签到活动', '2021-10-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('宫殿风吊椅×1 应急理智顶液×1',
                       '2021-09 怀望桑梓签到活动', '2021-09-17 12:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 高级作战记录×25',
                       '2021-09 怀望桑梓签到活动', '2021-09-18 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×30000 赤金×20',
                       '2021-09 怀望桑梓签到活动', '2021-09-19 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 招聘许可×5',
                       '2021-09 怀望桑梓签到活动', '2021-09-20 04:00:00+08:00', '#签到活动')
    resource_stats.add('制茶案×1 技巧概要·卷3×10',
                       '2021-09 怀望桑梓签到活动', '2021-09-21 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 家具零件×300',
                       '2021-09 怀望桑梓签到活动', '2021-09-22 04:00:00+08:00', '#签到活动')
    resource_stats.add('倾声歌唱×1 龙门币×30000',
                       '2021-09 怀望桑梓签到活动', '2021-09-23 04:00:00+08:00', '#签到活动')
    resource_stats.add('狙击芯片×2 应急理智顶液×1',
                       '2021-08 假日酬宾签到活动', '2021-08-03 12:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×20000 招聘许可×5',
                       '2021-08 假日酬宾签到活动', '2021-08-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('假日落地风扇×1 中级作战记录×10',
                       '2021-08 假日酬宾签到活动', '2021-08-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×15',
                       '2021-08 假日酬宾签到活动', '2021-08-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('高级作战记录×5 家具零件×200',
                       '2021-08 假日酬宾签到活动', '2021-08-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷2×15 全新装置×3',
                       '2021-08 假日酬宾签到活动', '2021-08-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 加急许可×5',
                       '2021-08 假日酬宾签到活动', '2021-08-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 应急理智顶液×1',
                       '2021-08 假日酬宾签到活动', '2021-08-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 龙门币×20000',
                       '2021-08 假日酬宾签到活动', '2021-08-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('海风水果刨冰车×1 技巧概要·卷3×10',
                       '2021-08 假日酬宾签到活动', '2021-08-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 龙门币×10000',
                       '2021-06 端阳正午签到活动', '2021-06-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 加急许可×5',
                       '2021-06 端阳正午签到活动', '2021-06-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷2×15 招聘许可×5',
                       '2021-06 端阳正午签到活动', '2021-06-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 龙门币×20000',
                       '2021-06 端阳正午签到活动', '2021-06-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙舟榻（首）×1 赤金×55',
                       '2021-06 端阳正午签到活动', '2021-06-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 高级作战记录×10',
                       '2021-06 端阳正午签到活动', '2021-06-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙舟榻（尾）×1 芯片助剂×1',
                       '2021-06 端阳正午签到活动', '2021-06-16 04:00:00+08:00', '#签到活动')
    resource_stats.add('周年庆典茶柜×1 龙门币×30000',
                       '2021-05 周年庆典签到活动', '2021-05-01 15:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×30000 应急理智顶液×2',
                       '2021-05 周年庆典签到活动', '2021-05-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×25',
                       '2021-05 周年庆典签到活动', '2021-05-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 高级作战记录×10',
                       '2021-05 周年庆典签到活动', '2021-05-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 技巧概要·卷2×15',
                       '2021-05 周年庆典签到活动', '2021-05-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 招聘许可×5',
                       '2021-05 周年庆典签到活动', '2021-05-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 龙门币×30000',
                       '2021-05 周年庆典签到活动', '2021-05-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 应急理智顶液×2',
                       '2021-05 周年庆典签到活动', '2021-05-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 高级作战记录×15',
                       '2021-05 周年庆典签到活动', '2021-05-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('专业人士×1 加急许可×5',
                       '2021-05 周年庆典签到活动', '2021-05-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 龙门币×10000',
                       '2021-03 锋芒将现签到活动', '2021-03-09 12:00:00+08:00', '#签到活动')
    resource_stats.add('瞄具型望远镜×1 技巧概要·卷1×30',
                       '2021-03 锋芒将现签到活动', '2021-03-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 高级作战记录×10',
                       '2021-03 锋芒将现签到活动', '2021-03-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 固源岩×6',
                       '2021-03 锋芒将现签到活动', '2021-03-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 技巧概要·卷2×20',
                       '2021-03 锋芒将现签到活动', '2021-03-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('争夺目标×1 至纯源石×1',
                       '2021-03 锋芒将现签到活动', '2021-03-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('特勤专家寻访凭证×1 芯片助剂×1',
                       '2021-03 锋芒将现签到活动', '2021-03-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('祥纹摆扇×1 应急理智顶液×1',
                       '2021-02 岁暮点雪签到活动', '2021-02-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 龙门币×30000',
                       '2021-02 岁暮点雪签到活动', '2021-02-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 先锋芯片×2',
                       '2021-02 岁暮点雪签到活动', '2021-02-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 中级作战记录×20',
                       '2021-02 岁暮点雪签到活动', '2021-02-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 术师芯片×2',
                       '2021-02 岁暮点雪签到活动', '2021-02-16 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 招聘许可×5',
                       '2021-02 岁暮点雪签到活动', '2021-02-17 04:00:00+08:00', '#签到活动')
    resource_stats.add('兔兔打鼓玩具×1 技巧概要·卷2×15',
                       '2021-02 岁暮点雪签到活动', '2021-02-18 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×2 加急许可×5',
                       '2021-02 岁暮点雪签到活动', '2021-02-19 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 龙门币×30000',
                       '2021-02 岁暮点雪签到活动', '2021-02-20 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×300 应急理智顶液×1',
                       '2021-02 岁暮点雪签到活动', '2021-02-21 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 家具零件×200',
                       '2021-02 岁暮点雪签到活动', '2021-02-22 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 赤金×20',
                       '2021-02 岁暮点雪签到活动', '2021-02-23 04:00:00+08:00', '#签到活动')
    resource_stats.add('孤寒峭×1 高级作战记录×10',
                       '2021-02 岁暮点雪签到活动', '2021-02-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 技巧概要·卷3×10',
                       '2021-02 岁暮点雪签到活动', '2021-02-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('“曲树提灯”×1 龙门币×30000',
                       '2021-02 岁暮点雪签到活动', '2021-02-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('雪糕兔兔沙发×1 龙门币×30000',
                       '2020-12 跨年限时登录活动', '2020-12-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('“方块兄弟”×1 应急理智顶液×2',
                       '2020-12 跨年限时登录活动', '2020-12-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 赤金×25',
                       '2020-12 跨年限时登录活动', '2020-12-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 高级作战记录×10',
                       '2020-12 跨年限时登录活动', '2020-12-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 技巧概要·卷2×15',
                       '2020-12 跨年限时登录活动', '2020-12-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 招聘许可×5',
                       '2020-12 跨年限时登录活动', '2020-12-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 龙门币×30000',
                       '2020-12 跨年限时登录活动', '2020-12-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('丝绒雪花毯×1 应急理智顶液×2',
                       '2020-12 跨年限时登录活动', '2020-12-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('八音蛋匠人×1 高级作战记录×15',
                       '2020-12 跨年限时登录活动', '2021-01-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 加急许可×5',
                       '2020-12 跨年限时登录活动', '2021-01-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 新款游乐机械×1',
                       '2020-11 感谢庆典签到活动', '2020-11-01 12:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2020-11 感谢庆典签到活动', '2020-11-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 晶体元件×4',
                       '2020-11 感谢庆典签到活动', '2020-11-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 中级作战记录×20',
                       '2020-11 感谢庆典签到活动', '2020-11-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 技巧概要·卷2×20',
                       '2020-11 感谢庆典签到活动', '2020-11-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 家具零件×200',
                       '2020-11 感谢庆典签到活动', '2020-11-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2020-11 感谢庆典签到活动', '2020-11-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 龙门币×30000',
                       '2020-11 感谢庆典签到活动', '2020-11-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 渗透×1',
                       '2020-11 感谢庆典签到活动', '2020-11-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 芯片助剂×1',
                       '2020-11 感谢庆典签到活动', '2020-11-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×600',
                       '2020-10 猎人补给进行中', '2020-10-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×800',
                       '2020-10 猎人补给进行中', '2020-10-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×1000',
                       '2020-10 猎人补给进行中', '2020-10-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×1300',
                       '2020-10 猎人补给进行中', '2020-10-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×1600',
                       '2020-10 猎人补给进行中', '2020-10-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×2000',
                       '2020-10 猎人补给进行中', '2020-10-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×2300',
                       '2020-10 猎人补给进行中', '2020-10-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×2500',
                       '2020-10 猎人补给进行中', '2020-10-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('赏金猎人金币×2800',
                       '2020-10 猎人补给进行中', '2020-10-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('兔兔捣药机×1 应急理智顶液×2',
                       '2020-10 限时活动进行中', '2020-10-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 赤金×20',
                       '2020-10 限时活动进行中', '2020-10-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 高级作战记录×10',
                       '2020-10 限时活动进行中', '2020-10-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 芯片助剂×1',
                       '2020-10 限时活动进行中', '2020-10-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 龙门币×30000',
                       '2020-10 限时活动进行中', '2020-10-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('假日摇椅×1 加急许可×5',
                       '2020-10 限时活动进行中', '2020-10-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 家具零件×100',
                       '2020-10 限时活动进行中', '2020-10-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('端午粽子沙发×1 赤金×55',
                       '2020-06 限时活动进行中', '2020-06-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 招聘许可×5',
                       '2020-06 限时活动进行中', '2020-06-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷2×15 术师芯片×4',
                       '2020-06 限时活动进行中', '2020-06-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 医疗芯片×4',
                       '2020-06 限时活动进行中', '2020-06-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('合成玉×200 高级作战记录×10',
                       '2020-06 限时活动进行中', '2020-06-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 技巧概要·卷3×10',
                       '2020-06 限时活动进行中', '2020-06-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('光影×1',
                       '2020-06 限时活动进行中', '2020-07-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 THRM-EX×1',
                       '2020-05 周年庆典签到活动', '2020-05-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 龙门币×40000',
                       '2020-05 周年庆典签到活动', '2020-05-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 高级作战记录×20',
                       '2020-05 周年庆典签到活动', '2020-05-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 改量装置×2',
                       '2020-05 周年庆典签到活动', '2020-05-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 芯片助剂×2',
                       '2020-05 周年庆典签到活动', '2020-05-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 家具零件×200',
                       '2020-05 周年庆典签到活动', '2020-05-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 周年庆典壁灯×1',
                       '2020-05 周年庆典签到活动', '2020-05-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 技巧概要·卷2×10',
                       '2020-05 周年庆典签到活动', '2020-05-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 周年庆典地毯×1',
                       '2020-05 周年庆典签到活动', '2020-05-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 白马醇×3',
                       '2020-05 周年庆典签到活动', '2020-05-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 周年庆典床榻×1',
                       '2020-05 周年庆典签到活动', '2020-05-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 提纯源岩×5',
                       '2020-05 周年庆典签到活动', '2020-05-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 家具零件×200',
                       '2020-05 周年庆典签到活动', '2020-05-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 应急理智顶液×1 见习联结者×1',
                       '2020-05 周年庆典签到活动', '2020-05-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 龙门币×10000',
                       '2020-03 限时活动进行中', '2020-03-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛物资补给×5 招聘许可×5',
                       '2020-03 限时活动进行中', '2020-03-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×1 加急许可×5',
                       '2020-03 限时活动进行中', '2020-03-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛物资补给×5 合成玉×300',
                       '2020-03 限时活动进行中', '2020-03-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 中级作战记录×20',
                       '2020-03 限时活动进行中', '2020-03-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛物资补给×5 芯片助剂×1',
                       '2020-03 限时活动进行中', '2020-03-08 04:00:00+08:00', '#签到活动')
    resource_stats.add('高原访客×1 家具零件×200',
                       '2020-03 限时活动进行中', '2020-03-09 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛迎春红包×2 应急理智顶液×2',
                       '2020-01 限时活动进行中', '2020-01-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛迎春红包×2 龙门币×30000',
                       '2020-01 限时活动进行中', '2020-01-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛迎春红包×2 凝胶×5',
                       '2020-01 限时活动进行中', '2020-01-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛迎春红包×2 高级作战记录×20',
                       '2020-01 限时活动进行中', '2020-01-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('罗德岛迎春红包×2 至纯源石×2',
                       '2020-01 限时活动进行中', '2020-01-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('芯片助剂×1 炽合金×5',
                       '2020-01 限时活动进行中', '2020-01-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('君子兰×1',
                       '2020-01 限时活动进行中', '2020-01-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('招聘许可×5 加急许可×5',
                       '2020-01 限时活动进行中', '2020-02-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('技巧概要·卷3×10 技巧概要·卷2×10',
                       '2020-01 限时活动进行中', '2020-02-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 家具零件×200',
                       '2020-01 限时活动进行中', '2020-02-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 龙门币×30000',
                       '2019-12 限时活动进行中', '2019-12-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 快乐卫士×1',
                       '2019-12 限时活动进行中', '2019-12-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 中级作战记录×30',
                       '2019-12 限时活动进行中', '2019-12-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2019-12 限时活动进行中', '2019-12-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 家具零件×200',
                       '2019-12 限时活动进行中', '2019-12-29 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 招聘许可×5',
                       '2019-12 限时活动进行中', '2019-12-30 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 合成玉×300',
                       '2019-12 限时活动进行中', '2019-12-31 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 寻访凭证×1',
                       '2019-12 限时活动进行中', '2020-01-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门新印象壁纸×1 龙门新印象地板×1',
                       '2019-12 限时活动进行中', '2020-01-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 芯片助剂×1',
                       '2019-12 限时活动进行中', '2020-01-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2',
                       '2019-11 限时活动进行中', '2019-11-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('中级作战记录×30',
                       '2019-11 限时活动进行中', '2019-11-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('固源岩组×5 合成玉×300',
                       '2019-11 限时活动进行中', '2019-11-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('赤金×20 龙门币×30000',
                       '2019-11 限时活动进行中', '2019-11-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×2',
                       '2019-11 限时活动进行中', '2019-11-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 应急理智顶液×1',
                       '2019-11 限时活动进行中', '2019-11-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('小鬼当家×1 芯片助剂×1',
                       '2019-11 限时活动进行中', '2019-11-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2',
                       '2019-10 限时活动进行中', '2019-10-01 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×30000 中级作战记录×30',
                       '2019-10 限时活动进行中', '2019-10-02 04:00:00+08:00', '#签到活动')
    resource_stats.add('酮凝集组×5 合成玉×300',
                       '2019-10 限时活动进行中', '2019-10-03 04:00:00+08:00', '#签到活动')
    resource_stats.add('招聘许可×5 加急许可×5',
                       '2019-10 限时活动进行中', '2019-10-04 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×2',
                       '2019-10 限时活动进行中', '2019-10-05 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 应急理智顶液×1',
                       '2019-10 限时活动进行中', '2019-10-06 04:00:00+08:00', '#签到活动')
    resource_stats.add('威塞克斯的信件×1 芯片助剂×1',
                       '2019-10 限时活动进行中', '2019-10-07 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2',
                       '2019-08 限时活动进行中', '2019-08-15 04:00:00+08:00', '#签到活动')
    resource_stats.add('龙门币×30000',
                       '2019-08 限时活动进行中', '2019-08-16 04:00:00+08:00', '#签到活动')
    resource_stats.add('异铁组×5 合成玉×300',
                       '2019-08 限时活动进行中', '2019-08-17 04:00:00+08:00', '#签到活动')
    resource_stats.add('中级作战记录×30',
                       '2019-08 限时活动进行中', '2019-08-18 04:00:00+08:00', '#签到活动')
    resource_stats.add('至纯源石×2',
                       '2019-08 限时活动进行中', '2019-08-19 04:00:00+08:00', '#签到活动')
    resource_stats.add('招聘许可×5 赤金×20',
                       '2019-08 限时活动进行中', '2019-08-20 04:00:00+08:00', '#签到活动')
    resource_stats.add('寻访凭证×1 芯片助剂×1',
                       '2019-08 限时活动进行中', '2019-08-21 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 轻锰矿×5',
                       '2019-07 限时活动进行中', '2019-07-22 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2019-07 限时活动进行中', '2019-07-23 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2',
                       '2019-07 限时活动进行中', '2019-07-24 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 招聘许可×5',
                       '2019-07 限时活动进行中', '2019-07-25 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×2',
                       '2019-07 限时活动进行中', '2019-07-26 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 寻访凭证×1',
                       '2019-07 限时活动进行中', '2019-07-27 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 辛味×1 芯片助剂×2',
                       '2019-07 限时活动进行中', '2019-07-28 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×2 RMA70-12×5',
                       '2019-07 限时活动进行中', '2019-07-09 16:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×1',
                       '2019-07 限时活动进行中', '2019-07-10 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 斑点×1',
                       '2019-07 限时活动进行中', '2019-07-11 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 招聘许可×5',
                       '2019-07 限时活动进行中', '2019-07-12 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 至纯源石×2',
                       '2019-07 限时活动进行中', '2019-07-13 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 寻访凭证×1',
                       '2019-07 限时活动进行中', '2019-07-14 04:00:00+08:00', '#签到活动')
    resource_stats.add('应急理智顶液×1 植物种志×1 芯片助剂×2',
                       '2019-07 限时活动进行中', '2019-07-15 04:00:00+08:00', '#签到活动')

    resource_stats.add(
        '合成玉×593.1521428571428',
        '2024-08 幸运墙登录活动',
        (DateTrigger('2024-08-01 16:00:00+08:00')
         | CronTrigger(hour=4, start_date='2024-08-02 04:00:00+08:00', end_date='2024-08-15 04:00:00+08:00', timezone=CST)),
        '#幸运墙活动',
    )
    resource_stats.add(
        '合成玉×593.1521428571428',
        '2024-02 龙门幸运墙登录活动',
        (DateTrigger('2024-02-01 16:00:00+08:00')
         | CronTrigger(hour=4, start_date='2024-02-02 04:00:00+08:00', end_date='2024-02-15 04:00:00+08:00', timezone=CST)),
        '#幸运墙活动',
    )
    resource_stats.add(
        '合成玉×593.1521428571428',
        '2023-08 龙门幸运墙登录活动',
        (DateTrigger('2023-08-01 16:00:00+08:00')
         | CronTrigger(hour=4, start_date='2023-08-02 04:00:00+08:00', end_date='2023-08-15 04:00:00+08:00', timezone=CST)),
        '#幸运墙活动',
    )
    resource_stats.add(
        '合成玉×593.1521428571428',
        '2023-01 龙门幸运墙登录活动',
        (DateTrigger('2023-01-17 16:00:00+08:00')
         | CronTrigger(hour=4, start_date='2023-01-18 04:00:00+08:00', end_date='2023-01-31 04:00:00+08:00', timezone=CST)),
        '#幸运墙活动',
    )
    resource_stats.add(
        '合成玉×593.1521428571428',
        '2022-08 际崖城惊奇墙登录活动',
        (DateTrigger('2022-08-11 16:00:00+08:00')
         | CronTrigger(hour=4, start_date='2022-08-12 04:00:00+08:00', end_date='2022-08-25 04:00:00+08:00', timezone=CST)),
        '#幸运墙活动',
    )
    resource_stats.add(
        '合成玉×593.1521428571428',
        '2022-01 龙门幸运墙登录活动',
        (DateTrigger('2022-01-25 16:00:00+08:00')
         | CronTrigger(hour=4, start_date='2022-01-26 04:00:00+08:00', end_date='2022-02-08 04:00:00+08:00', timezone=CST)),
        '#幸运墙活动',
    )
    resource_stats.add(
        '合成玉×593.1521428571428',
        '2021-08 双日城惊奇墙',
        (DateTrigger('2021-08-03 16:00:00+08:00')
         | CronTrigger(hour=4, start_date='2021-08-04 04:00:00+08:00', end_date='2021-08-17 04:00:00+08:00', timezone=CST)),
        '#幸运墙活动',
    )
    resource_stats.add(
        '合成玉×593.1521428571428',
        '2021-02 龙门幸运墙登录活动',
        (DateTrigger('2021-02-05 16:00:00+08:00')
         | CronTrigger(hour=4, start_date='2021-02-06 04:00:00+08:00', end_date='2021-02-19 04:00:00+08:00', timezone=CST)),
        '#幸运墙活动',
    )

    resource_stats.add(
        '试炼经验×-3625 龙门币×10000 中级作战记录×5 异铁块×1 糖组×2 数据增补仪×5 全新装置×2 技巧概要·卷2×5 龙门币×10000 中级作战记录×5 模组数据块×1 家具零件×100 技巧概要·卷2×5 糖组×2 全新装置×2 寻访凭证×1 数据增补条×5 技巧概要·卷2×5 糖组×2 D32钢×1 数据增补仪×5 中级作战记录×5 全新装置×2 糖组×2 酮阵列×1 贺新禧×1 全新装置×2 龙门币×10000 技巧概要·卷3×5 高级作战记录×5 数据增补仪×5 家具零件×100 烧结核凝晶×1 龙门币×10000 高级作战记录×5 模组数据整合块×1 晶体电路×1 技巧概要·卷2×5 龙门币×10000 糖组×2 中级作战记录×5 家具零件×100 技巧概要·卷3×5 全新装置×2 高级作战记录×5 龙门币×10000',
        '引航者试炼#04试炼之路',
        '2024-02-22 16:00:00+08:00',
        '#引航者试炼#04', '#引航者试炼',
    )
    resource_stats.add(
        '试炼经验×-3625 龙门币×10000 中级作战记录×5 改量装置×1 RMA70-12×2 数据增补仪×5 异铁组×2 技巧概要·卷2×5 龙门币×10000 中级作战记录×5 模组数据块×1 家具零件×100 技巧概要·卷2×5 异铁组×2 RMA70-12×2 寻访凭证×1 数据增补条×5 技巧概要·卷2×5 RMA70-12×2 D32钢×1 数据增补仪×5 中级作战记录×5 RMA70-12×2 异铁组×2 白马醇×1 悠然假日\\sHD49×1 异铁组×2 龙门币×10000 技巧概要·卷3×5 高级作战记录×5 数据增补仪×5 家具零件×100 烧结核凝晶×1 龙门币×10000 高级作战记录×5 模组数据整合块×1 炽合金块×1 技巧概要·卷2×5 龙门币×10000 异铁组×2 中级作战记录×5 家具零件×100 技巧概要·卷3×5 RMA70-12×2 高级作战记录×5 龙门币×10000',
        '引航者试炼#03试炼之路',
        '2023-08-18 16:00:00+08:00',
        '#引航者试炼#03', '#引航者试炼',
    )
    resource_stats.add(
        '试炼经验×-3625 龙门币×10000 中级作战记录×5 精炼溶剂×1 扭转醇×2 数据增补仪×5 转质盐组×2 技巧概要·卷2×5 龙门币×10000 中级作战记录×5 模组数据块×1 家具零件×100 技巧概要·卷2×5 转质盐组×2 扭转醇×2 寻访凭证×1 数据增补条×5 技巧概要·卷2×5 扭转醇×2 聚合剂×1 数据增补仪×5 中级作战记录×5 扭转醇×2 转质盐组×2 三水锰矿×1 枝头馥×1 转质盐组×2 龙门币×10000 技巧概要·卷3×5 高级作战记录×5 数据增补仪×5 家具零件×100 烧结核凝晶×1 龙门币×10000 高级作战记录×5 模组数据整合块×1 聚合凝胶×1 技巧概要·卷2×5 龙门币×10000 转质盐组×2 中级作战记录×5 家具零件×100 技巧概要·卷3×5 扭转醇×2 高级作战记录×5 龙门币×10000',
        '引航者试炼#02试炼之路',
        '2023-01-10 16:00:00+08:00',
        '#引航者试炼#02', '#引航者试炼',
    )
    resource_stats.add(
        '试炼经验×-3625 龙门币×10000 中级作战记录×5 数据增补条×10 凝胶×2 模组数据块×1 炽合金×2 技巧概要·卷2×5 龙门币×10000 中级作战记录×5 数据增补仪×5 家具零件×100 技巧概要·卷2×5 模组数据块×1 凝胶×2 寻访凭证×1 炽合金×2 技巧概要·卷2×5 数据增补条×10 D32钢×1 数据增补仪×5 中级作战记录×5 凝胶×2 炽合金×2 异铁块×1 夏卉\\sFA374×1 模组数据块×1 龙门币×10000 技巧概要·卷3×5 高级作战记录×5 数据增补仪×5 晶体电子单元×1 家具零件×100 龙门币×10000 高级作战记录×5 模组数据块×1 五水研磨石×1 炽合金×2 技巧概要·卷2×5 技巧概要·卷3×5 数据增补仪×5 凝胶×2 炽合金×2 切削原液×1 凝胶×2 龙门币×10000',
        '引航者试炼#01试炼之路',
        '2022-08-18 16:00:00+08:00',
        '#引航者试炼#01', '#引航者试炼',
    )