from models import ResourceStats


def add_intelligence_store_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "情报凭证×-1845 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 糖聚块×4 异铁块×4",
        "空想花庭·复刻情报凭证区",
        "2024-06-25 16:00:00+08:00",
        "#空想花庭·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1745 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 提纯源岩×4 转质盐聚块×4",
        "孤星·复刻情报凭证区",
        "2024-05-24 16:00:00+08:00",
        "#孤星·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1825 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 固化纤维板×4 环烃预制体×4",
        "源石尘行动·复刻情报凭证区",
        "2024-03-21 16:00:00+08:00",
        "#源石尘行动·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1825 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 晶体电路×4 切削原液×4",
        "登临意·复刻情报凭证区",
        "2024-01-18 16:00:00+08:00",
        "#登临意·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1745 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 白马醇×4 精炼溶剂×4",
        "照我以火·复刻情报凭证区",
        "2023-12-22 16:00:00+08:00",
        "#照我以火·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1785 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 聚合凝胶×4 RMA70-24×4",
        "叙拉古人·复刻情报凭证区",
        "2023-10-22 16:00:00+08:00",
        "#叙拉古人·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1805 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 三水锰矿×4 炽合金块×4",
        "理想城：长夏狂欢季·复刻情报凭证区",
        "2023-08-31 16:00:00+08:00",
        "#理想城：长夏狂欢季·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1805 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 聚酸酯块×4 五水研磨石×4",
        "绿野幻梦·复刻情报凭证区",
        "2023-07-18 16:00:00+08:00",
        "#绿野幻梦·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1845 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 糖聚块×4 异铁块×4",
        "尘影余音·复刻情报凭证区",
        "2023-06-20 16:00:00+08:00",
        "#尘影余音·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1785 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 提纯源岩×4 酮阵列×4",
        "愚人号·复刻情报凭证区",
        "2023-04-20 16:00:00+08:00",
        "#愚人号·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1885 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 改量装置×4 转质盐聚块×4",
        "吾导先路·复刻情报凭证区",
        "2023-02-21 16:00:00+08:00",
        "#吾导先路·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1765 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 精炼溶剂×4 切削原液×4",
        "将进酒·复刻情报凭证区",
        "2023-01-01 16:00:00+08:00",
        "#将进酒·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1805 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 晶体电路×4 白马醇×4",
        "风雪过境·复刻情报凭证区",
        "2022-12-01 16:00:00+08:00",
        "#风雪过境·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1785 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 聚合凝胶×4 RMA70-24×4",
        "长夜临光·复刻情报凭证区",
        "2022-09-22 16:00:00+08:00",
        "#长夜临光·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1805 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 三水锰矿×4 炽合金块×4",
        "多索雷斯假日·复刻情报凭证区",
        "2022-07-26 16:00:00+08:00",
        "#多索雷斯假日·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1805 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 聚酸酯块×4 五水研磨石×4",
        "覆潮之下·复刻情报凭证区",
        "2022-05-30 16:00:00+08:00",
        "#覆潮之下·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1845 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 糖聚块×4 异铁块×4",
        "遗尘漫步·复刻情报凭证区",
        "2022-03-29 16:00:00+08:00",
        "#遗尘漫步·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1785 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 提纯源岩×4 酮阵列×4",
        "画中人·复刻情报凭证区",
        "2022-01-10 16:00:00+08:00",
        "#画中人·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1765 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 精炼溶剂×4 切削原液×4",
        "孤岛风云·复刻情报凭证区",
        "2021-12-07 16:00:00+08:00",
        "#孤岛风云·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1865 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 改量装置×4 白马醇×4",
        "玛莉娅·临光·复刻情报凭证区",
        "2021-10-01 16:00:00+08:00",
        "#玛莉娅·临光·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1865 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 RMA70-24×4 晶体电路×4",
        "密林悍将归来·复刻情报凭证区",
        "2021-07-20 16:00:00+08:00",
        "#密林悍将归来·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1765 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 炽合金块×4 聚合凝胶×4",
        "沃伦姆德的薄暮·复刻情报凭证区",
        "2021-06-17 16:00:00+08:00",
        "#沃伦姆德的薄暮·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1805 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 五水研磨石×4 三水锰矿×4",
        "生于黑夜·复刻情报凭证区",
        "2021-03-30 16:00:00+08:00",
        "#生于黑夜·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1845 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 异铁块×4 聚酸酯块×4",
        "喧闹法则·复刻情报凭证区",
        "2020-12-01 16:00:00+08:00",
        "#喧闹法则·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1825 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 酮阵列×4 糖聚块×4",
        "骑兵与猎人·复刻情报凭证区",
        "2020-10-01 16:00:00+08:00",
        "#骑兵与猎人·复刻", "#情报凭证区",
    )
    resource_stats.add(
        "情报凭证×-1865 "
        "合成玉×2000 龙门币×30000 高级作战记录×20 技巧概要·卷3×20 改量装置×4 提纯源岩×4",
        "火蓝之心·复刻情报凭证区",
        "2020-08-11 16:00:00+08:00",
        "#火蓝之心·复刻", "#情报凭证区",
    )
