from models import ResourceStats


def add_integrated_strategies_resources(resource_stats: ResourceStats):
    resource_stats.add(
        '龙门币×20000 高级作战记录×10 半自然溶剂×10 技巧概要·卷1×30 切削原液×3 龙门币×20000 高级作战记录×10 化合切削液×10 技巧概要·卷2×10 精炼溶剂×3 龙门币×20000 高级作战记录×10 半自然溶剂×10 技巧概要·卷3×3 切削原液×3 龙门币×20000 高级作战记录×10 精炼溶剂×3 技巧概要·卷1×30 晶体电子单元×1 龙门币×30000 晶体电路×3 高级作战记录×15 异铁块×3 暮落×1 龙门币×30000 D32钢×1 高级作战记录×15 糖聚块×3 暮落的信物×1 龙门币×30000 提纯源岩×3 高级作战记录×15 炽合金块×3 暮落的信物×1 龙门币×30000 双极纳米片×1 高级作战记录×15 五水研磨石×3 暮落的信物×1 龙门币×50000 改量装置×3 高级作战记录×20 RMA70-24×3 暮落的信物×1 龙门币×50000 聚合剂×1 高级作战记录×20 酮阵列×3 暮落的信物×1',
        '傀影与猩红孤钻里程碑奖励（2022年01月）',
        '2022-01-05 16:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 白马醇×3 技巧概要·卷1×30 晶体电子单元×1 龙门币×50000 高级作战记录×20 “猩红剧团”×1 技巧概要·卷2×10 三水锰矿×3 龙门币×50000 高级作战记录×20 D32钢×1 技巧概要·卷3×3 “傀影常在”×1',
        '傀影与猩红孤钻里程碑奖励（2022年02月）',
        '2022-02-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 聚合凝胶×3 技巧概要·卷1×30 双极纳米片×1 龙门币×50000 高级作战记录×20 聚酸酯块×3 技巧概要·卷2×10 切削原液×3 龙门币×50000 高级作战记录×20 聚合剂×1 技巧概要·卷3×3 古堡印象家具收藏包一×1',
        '傀影与猩红孤钻里程碑奖励（2022年03月）',
        '2022-03-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 精炼溶剂×3 技巧概要·卷1×30 晶体电子单元×1 龙门币×50000 高级作战记录×20 晶体电路×3 技巧概要·卷2×10 异铁块×3 龙门币×50000 高级作战记录×20 D32钢×1 技巧概要·卷3×3 焦点×1',
        '傀影与猩红孤钻里程碑奖励（2022年04月）',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 糖聚块×3 技巧概要·卷1×30 双极纳米片×1 龙门币×50000 高级作战记录×20 提纯源岩×3 技巧概要·卷2×10 古堡印象家具收藏包二×1 龙门币×50000 高级作战记录×20 聚合剂×1 技巧概要·卷3×3 特种皇家信物×4',
        '傀影与猩红孤钻里程碑奖励（2022年05月）',
        '2022-05-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 炽合金块×3 技巧概要·卷1×30 晶体电子单元×1 龙门币×50000 高级作战记录×20 五水研磨石×3 技巧概要·卷2×10 改量装置×3 龙门币×50000 高级作战记录×20 D32钢×1 技巧概要·卷3×3 “终幕之告”×1',
        '傀影与猩红孤钻里程碑奖励（2022年06月）',
        '2022-06-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 RMA70-24×3 技巧概要·卷1×30 双极纳米片×1 龙门币×50000 高级作战记录×20 酮阵列×3 技巧概要·卷2×10 白马醇×3 龙门币×50000 高级作战记录×20 聚合剂×1 技巧概要·卷3×3 残垣×1',
        '傀影与猩红孤钻里程碑奖励（2022年07月）',
        '2022-07-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 三水锰矿×3 技巧概要·卷1×30 晶体电子单元×1 龙门币×50000 高级作战记录×20 聚合凝胶×3 技巧概要·卷2×10 聚酸酯块×3 龙门币×50000 高级作战记录×20 切削原液×3 技巧概要·卷3×3 D32钢×1',
        '傀影与猩红孤钻里程碑奖励（2022年08月）',
        '2022-08-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 先锋芯片组×4 高级作战记录×15 龙门币×30000',
        '傀影与猩红孤钻月度奖励（2022年01月）',
        '2022-01-05 16:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 近卫芯片组×4 高级作战记录×15 龙门币×30000',
        '傀影与猩红孤钻月度奖励（2022年02月）',
        '2022-02-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 重装芯片组×4 高级作战记录×15 龙门币×30000',
        '傀影与猩红孤钻月度奖励（2022年03月）',
        '2022-03-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 狙击芯片组×4 高级作战记录×15 龙门币×30000',
        '傀影与猩红孤钻月度奖励（2022年04月）',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 术师芯片组×4 高级作战记录×15 龙门币×30000',
        '傀影与猩红孤钻月度奖励（2022年05月）',
        '2022-05-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 医疗芯片组×4 高级作战记录×15 龙门币×30000',
        '傀影与猩红孤钻月度奖励（2022年06月）',
        '2022-06-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 辅助芯片组×4 高级作战记录×15 龙门币×30000',
        '傀影与猩红孤钻月度奖励（2022年07月）',
        '2022-07-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 特种芯片组×4 高级作战记录×15 龙门币×30000',
        '傀影与猩红孤钻月度奖励（2022年08月）',
        '2022-08-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略月度奖励',
    )
    resource_stats.add(
        '聚合剂×1 白马醇×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '傀影与猩红孤钻深入调查-十万火急',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略深入调查',
    )
    resource_stats.add(
        '双极纳米片×1 提纯源岩×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '傀影与猩红孤钻深入调查-逢生',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略深入调查',
    )
    resource_stats.add(
        'D32钢×1 异铁块×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '傀影与猩红孤钻深入调查-经营',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略深入调查',
    )
    resource_stats.add(
        '晶体电子单元×1 酮阵列×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '傀影与猩红孤钻深入调查-火力覆盖',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略深入调查',
    )
    resource_stats.add(
        '聚合剂×1 聚合凝胶×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '傀影与猩红孤钻深入调查-地面推进',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略深入调查',
    )
    resource_stats.add(
        '双极纳米片×1 炽合金块×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '傀影与猩红孤钻深入调查-路难寻',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略深入调查',
    )
    resource_stats.add(
        'D32钢×1 晶体电路×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '傀影与猩红孤钻深入调查-奇遇记',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略深入调查',
    )
    resource_stats.add(
        '晶体电子单元×1 三水锰矿×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '傀影与猩红孤钻深入调查-剑走偏锋',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略深入调查',
    )
    resource_stats.add(
        '聚合剂×1 五水研磨石×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '傀影与猩红孤钻深入调查-迷茫新世界',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略深入调查',
    )
    resource_stats.add(
        '双极纳米片×1 RMA70-24×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '傀影与猩红孤钻深入调查-白手起家',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略深入调查',
    )
    resource_stats.add(
        'D32钢×1 白马醇×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '傀影与猩红孤钻深入调查-夺宝奇兵',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略深入调查',
    )
    resource_stats.add(
        '晶体电子单元×1 改量装置×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '傀影与猩红孤钻深入调查-娱乐至上',
        '2022-04-01 04:00:00+08:00',
        '#傀影与猩红孤钻', '#集成战略深入调查',
    )
    resource_stats.add(
        '龙门币×20000 高级作战记录×10 晶体元件×10 技巧概要·卷1×30 异铁块×3 龙门币×20000 高级作战记录×10 糖组×10 技巧概要·卷2×10 白马醇×3 龙门币×20000 高级作战记录×10 炽合金×10 技巧概要·卷3×3 RMA70-24×3 龙门币×20000 高级作战记录×10 晶体电路×3 技巧概要·卷1×30 D32钢×1 龙门币×30000 提纯源岩×3 高级作战记录×15 聚酸酯块×3 海沫×1 龙门币×30000 晶体电子单元×1 高级作战记录×15 糖聚块×3 海沫的信物×1 龙门币×30000 酮阵列×3 高级作战记录×15 炽合金块×3 海沫的信物×1 龙门币×30000 聚合剂×1 高级作战记录×15 切削原液×3 海沫的信物×1 龙门币×50000 五水研磨石×3 高级作战记录×20 改量装置×3 海沫的信物×1 龙门币×50000 双极纳米片×1 高级作战记录×20 精炼溶剂×3 海沫的信物×1 龙门币×50000 高级作战记录×20 聚合凝胶×3 技巧概要·卷1×30 晶体电子单元×1 龙门币×50000 高级作战记录×20 数据增补条×60 技巧概要·卷2×10 三水锰矿×3 龙门币×50000 高级作战记录×20 D32钢×1 技巧概要·卷3×3 “深蓝印记”×1',
        '水月与深蓝之树里程碑奖励（2022年09月）',
        '2022-09-27 12:00:00+08:00',
        '#水月与深蓝之树', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 转质盐聚块×3 技巧概要·卷1×30 烧结核凝晶×1 龙门币×50000 高级作战记录×20 异铁块×3 技巧概要·卷2×10 白马醇×3 龙门币×50000 高级作战记录×20 聚合剂×1 技巧概要·卷3×3 海滨印象家具收藏包一×1',
        '水月与深蓝之树里程碑奖励（2022年11月）',
        '2022-11-01 04:00:00+08:00',
        '#水月与深蓝之树', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 RMA70-24×3 技巧概要·卷1×30 双极纳米片×1 龙门币×50000 高级作战记录×20 晶体电路×3 技巧概要·卷2×10 提纯源岩×3 龙门币×50000 高级作战记录×20 烧结核凝晶×1 技巧概要·卷3×3 夏日餮宴×1',
        '水月与深蓝之树里程碑奖励（2022年12月）',
        '2022-12-01 04:00:00+08:00',
        '#水月与深蓝之树', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 异铁块×3 技巧概要·卷1×30 D32钢×1 龙门币×50000 高级作战记录×20 糖聚块×3 技巧概要·卷2×10 海滨印象家具收藏包二×1 龙门币×50000 高级作战记录×20 晶体电子单元×1 技巧概要·卷3×3 模组数据整合箱×1',
        '水月与深蓝之树里程碑奖励（2023年01月）',
        '2023-01-01 04:00:00+08:00',
        '#水月与深蓝之树', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 酮阵列×3 技巧概要·卷1×30 聚合剂×1 龙门币×50000 高级作战记录×20 炽合金块×3 技巧概要·卷2×10 切削原液×3 龙门币×50000 高级作战记录×20 双极纳米片×1 技巧概要·卷3×3 失效石碑×1',
        '水月与深蓝之树里程碑奖励（2023年02月）',
        '2023-02-01 04:00:00+08:00',
        '#水月与深蓝之树', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 五水研磨石×3 技巧概要·卷1×30 烧结核凝晶×1 龙门币×50000 高级作战记录×20 改量装置×3 技巧概要·卷2×10 精炼溶剂×3 龙门币×50000 高级作战记录×20 D32钢×1 技巧概要·卷3×3 “循环”×1',
        '水月与深蓝之树里程碑奖励（2023年03月）',
        '2023-03-01 03:59:59+08:00',
        '#水月与深蓝之树', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 聚合凝胶×3 技巧概要·卷1×30 晶体电子单元×1 龙门币×50000 高级作战记录×20 三水锰矿×3 技巧概要·卷2×10 转质盐聚块×3 龙门币×50000 高级作战记录×20 聚合剂×1 技巧概要·卷3×3 彼端×1',
        '水月与深蓝之树里程碑奖励（2023年04月）',
        '2023-04-01 03:59:59+08:00',
        '#水月与深蓝之树', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 酮阵列×3 技巧概要·卷1×30 烧结核凝晶×1 龙门币×50000 高级作战记录×20 炽合金块×3 技巧概要·卷2×10 切削原液×3 龙门币×50000 高级作战记录×20 双极纳米片×1 技巧概要·卷3×3 三水锰矿×3',
        '水月与深蓝之树里程碑奖励（2023年05月）',
        '2023-05-01 03:59:59+08:00',
        '#水月与深蓝之树', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 先锋芯片组×4 高级作战记录×15 龙门币×30000',
        '水月与深蓝之树月度奖励（2022年09月）',
        '2022-09-27 12:00:00+08:00',
        '#水月与深蓝之树', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 近卫芯片组×4 高级作战记录×15 龙门币×30000',
        '水月与深蓝之树月度奖励（2022年11月）',
        '2022-11-01 04:00:00+08:00',
        '#水月与深蓝之树', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 重装芯片组×4 高级作战记录×15 龙门币×30000',
        '水月与深蓝之树月度奖励（2022年12月）',
        '2022-12-01 04:00:00+08:00',
        '#水月与深蓝之树', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 狙击芯片组×4 高级作战记录×15 龙门币×30000',
        '水月与深蓝之树月度奖励（2023年01月）',
        '2023-01-01 04:00:00+08:00',
        '#水月与深蓝之树', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 术师芯片组×4 高级作战记录×15 龙门币×30000',
        '水月与深蓝之树月度奖励（2023年02月）',
        '2023-02-01 04:00:00+08:00',
        '#水月与深蓝之树', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 医疗芯片组×4 高级作战记录×15 龙门币×30000',
        '水月与深蓝之树月度奖励（2023年03月）',
        '2023-03-01 03:59:59+08:00',
        '#水月与深蓝之树', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 辅助芯片组×4 高级作战记录×15 龙门币×30000',
        '水月与深蓝之树月度奖励（2023年04月）',
        '2023-04-01 03:59:59+08:00',
        '#水月与深蓝之树', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 特种芯片组×4 高级作战记录×15 龙门币×30000',
        '水月与深蓝之树月度奖励（2023年05月）',
        '2023-05-01 03:59:59+08:00',
        '#水月与深蓝之树', '#集成战略月度奖励',
    )
    resource_stats.add(
        '聚合剂×1 精炼溶剂×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '水月与深蓝之树深入调查-感知流逝',
        '2022-12-29 16:00:00+08:00',
        '#水月与深蓝之树', '#集成战略深入调查',
    )
    resource_stats.add(
        '双极纳米片×1 酮阵列×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '水月与深蓝之树深入调查-畸变加剧',
        '2022-12-29 16:00:00+08:00',
        '#水月与深蓝之树', '#集成战略深入调查',
    )
    resource_stats.add(
        'D32钢×1 晶体电路×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '水月与深蓝之树深入调查-肾上腺素飙升',
        '2022-12-29 16:00:00+08:00',
        '#水月与深蓝之树', '#集成战略深入调查',
    )
    resource_stats.add(
        '晶体电子单元×1 三水锰矿×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '水月与深蓝之树深入调查-躁狂',
        '2022-12-29 16:00:00+08:00',
        '#水月与深蓝之树', '#集成战略深入调查',
    )
    resource_stats.add(
        'D32钢×1 提纯源岩×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '水月与深蓝之树深入调查-泰拉的晨曦',
        '2022-12-29 16:00:00+08:00',
        '#水月与深蓝之树', '#集成战略深入调查',
    )
    resource_stats.add(
        '晶体电子单元×1 聚合凝胶×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '水月与深蓝之树深入调查-议会使者',
        '2022-12-29 16:00:00+08:00',
        '#水月与深蓝之树', '#集成战略深入调查',
    )
    resource_stats.add(
        '聚合剂×1 切削原液×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '水月与深蓝之树深入调查-女皇之声',
        '2022-12-29 16:00:00+08:00',
        '#水月与深蓝之树', '#集成战略深入调查',
    )
    resource_stats.add(
        '烧结核凝晶×1 五水研磨石×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '水月与深蓝之树深入调查-加冕',
        '2022-12-29 16:00:00+08:00',
        '#水月与深蓝之树', '#集成战略深入调查',
    )
    resource_stats.add(
        '晶体电子单元×1 转质盐聚块×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '水月与深蓝之树深入调查-全副武装',
        '2022-12-29 16:00:00+08:00',
        '#水月与深蓝之树', '#集成战略深入调查',
    )
    resource_stats.add(
        '双极纳米片×1 异铁块×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '水月与深蓝之树深入调查-妙手回春',
        '2022-12-29 16:00:00+08:00',
        '#水月与深蓝之树', '#集成战略深入调查',
    )
    resource_stats.add(
        'D32钢×1 炽合金块×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '水月与深蓝之树深入调查-出其不意',
        '2022-12-29 16:00:00+08:00',
        '#水月与深蓝之树', '#集成战略深入调查',
    )
    resource_stats.add(
        '烧结核凝晶×1 RMA70-24×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '水月与深蓝之树深入调查-旁敲侧击',
        '2022-12-29 16:00:00+08:00',
        '#水月与深蓝之树', '#集成战略深入调查',
    )
    resource_stats.add(
        '龙门币×20000 高级作战记录×10 RMA70-12×10 技巧概要·卷1×30 改量装置×3 龙门币×20000 高级作战记录×10 半自然溶剂×10 技巧概要·卷2×10 五水研磨石×3 龙门币×20000 高级作战记录×10 糖组×10 技巧概要·卷3×3 炽合金块×3 龙门币×20000 高级作战记录×10 切削原液×3 技巧概要·卷1×30 D32钢×1 龙门币×30000 糖聚块×3 高级作战记录×15 酮阵列×3 凛视×1 龙门币×30000 晶体电子单元×1 高级作战记录×15 RMA70-24×3 凛视的信物×1 龙门币×30000 精炼溶剂×3 高级作战记录×15 聚酸酯块×3 凛视的信物×1 龙门币×30000 聚合剂×1 高级作战记录×15 三水锰矿×3 凛视的信物×1 龙门币×50000 转质盐聚块×3 高级作战记录×20 白马醇×3 凛视的信物×1 龙门币×50000 双极纳米片×1 高级作战记录×20 提纯源岩×3 凛视的信物×1',
        '探索者的银凇止境里程碑奖励（2023年07月）',
        '2023-07-13 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 晶体电路×3 技巧概要·卷1×30 烧结核凝晶×1 龙门币×50000 高级作战记录×20 数据增补条×60 技巧概要·卷2×10 异铁块×3 龙门币×50000 高级作战记录×20 D32钢×1 技巧概要·卷3×3 “安玛的慈悲”×1',
        '探索者的银凇止境里程碑奖励（2023年08月）',
        '2023-08-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 聚合凝胶×3 技巧概要·卷1×30 晶体电子单元×1 龙门币×50000 高级作战记录×20 萨米印象家具收藏包一×1 技巧概要·卷2×10 改量装置×3 龙门币×50000 高级作战记录×20 聚合剂×1 技巧概要·卷3×3 北地引路人×1',
        '探索者的银凇止境里程碑奖励（2023年09月）',
        '2023-09-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 五水研磨石×3 技巧概要·卷1×30 双极纳米片×1 龙门币×50000 高级作战记录×20 炽合金块×3 技巧概要·卷2×10 切削原液×3 龙门币×50000 高级作战记录×20 烧结核凝晶×1 技巧概要·卷3×3 银凇×1',
        '探索者的银凇止境里程碑奖励（2023年10月）',
        '2023-10-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 糖聚块×3 技巧概要·卷1×30 D32钢×1 龙门币×50000 高级作战记录×20 酮阵列×3 技巧概要·卷2×10 萨米印象家具收藏包二×1 龙门币×50000 高级作战记录×20 晶体电子单元×1 技巧概要·卷3×3 模组数据整合箱×1',
        '探索者的银凇止境里程碑奖励（2023年11月）',
        '2023-11-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 RMA70-24×3 技巧概要·卷1×30 聚合剂×1 龙门币×50000 高级作战记录×20 “前景”×1 技巧概要·卷2×10 精炼溶剂×3 龙门币×50000 高级作战记录×20 双极纳米片×1 技巧概要·卷3×3 悠然假日\\sHD71×1',
        '探索者的银凇止境里程碑奖励（2023年12月）',
        '2023-12-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 聚酸酯块×3 技巧概要·卷1×30 烧结核凝晶×1 龙门币×50000 高级作战记录×20 三水锰矿×3 技巧概要·卷2×10 转质盐聚块×3 龙门币×50000 高级作战记录×20 D32钢×1 技巧概要·卷3×3 “终古”×1',
        '探索者的银凇止境里程碑奖励（2024年01月）',
        '2024-01-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 白马醇×3 技巧概要·卷1×30 晶体电子单元×1 龙门币×50000 高级作战记录×20 提纯源岩×3 技巧概要·卷2×10 晶体电路×3 龙门币×50000 高级作战记录×20 聚合剂×1 技巧概要·卷3×3 始发×1',
        '探索者的银凇止境里程碑奖励（2024年02月）',
        '2024-02-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 先锋芯片组×4 高级作战记录×15 龙门币×30000',
        '探索者的银凇止境月度奖励（2023年07月）',
        '2023-07-13 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 近卫芯片组×4 高级作战记录×15 龙门币×30000',
        '探索者的银凇止境月度奖励（2023年08月）',
        '2023-08-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 重装芯片组×4 高级作战记录×15 龙门币×30000',
        '探索者的银凇止境月度奖励（2023年09月）',
        '2023-09-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 狙击芯片组×4 高级作战记录×15 龙门币×30000',
        '探索者的银凇止境月度奖励（2023年10月）',
        '2023-10-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 术师芯片组×4 高级作战记录×15 龙门币×30000',
        '探索者的银凇止境月度奖励（2023年11月）',
        '2023-11-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 医疗芯片组×4 高级作战记录×15 龙门币×30000',
        '探索者的银凇止境月度奖励（2023年12月）',
        '2023-12-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 辅助芯片组×4 高级作战记录×15 龙门币×30000',
        '探索者的银凇止境月度奖励（2024年01月）',
        '2024-01-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 特种芯片组×4 高级作战记录×15 龙门币×30000',
        '探索者的银凇止境月度奖励（2024年02月）',
        '2024-02-01 04:00:00+08:00',
        '#探索者的银凇止境', '#集成战略月度奖励',
    )
    resource_stats.add(
        '双极纳米片×1 白马醇×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-观察者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        'D32钢×1 改量装置×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-吹号者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        '聚合剂×1 精炼溶剂×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-营商者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        '晶体电子单元×1 聚合凝胶×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-勘察者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        '烧结核凝晶×1 转质盐聚块×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-天真者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        'D32钢×1 异铁块×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-护卫者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        '晶体电子单元×1 RMA70-24×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-环游者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        '双极纳米片×1 晶体电路×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-受困者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        '聚合剂×1 提纯源岩×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-观光者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        '双极纳米片×1 切削原液×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-复仇者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        '烧结核凝晶×1 酮阵列×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-愚痴者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        'D32钢×1 炽合金块×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-异化者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        '聚合剂×1 五水研磨石×2 中级作战记录×10 龙门币×10000 技巧概要·卷1×15',
        '探索者的银凇止境深入调查-先知者的视野',
        '2023-10-22 16:00:00+08:00',
        '#探索者的银凇止境', '#集成战略深入调查',
    )
    resource_stats.add(
        '龙门币×20000 高级作战记录×10 褐素纤维×10 技巧概要·卷1×30 改量装置×3 龙门币×20000 高级作战记录×10 半自然溶剂×10 技巧概要·卷2×10 五水研磨石×3 龙门币×20000 高级作战记录×10 环烃聚质×10 技巧概要·卷3×3 炽合金块×3 龙门币×20000 高级作战记录×10 切削原液×3 技巧概要·卷1×30 D32钢×1 龙门币×30000 糖聚块×3 高级作战记录×15 酮阵列×3 锡人×1 龙门币×30000 晶体电子单元×1 高级作战记录×15 RMA70-24×3 锡人的信物×1 龙门币×30000 精炼溶剂×3 高级作战记录×15 聚酸酯块×3 锡人的信物×1 龙门币×30000 聚合剂×1 高级作战记录×15 三水锰矿×3 锡人的信物×1 龙门币×50000 转质盐聚块×3 高级作战记录×20 白马醇×3 锡人的信物×1 龙门币×50000 双极纳米片×1 高级作战记录×20 提纯源岩×3 锡人的信物×1',
        '萨卡兹的无终奇语里程碑奖励（2024年07月）',
        '2024-07-16 16:00:00+08:00',
        '#萨卡兹的无终奇语', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '龙门币×50000 高级作战记录×20 晶体电路×3 技巧概要·卷1×30 烧结核凝晶×1 龙门币×50000 高级作战记录×20 数据增补条×60 技巧概要·卷2×10 异铁块×3 龙门币×50000 高级作战记录×20 D32钢×1 技巧概要·卷3×3 高级资深干员技巧集×1',
        '萨卡兹的无终奇语里程碑奖励（2024年08月）',
        '2024-08-01 04:00:00+08:00',
        '#萨卡兹的无终奇语', '#集成战略里程碑奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 先锋芯片组×4 高级作战记录×15 龙门币×30000',
        '萨卡兹的无终奇语月度奖励（2024年07月）',
        '2024-07-16 16:00:00+08:00',
        '#萨卡兹的无终奇语', '#集成战略月度奖励',
    )
    resource_stats.add(
        '模组数据块×1 芯片助剂×1 近卫芯片组×4 高级作战记录×15 龙门币×30000',
        '萨卡兹的无终奇语月度奖励（2024年08月）',
        '2024-08-01 04:00:00+08:00',
        '#萨卡兹的无终奇语', '#集成战略月度奖励',
    )
