from models import ResourceStats

from .manager import manager


@manager.register
def add_live_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "合成玉×600 中坚寻访凭证 聚合剂 芯片助剂 龙门币×30000 烧结核凝晶 晶体电子单元 双极纳米片 高级作战记录×15 D32钢 "
        "合成玉×600 中坚寻访凭证 聚合剂 芯片助剂 龙门币×30000 烧结核凝晶 晶体电子单元 双极纳米片 高级作战记录×15 D32钢 "
        "合成玉×600 中坚寻访凭证 聚合剂 芯片助剂 龙门币×30000 烧结核凝晶 晶体电子单元 双极纳米片 高级作战记录×15 D32钢 ",
        "四周年前瞻直播",
        "2023-04-22 20:00:00+08:00",
        "#前瞻直播",
    )
    resource_stats.add(
        "烧结核凝晶×4 "
        "合成玉×600 中坚寻访凭证 聚合剂 芯片助剂 龙门币×30000 烧结核凝晶 晶体电子单元 双极纳米片 高级作战记录×15 D32钢 "
        "合成玉×600 中坚寻访凭证 聚合剂 芯片助剂 龙门币×30000 烧结核凝晶 晶体电子单元 双极纳米片 高级作战记录×15 D32钢 ",
        "2023感谢庆典前瞻直播",
        "2023-10-22 20:00:00+08:00",
        "#前瞻直播",
    )
    resource_stats.add(
        "合成玉×600 中坚寻访凭证 聚合剂 芯片助剂 龙门币×30000 烧结核凝晶 晶体电子单元 双极纳米片 高级作战记录×15 D32钢 "
        "合成玉×600 中坚寻访凭证 聚合剂 芯片助剂 龙门币×30000 烧结核凝晶 晶体电子单元 双极纳米片 高级作战记录×15 D32钢 "
        "合成玉×600 中坚寻访凭证 聚合剂 芯片助剂 龙门币×30000 烧结核凝晶 晶体电子单元 双极纳米片 高级作战记录×15 D32钢 ",
        "五周年前瞻直播",
        "2024-04-27 20:00:00+08:00",
        "#前瞻直播",
    )
