from models import ResourceStats

from .manager import manager


@manager.register
def add_mail_box_resources(resource_stats: ResourceStats):
    resource_stats.add("高级作战记录×5 应急理智加强剂×1 龙门币×16888",
                       "2023 - 新春会礼包（DAY1）",
                       "2023-01-15 04:00:00+08:00",  # 具体时间不明
                       "#2023 - 新春会礼包", "#兑换码免费领取")
    resource_stats.add("应急理智加强剂×1 技巧概要·卷3×5 龙门币×16888",
                       "2023 - 新春会礼包（DAY2）",
                       "2023-01-16 04:00:00+08:00",  # 具体时间不明
                       "#2023 - 新春会礼包", "#兑换码免费领取")
    resource_stats.add("应急理智加强剂×1 采购凭证×20 龙门币×16888",
                       "2023 - 新春会礼包（DAY3）",
                       "2023-01-17 04:00:00+08:00",  # 具体时间不明
                       "#2023 - 新春会礼包", "#兑换码免费领取")
    resource_stats.add("龙门币×20000",
                       "2023 - 辞旧迎新：春种秋收 来自风笛的信息",
                       "2023-01-17 04:00:00+08:00",  # 具体时间不明
                       "#2023 - 辞旧迎新：春种秋收", "#兑换码免费领取")
    # 2023 - 罗德岛鳞丸移动食坊 归类为 网页活动
    resource_stats.add("摘自画卷的柿子×1 寻访凭证×1 轻锰矿×5",
                       "2023 - 辞旧迎新，除夕夜特别登录奖励 来自夕的祝福",
                       "2023-01-21 20:00:00+08:00",
                       "#2023 - 辞旧迎新，除夕夜特别登录奖励", "#游戏内邮件赠送")
    resource_stats.add("香脆桃酥饼×1 寻访凭证×1 白马醇×5",
                       "2023 - 辞旧迎新，除夕夜特别登录奖励 来自老鲤的祝福",
                       "2023-01-21 21:00:00+08:00",
                       "#2023 - 辞旧迎新，除夕夜特别登录奖励", "#游戏内邮件赠送")
    resource_stats.add("香辣火炉×1 寻访凭证×1 模组数据块×1",
                       "2023 - 辞旧迎新，除夕夜特别登录奖励 来自年的祝福",
                       "2023-01-21 22:00:00+08:00",
                       "#2023 - 辞旧迎新，除夕夜特别登录奖励", "#游戏内邮件赠送")
    resource_stats.add("金糖年糕×1 寻访凭证×1 芯片助剂×2",
                       "2023 - 辞旧迎新，除夕夜特别登录奖励 来自乌有的祝福",
                       "2023-01-21 23:00:00+08:00",
                       "#2023 - 辞旧迎新，除夕夜特别登录奖励", "#游戏内邮件赠送")
    resource_stats.add("合成玉×2100 木瓜叶馅饼×1 家具零件×2100 龙门币×2100",
                       "2023 - 辞旧迎新，除夕夜特别登录奖励 来自阿米娅的祝福",
                       "2023-01-22 00:00:00+08:00",
                       "#2023 - 辞旧迎新，除夕夜特别登录奖励", "#游戏内邮件赠送")
    resource_stats.add("龙门币×20000",
                       "2023 - 四周年庆典：糖果 来自伊芙利特的信息",
                       "2023-04-22 04:00:00+08:00",  # 具体时间不明
                       "#2023 - 四周年庆典：糖果", "#兑换码免费领取")
    resource_stats.add("龙门币×20000",
                       "2023 - 夏日嘉年华：粉色棉花糖 来自桃金娘的信息",
                       "2023-07-23 04:00:00+08:00",  # 具体时间不明
                       "#2023 - 夏日嘉年华：粉色棉花糖", "#兑换码免费领取")
    # 2023 - 软绵绵工坊 归类为 网页活动
    resource_stats.add("龙门币×20000",
                       "2023 - 感谢庆典：演奏会贵宾 来自黑键的信息",
                       "2023-10-22 04:00:00+08:00",  # 具体时间不明
                       "#2023 - 感谢庆典：演奏会贵宾", "#兑换码免费领取")
    # 2023 - 心灵之音 归类为 网页活动
    resource_stats.add("龙门币×20000",
                       "2024 - 新春前瞻特辑：年宵花 来自林的信息",
                       "2024-01-27 04:00:00+08:00",  # 具体时间不明
                       "#2024 - 新春前瞻特辑：年宵花", "#兑换码免费领取")
    resource_stats.add("应急理智浓缩液×2 高级作战记录×15 技巧概要·卷3×15 龙门币×36888",
                       "2024 - 新春会礼包",
                       "2024-01-28 04:00:00+08:00",  # 具体时间不明
                       "#2024 - 新春会礼包", "#兑换码免费领取")
    resource_stats.add("纯净鲜花露×1 寻访凭证×1 全新装置×5",
                       "2024 - 辞旧迎新，除夕夜特别登录奖励 来自缪尔赛思的祝福",
                       "2024-02-09 20:00:00+08:00",
                       "#2024 - 辞旧迎新，除夕夜特别登录奖励", "#游戏内邮件赠送")
    resource_stats.add("火山熔岩蛋糕×1 寻访凭证×1 酮阵列×5",
                       "2024 - 辞旧迎新，除夕夜特别登录奖励 来自纯烬艾雅法拉的祝福",
                       "2024-02-09 21:00:00+08:00",
                       "#2024 - 辞旧迎新，除夕夜特别登录奖励", "#游戏内邮件赠送")
    resource_stats.add("午后田园茶点×1 寻访凭证×1 模组数据块×1",
                       "2024 - 辞旧迎新，除夕夜特别登录奖励 来自薇薇安娜的祝福",
                       "2024-02-09 22:00:00+08:00",
                       "#2024 - 辞旧迎新，除夕夜特别登录奖励", "#游戏内邮件赠送")
    resource_stats.add("脆壳糖油果×1 寻访凭证×1 芯片助剂×2",
                       "2024 - 辞旧迎新，除夕夜特别登录奖励 来自左乐的祝福",
                       "2024-02-09 23:00:00+08:00",
                       "#2024 - 辞旧迎新，除夕夜特别登录奖励", "#游戏内邮件赠送")
    resource_stats.add("合成玉×2100 奶油夹心饼干×1 家具零件×2100 龙门币×2100",
                       "2024 - 辞旧迎新，除夕夜特别登录奖励 来自阿米娅的祝福",
                       "2024-02-10 00:00:00+08:00",
                       "#2024 - 辞旧迎新，除夕夜特别登录奖励", "#游戏内邮件赠送")
    resource_stats.add("龙门币×20000",
                       "2024 - 五周年庆典：花冠 来自阿米娅的信息",
                       "2024-04-29 04:00:00+08:00",  # 具体时间不明
                       "#2024 - 五周年庆典：花冠", "#兑换码免费领取")

    # 好莱坞音乐传媒奖
    resource_stats.add("合成玉×1000",
                       "好莱坞音乐传媒奖",
                       "2023-11-17 00:00:00+08:00",  # 具体时间不明
                       "#邮件")
