from models import ResourceStats

from .manager import manager


@manager.register
def add_沙中之火_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "繁荣证章×-6000 龙门币×10000 技巧概要·卷1×15 初级作战记录×20 固源岩组×5 模组数据块×1 龙门币×10000 改量装置×1 中级作战记录×10 凝胶×5 寻访凭证×1 龙门币×10000 技巧概要·卷2×15 初级作战记录×20 聚酸酯组×5 情境推演沙盘×1 龙门币×10000 酮阵列×1 中级作战记录×10 轻锰矿×5 寻访凭证×1 龙门币×10000 技巧概要·卷3×10 初级作战记录×20 半自然溶剂×5 模组数据块×3 数据增补条×15 数据增补仪×5 龙门币×10000 异铁块×1 中级作战记录×10 转质盐组×5 寻访凭证×1 龙门币×10000 技巧概要·卷1×15 中级作战记录×15 糖组×5 山川的酿造×1 龙门币×15000 白马醇×1 中级作战记录×15 异铁组×5 数据增补仪×5 龙门币×15000 技巧概要·卷2×15 中级作战记录×15 炽合金×5 数据增补条×20 龙门币×15000 改量装置×1 中级作战记录×15 RMA70-12×5 烧结核凝晶×1 龙门币×15000 技巧概要·卷3×10 中级作战记录×15 酮凝集组×5 数据增补条×20 龙门币×15000 酮阵列×1 高级作战记录×10 全新装置×5 模组数据块×3 数据增补条×15 数据增补仪×5 龙门币×20000 技巧概要·卷3×10 中级作战记录×15 化合切削液×5 数据增补仪×5 龙门币×20000 异铁块×1 高级作战记录×10 扭转醇×5 数据增补条×20 龙门币×20000 技巧概要·卷3×10 高级作战记录×10 研磨石×5 模组数据块×1 龙门币×20000 白马醇×1 高级作战记录×10 晶体元件×5 晶体电子单元×1",
        "沙中之火繁荣梯度",
        "2023-01-29 16:00:00+08:00",
        "#沙中之火", "#生息演算",
    )


@manager.register
def add_沙洲遗闻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "繁荣点数×-29500 红隼×1 红隼的信物×1 红隼的信物×1 红隼的信物×1 红隼的信物×1 红隼的信物×1 聚合剂×1 晶体电子单元×1 三水锰矿×4 提纯源岩×4 扭转醇×10 全新装置×10 中级作战记录×15 高级作战记录×15 技巧概要·卷2×10 技巧概要·卷3×10 龙门币×100000",
        "沙洲遗闻繁荣馈赠STAGE1",
        "2024-02-03 11:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×-28500 “沙洲晨曦”×1 双极纳米片×1 烧结核凝晶×1 改量装置×4 晶体电路×4 转质盐组×10 酮凝集组×10 中级作战记录×15 高级作战记录×15 技巧概要·卷2×10 技巧概要·卷3×10 龙门币×100000",
        "沙洲遗闻繁荣馈赠STAGE2",
        "2024-02-03 11:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×-24500 雕镂吊灯架×1 轻纱隔断×1 “安乐窝”×1 独木首饰桌×1 宝石灯柱×1 “守望者”×1 货物篮×1 荒漠壁纸×1 隔沙地板×1 D32钢×1 晶体电子单元×1 转质盐聚块×4 糖聚块×4 聚酸酯组×10 炽合金×10 中级作战记录×15 高级作战记录×15 技巧概要·卷2×10 技巧概要·卷3×10 龙门币×100000",
        "沙洲遗闻繁荣馈赠STAGE3",
        "2024-02-03 11:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×-30000 模组数据块×12 数据增补条×60 数据增补仪×20 双极纳米片×1 聚合剂×1 先锋芯片组×8 先锋芯片×5 近卫芯片组×8 近卫芯片×5 重装芯片组×8 重装芯片×5 狙击芯片组×8 狙击芯片×5 术师芯片组×8 术师芯片×5 医疗芯片组×8 医疗芯片×5 辅助芯片组×8 辅助芯片×5 特种芯片组×8 特种芯片×5",
        "沙洲遗闻繁荣馈赠STAGE3（2024-02-07追加）",
        "2024-02-07 20:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×-24400 模组数据块×12 数据增补条×60 数据增补仪×20 双极纳米片×1 聚合剂×1 精炼溶剂×4 聚酸酯块×4 晶体元件×10 糖组×10 中级作战记录×15 高级作战记录×15 技巧概要·卷2×10 技巧概要·卷3×10 龙门币×100000",
        "沙洲遗闻繁荣馈赠STAGE4",
        "2024-03-01 04:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×-24600 轻纱吊顶×1 软木椅×1 “小本买卖”×1 耐火地毯×1 织衣架×1 “过往见证”×1 展览台×1 “施舍者”×1 吊顶灯×1 D32钢×1 烧结核凝晶×1 切削原液×4 酮阵列×4 轻锰矿×10 固源岩组×10 中级作战记录×15 高级作战记录×15 技巧概要·卷2×10 技巧概要·卷3×10 龙门币×100000",
        "沙洲遗闻繁荣馈赠STAGE5",
        "2024-04-01 04:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×-25800 险途×1 聚合剂×1 晶体电子单元×1 炽合金块×4 聚合凝胶×4 研磨石×10 褐素纤维×10 中级作战记录×15 高级作战记录×15 技巧概要·卷2×10 技巧概要·卷3×10 龙门币×100000",
        "沙洲遗闻繁荣馈赠STAGE6",
        "2024-05-01 04:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×-27000 探寻者\\sSK97×1 双极纳米片×1 烧结核凝晶×1 提纯源岩×4 RMA70-24×4 环烃聚质×10 RMA70-12×10 中级作战记录×15 高级作战记录×15 技巧概要·卷2×10 技巧概要·卷3×10 龙门币×100000",
        "沙洲遗闻繁荣馈赠STAGE7",
        "2024-06-01 04:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×-27000 “搬运任务”×1 D32钢×1 晶体电子单元×1 异铁块×4 五水研磨石×4 化合切削液×10 凝胶×10 中级作战记录×15 高级作战记录×15 技巧概要·卷2×10 技巧概要·卷3×10 龙门币×100000",
        "沙洲遗闻繁荣馈赠STAGE8",
        "2024-07-01 04:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×-25700 “枯荣”×1 双极纳米片×1 聚合剂×1 白马醇×4 环烃预制体×4 异铁组×10 半自然溶剂×10 中级作战记录×15 高级作战记录×15 技巧概要·卷2×10 技巧概要·卷3×10 龙门币×100000",
        "沙洲遗闻繁荣馈赠STAGE9",
        "2024-08-01 04:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×30000",
        "沙洲遗闻繁荣点数2024-02-07补偿",
        "2024-02-07 20:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )

    resource_stats.add(
        "繁荣点数×2500 模组数据块×1 芯片助剂×1 高级作战记录×20 技巧概要·卷3×20 龙门币×30000",
        "沙洲遗闻2024-03战争浪潮",
        "2024-03-01 04:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×2500 模组数据块×1 芯片助剂×1 高级作战记录×20 技巧概要·卷3×20 龙门币×30000",
        "沙洲遗闻2024-04战争浪潮",
        "2024-04-01 04:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×2500 模组数据块×1 芯片助剂×1 高级作战记录×20 技巧概要·卷3×20 龙门币×30000",
        "沙洲遗闻2024-05战争浪潮",
        "2024-05-01 04:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×2500 模组数据块×1 芯片助剂×1 高级作战记录×20 技巧概要·卷3×20 龙门币×30000",
        "沙洲遗闻2024-06战争浪潮",
        "2024-06-01 04:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×2500 模组数据块×1 芯片助剂×1 高级作战记录×20 技巧概要·卷3×20 龙门币×30000",
        "沙洲遗闻2024-07战争浪潮",
        "2024-07-01 04:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×2500 模组数据块×1 芯片助剂×1 高级作战记录×20 技巧概要·卷3×20 龙门币×30000",
        "沙洲遗闻2024-08战争浪潮",
        "2024-08-01 04:00:00+08:00",
        "#沙洲遗闻", "#生息演算",
    )
    resource_stats.add(
        "繁荣点数×2500 白马醇×3 轻锰矿×6 "
        "繁荣点数×2500 技巧概要·卷3×25 研磨石×6 "
        "繁荣点数×2500 晶体电子单元×1 高级作战记录×20 "
        "繁荣点数×2500 模组数据块 RMA70-24×3 "
        "繁荣点数×2500 芯片助剂 全新装置×6 "
        "繁荣点数×2500 龙门币×50000",
        "沙洲遗闻“险途”测试演算",
        "2024-04-25 16:00:00",
        "#沙洲遗闻", "#生息演算",
    )
