from models import ResourceStats


def add_reclamation_algorithm_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "繁荣证章×-6000 龙门币×10000 技巧概要·卷1×15 初级作战记录×20 固源岩组×5 模组数据块×1 龙门币×10000 改量装置×1 中级作战记录×10 凝胶×5 寻访凭证×1 龙门币×10000 技巧概要·卷2×15 初级作战记录×20 聚酸酯组×5 情境推演沙盘×1 龙门币×10000 酮阵列×1 中级作战记录×10 轻锰矿×5 寻访凭证×1 龙门币×10000 技巧概要·卷3×10 初级作战记录×20 半自然溶剂×5 模组数据整合块×1 龙门币×10000 异铁块×1 中级作战记录×10 转质盐组×5 寻访凭证×1 龙门币×10000 技巧概要·卷1×15 中级作战记录×15 糖组×5 山川的酿造×1 龙门币×15000 白马醇×1 中级作战记录×15 异铁组×5 数据增补仪×5 龙门币×15000 技巧概要·卷2×15 中级作战记录×15 炽合金×5 数据增补条×20 龙门币×15000 改量装置×1 中级作战记录×15 RMA70-12×5 烧结核凝晶×1 龙门币×15000 技巧概要·卷3×10 中级作战记录×15 酮凝集组×5 数据增补条×20 龙门币×15000 酮阵列×1 高级作战记录×10 全新装置×5 模组数据整合块×1 龙门币×20000 技巧概要·卷3×10 中级作战记录×15 化合切削液×5 数据增补仪×5 龙门币×20000 异铁块×1 高级作战记录×10 扭转醇×5 数据增补条×20 龙门币×20000 技巧概要·卷3×10 高级作战记录×10 研磨石×5 模组数据块×1 龙门币×20000 白马醇×1 高级作战记录×10 晶体元件×5 晶体电子单元×1",
        "沙中之火繁荣梯度",
        "2023-01-29 16:00:00+08:00",
        "#沙中之火", "#生息演算",
    )
