from models import ResourceStats
from time_utils import CST
from triggers import CronTrigger, DateTrigger


def add_将进酒_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "罐装晌午茶×-3110 寒芒克洛丝的信物×1 寒芒克洛丝的信物×1 寒芒克洛丝的信物×1 寒芒克洛丝的信物×1 寒芒克洛丝的信物×1 寻访凭证×3 晶体电子单元×1 异铁块×3 白马醇×3 晶体电路×3 情报凭证×200 情报凭证×130 情报凭证×90 情报凭证×180 RMA70-12×5 化合切削液×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 聚酸酯×8 异铁×8 酮凝集×8 狙击芯片×5",
        "将进酒·复刻商店",
        "2023-01-01 16:00:00+08:00",
        "#将进酒·复刻", "#SideStory商店",
    )


def add_登临意_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×13 新酿烈刀子×450",
        "登临意“城中调查”首次通关",
        "2023-01-17 16:00:00+08:00",
        "#登临意", "#SideStory首次通关",
    )
    resource_stats.add(
        "至纯源石×16 新酿烈刀子×480",
        "登临意“关外追凶”首次通关",
        "2023-01-24 16:00:00+08:00",
        "#登临意", "#SideStory首次通关",
    )
    resource_stats.add(
        "新酿烈刀子×-6730 截云的信物×1 截云的信物×1 截云的信物×1 截云的信物×1 截云的信物×1 寻访凭证×3 模组数据块×2 D32钢×5 提纯源岩×10 五水研磨石×10 改量装置×10 “藏锋”×1 “互搏”×1 “踏沙”×1 “聚力”×1 “朴拙”×1 数据增补仪×10 数据增补条×60 RMA70-12×15 异铁组×10 龙门币×500000 高级作战记录×50 中级作战记录×100 初级作战记录×240 技巧概要·卷3×25 技巧概要·卷2×50 固源岩×25 糖×25 酮凝集×25 狙击芯片×5 家具零件×2000",
        "登临意铸剑坊商店",
        "2023-01-17 16:00:00+08:00",
        "#登临意", "#SideStory商店",
    )


def add_春分_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "平安符×560 至纯源石×18 饰牌《接点》×1",
        "春分首次通关",
        "2023-02-14 16:00:00+08:00",
        "#春分", "#故事集首次通关",
    )
    resource_stats.add(
        "平安符×-2205 绘声绘影×1 事相碎片×6 模组数据块×2 数据增补仪×8 数据增补条×40 双极纳米片×1 芯片助剂×1 转质盐聚块×2 酮凝集组×4 半自然溶剂×4 龙门币×20000 高级作战记录×5 中级作战记录×10 技巧概要·卷3×5 技巧概要·卷2×10 赤金×20 装置×5 招聘许可×5 家具零件×100",
        "春分移山庙商店",
        "2023-02-14 16:00:00+08:00",
        "#春分", "#故事集商店",
    )


def add_吾导先路_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "蚀刻弹弹壳×-2931 见行者的信物×1 见行者的信物×1 见行者的信物×1 见行者的信物×1 见行者的信物×1 寻访凭证×3 晶体电子单元×1 酮阵列×3 RMA70-24×3 白马醇×3 情报凭证×55 情报凭证×120 情报凭证×120 情报凭证×110 全新装置×5 轻锰矿×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 装置×8 聚酸酯×8 异铁×8 特种芯片×5",
        "吾导先路·复刻商店",
        "2023-02-21 16:00:00+08:00",
        "#吾导先路·复刻", "#SideStory商店",
    )


def add_落叶逐火_resources(resource_stats: ResourceStats):
    # 哗啦啦祈愿牌奖励未在解包数据中
    resource_stats.add(
        "户外明火烧烤架×1 硬质合金收纳箱×1 模组数据块×1 数据增补条×10 芯片助剂×1 龙门币×30000 龙门币×30000 高级作战记录×10 初级作战记录×25 技巧概要·卷×35 赤金×20 招聘许可×5 加急许可×5 家具零件×200 应急理智浓缩液×1 应急理智浓缩液×1 合作限定十连寻访凭证×1 苍暮印象×1",
        "哗啦啦祈愿牌",
        "2023-03-07 16:00:00+08:00",
        "#哗啦啦祈愿牌", "#落叶逐火", "#签到活动",
    )
    resource_stats.add(
        "至纯源石×13 破碎的骨片×80 源石虫的硬壳×80 鬣犄兽的尖锐齿×30 凶豕兽的厚实皮×60 火龙的红玉×1",
        "落叶逐火“苍暮山地”首次通关",
        "2023-03-07 16:00:00+08:00",
        "#落叶逐火", "#SideStory首次通关",
    )
    resource_stats.add(
        "至纯源石×17 鬣犄兽的尖锐齿×40 凶豕兽的厚实皮×60 “兽之泪”×10 火龙的红玉×2",
        "落叶逐火“艾露猫的委托柜台”首次通关",
        "2023-03-14 16:00:00+08:00",
        "#落叶逐火", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×20 炼金值×60",
        "落叶逐火用餐区域",
        DateTrigger("2023-03-07 16:00:00+08:00")
        | CronTrigger(hour=4, start_time="2023-03-08 04:00:00+08:00", end_time="2023-03-21 04:00:00+08:00", timezone=CST),
        "#落叶逐火", "#签到活动",
    )
    resource_stats.add(
        "炼金值×-4900 "
        "泰拉大陆调查团的信物×5 寻访凭证×3 模组数据块×2 聚合剂×5 烧结核凝晶×5 数据增补仪×10 数据增补条×60 古典立柜 “茶汤” 松木盆景 “暖流” “清风” “登高” 竹制吊索 置物木箱 柔光顶灯 枫林全景显示屏 素净草席",
        "落叶逐火炼金术·重构",
        "2023-03-07 16:00:00+08:00",
        "#落叶逐火", "#SideStory商店",
    )
    resource_stats.add(
        "炼金值×-6200 "
        "转质盐聚块×10 RMA70-24×10 五水研磨石×10 转质盐组×30 全新装置×30 聚酸酯组×30 龙门币×500000 高级作战记录×50 中级作战记录×100 初级作战记录×120 技巧概要·卷3×30 技巧概要·卷2×50 糖×30 聚酸酯×30 异铁×30 重装芯片×5 家具零件×2000",
        "落叶逐火炼金术·转换",
        "2023-03-07 16:00:00+08:00",
        "#落叶逐火", "#SideStory商店",
    )


def add_起源行动_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "合约赏金×2040 行动协议×2",
        "起源行动常驻行动地点第一周合约任务",
        "2023-03-21 16:00:00+08:00",
        "#起源行动", "#危机合约合约任务",
    )
    resource_stats.add(
        "合约赏金×200",
        "起源行动常驻行动地点第二周合约任务",
        "2023-03-28 04:00:00+08:00",
        "#起源行动", "#危机合约合约任务",
    )
    resource_stats.add(
        "合约赏金×145 行动协议×2",
        "起源行动轮换行动地点合约任务",
        DateTrigger("2023-03-21 16:00:00+08:00")
        | CronTrigger(hour=4, start_time="2023-03-23 04:00:00+08:00", end_time="2023-04-04 04:00:00+08:00", timezone=CST),
        "#起源行动", "#危机合约合约任务",
    )
    resource_stats.add(
        "合约赏金×-500 奇工妙想×1 “危机记忆”×1 起源之旗×1",
        "起源行动常设兑换所",
        "2023-03-21 16:00:00+08:00",
        "#起源行动", "#危机合约常设兑换所",
    )
    resource_stats.add(
        "行动协议×-28 起源行动物资补给×28",
        "起源行动物资补给",
        "2023-04-04 04:00:00+08:00",
        "#起源行动", "#危机合约物资补给",
    )
    resource_stats.add(
        "合约赏金×100 罗德岛物资补给×5",
        "起源行动无名庇护所训练场",
        "2023-04-04 04:00:00+08:00",  # 具体时间不明
        "#起源行动", "#危机合约训练场",
    )
    resource_stats.add(
        "合约赏金×100 罗德岛物资补给×5",
        "起源行动迷雾战区训练场",
        "2023-04-04 04:00:00+08:00",  # 具体时间不明
        "#起源行动", "#危机合约训练场",
    )


def add_2023_愚人节活动_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "U-Official的文件夹×1 "
        "U-Official的文件夹×1 主播U的直播切片×1832 "
        "至纯源石×1 "
        "U-Official的文件夹×1 主播U的直播切片×5138 "
        "U-Official的文件夹×1 主播U的直播切片×6200 "
        "U-Official的文件夹×1 主播U的直播切片×6200 "
        "U-Official的文件夹×1 主播U的直播切片×6200",
        "愚人节活动2023",
        "2023-04-01 16:00:00+08:00",
        "#愚人节活动",
    )


# resource_stats.add(
#     "",
#     "",
#     "",
#     "",
# )
