from models import ResourceStats


def add_将进酒_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "罐装晌午茶×-3110 寒芒克洛丝的信物×1 寒芒克洛丝的信物×1 寒芒克洛丝的信物×1 寒芒克洛丝的信物×1 寒芒克洛丝的信物×1 寻访凭证×3 晶体电子单元×1 异铁块×3 白马醇×3 晶体电路×3 情报凭证×200 情报凭证×130 情报凭证×90 情报凭证×180 RMA70-12×5 化合切削液×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 聚酸酯×8 异铁×8 酮凝集×8 狙击芯片×5",
        "将进酒·复刻商店",
        "2023-01-01 16:00:00",
        "#将进酒·复刻", "#SideStory商店",
    )


def add_登临意_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×13 新酿烈刀子×450",
        "登临意“城中调查”首次通关",
        "2023-01-17 16:00:00",
        "#登临意", "#SideStory首次通关",
    )
    resource_stats.add(
        "至纯源石×16 新酿烈刀子×480",
        "登临意“关外追凶”首次通关",
        "2023-01-24 16:00:00",
        "#登临意", "#SideStory首次通关",
    )
    resource_stats.add(
        "新酿烈刀子×-6730 截云的信物×1 截云的信物×1 截云的信物×1 截云的信物×1 截云的信物×1 寻访凭证×3 模组数据块×2 D32钢×5 提纯源岩×10 五水研磨石×10 改量装置×10 “藏锋”×1 “互搏”×1 “踏沙”×1 “聚力”×1 “朴拙”×1 数据增补仪×10 数据增补条×60 RMA70-12×15 异铁组×10 龙门币×500000 高级作战记录×50 中级作战记录×100 初级作战记录×240 技巧概要·卷3×25 技巧概要·卷2×50 固源岩×25 糖×25 酮凝集×25 狙击芯片×5 家具零件×2000",
        "登临意铸剑坊商店",
        "2023-01-17 16:00:00",
        "#登临意", "#SideStory商店",
    )


def add_春分_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "平安符×560 至纯源石×18 饰牌《接点》×1",
        "春分首次通关",
        "2023-02-14 16:00:00",
        "#春分", "#故事集首次通关",
    )
    resource_stats.add(
        "平安符×-2205 绘声绘影×1 事相碎片×6 模组数据块×2 数据增补仪×8 数据增补条×40 双极纳米片×1 芯片助剂×1 转质盐聚块×2 酮凝集组×4 半自然溶剂×4 龙门币×20000 高级作战记录×5 中级作战记录×10 技巧概要·卷3×5 技巧概要·卷2×10 赤金×20 装置×5 招聘许可×5 家具零件×100",
        "春分移山庙商店",
        "2023-02-14 16:00:00",
        "#春分", "#故事集商店",
    )


def add_吾导先路_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "蚀刻弹弹壳×-2931 见行者的信物×1 见行者的信物×1 见行者的信物×1 见行者的信物×1 见行者的信物×1 寻访凭证×3 晶体电子单元×1 酮阵列×3 RMA70-24×3 白马醇×3 情报凭证×55 情报凭证×120 情报凭证×120 情报凭证×110 全新装置×5 轻锰矿×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 装置×8 聚酸酯×8 异铁×8 特种芯片×5",
        "吾导先路·复刻商店",
        "2023-02-21 16:00:00",
        "#吾导先路·复刻", "#SideStory商店",
    )
