from models import ItemInfo as II
from models import ResourceStats
from rewards.manager import manager
from time_utils import CST
from triggers import CronTrigger, DateTrigger


@manager.register
def add_将进酒_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "罐装晌午茶×-3110 寒芒克洛丝的信物×1 寒芒克洛丝的信物×1 寒芒克洛丝的信物×1 寒芒克洛丝的信物×1 寒芒克洛丝的信物×1 寻访凭证×3 晶体电子单元×1 异铁块×3 白马醇×3 晶体电路×3 情报凭证×200 情报凭证×130 情报凭证×90 情报凭证×180 RMA70-12×5 化合切削液×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 聚酸酯×8 异铁×8 酮凝集×8 狙击芯片×5",
        "将进酒·复刻商店",
        "2023-01-01 16:00:00+08:00",
        "#将进酒·复刻", "#SideStory商店",
    )


@manager.register
def add_登临意_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×13 新酿烈刀子×450",
        "登临意“城中调查”首次通关",
        "2023-01-17 16:00:00+08:00",
        "#登临意", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-240 至纯源石×16 新酿烈刀子×480",
        "登临意“关外追凶”首次通关",
        "2023-01-24 16:00:00+08:00",
        "#登临意", "#SideStory首次通关",
    )
    resource_stats.add(
        "新酿烈刀子×-6730 截云的信物×1 截云的信物×1 截云的信物×1 截云的信物×1 截云的信物×1 寻访凭证×3 模组数据块×2 D32钢×5 提纯源岩×10 五水研磨石×10 改量装置×10 “藏锋”×1 “互搏”×1 “踏沙”×1 “聚力”×1 “朴拙”×1 数据增补仪×10 数据增补条×60 RMA70-12×15 异铁组×10 龙门币×500000 高级作战记录×50 中级作战记录×100 初级作战记录×240 技巧概要·卷3×25 技巧概要·卷2×50 固源岩×25 糖×25 酮凝集×25 狙击芯片×5 家具零件×2000",
        "登临意铸剑坊商店",
        "2023-01-17 16:00:00+08:00",
        "#登临意", "#SideStory商店",
    )


@manager.register
def add_春分_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "理智×-114 平安符×560 至纯源石×18 饰牌《接点》×1",
        "春分首次通关",
        "2023-02-14 16:00:00+08:00",
        "#春分", "#故事集首次通关",
    )
    resource_stats.add(
        "平安符×-2205 绘声绘影×1 事相碎片×6 模组数据块×2 数据增补仪×8 数据增补条×40 双极纳米片×1 芯片助剂×1 转质盐聚块×2 酮凝集组×4 半自然溶剂×4 龙门币×20000 高级作战记录×5 中级作战记录×10 技巧概要·卷3×5 技巧概要·卷2×10 赤金×20 装置×5 招聘许可×5 家具零件×100",
        "春分移山庙商店",
        "2023-02-14 16:00:00+08:00",
        "#春分", "#故事集商店",
    )


@manager.register
def add_吾导先路_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "蚀刻弹弹壳×-2931 见行者的信物×1 见行者的信物×1 见行者的信物×1 见行者的信物×1 见行者的信物×1 寻访凭证×3 晶体电子单元×1 酮阵列×3 RMA70-24×3 白马醇×3 情报凭证×55 情报凭证×120 情报凭证×120 情报凭证×110 全新装置×5 轻锰矿×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 装置×8 聚酸酯×8 异铁×8 特种芯片×5",
        "吾导先路·复刻商店",
        "2023-02-21 16:00:00+08:00",
        "#吾导先路·复刻", "#SideStory商店",
    )


@manager.register
def add_落叶逐火_resources(resource_stats: ResourceStats):
    # 哗啦啦祈愿牌奖励未在解包数据中
    resource_stats.add(
        "户外明火烧烤架×1 硬质合金收纳箱×1 模组数据块×1 数据增补条×10 芯片助剂×1 龙门币×30000 龙门币×30000 高级作战记录×10 初级作战记录×25 技巧概要·卷×35 赤金×20 招聘许可×5 加急许可×5 家具零件×200 应急理智浓缩液×1 应急理智浓缩液×1 合作限定十连寻访凭证×1 苍暮印象×1",
        "哗啦啦祈愿牌",
        "2023-03-07 16:00:00+08:00",
        "#哗啦啦祈愿牌", "#落叶逐火", "#签到活动",
    )
    resource_stats.add(
        "至纯源石×13 破碎的骨片×80 源石虫的硬壳×80 鬣犄兽的尖锐齿×30 凶豕兽的厚实皮×60 火龙的红玉×1",
        "落叶逐火“苍暮山地”首次通关",
        "2023-03-07 16:00:00+08:00",
        "#落叶逐火", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-250 至纯源石×17 鬣犄兽的尖锐齿×40 凶豕兽的厚实皮×60 “兽之泪”×10 火龙的红玉×2",
        "落叶逐火“艾露猫的委托柜台”首次通关",
        "2023-03-14 16:00:00+08:00",
        "#落叶逐火", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×20 炼金值×60",
        "落叶逐火用餐区域",
        DateTrigger("2023-03-07 16:00:00+08:00")
        | CronTrigger(hour=4, start_time="2023-03-08 04:00:00+08:00", end_time="2023-03-21 04:00:00+08:00", timezone=CST),
        "#落叶逐火", "#签到活动",
    )
    resource_stats.add(
        "炼金值×-4900 "
        "泰拉大陆调查团的信物×5 寻访凭证×3 模组数据块×2 聚合剂×5 烧结核凝晶×5 数据增补仪×10 数据增补条×60 古典立柜 “茶汤” 松木盆景 “暖流” “清风” “登高” 竹制吊索 置物木箱 柔光顶灯 枫林全景显示屏 素净草席",
        "落叶逐火炼金术·重构",
        "2023-03-07 16:00:00+08:00",
        "#落叶逐火", "#SideStory商店",
    )
    resource_stats.add(
        "炼金值×-6200 "
        "转质盐聚块×10 RMA70-24×10 五水研磨石×10 转质盐组×30 全新装置×30 聚酸酯组×30 龙门币×500000 高级作战记录×50 中级作战记录×100 初级作战记录×120 技巧概要·卷3×30 技巧概要·卷2×50 糖×30 聚酸酯×30 异铁×30 重装芯片×5 家具零件×2000",
        "落叶逐火炼金术·转换",
        "2023-03-07 16:00:00+08:00",
        "#落叶逐火", "#SideStory商店",
    )


@manager.register
def add_起源行动_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "合约赏金×2040 行动协议×2",
        "起源行动常驻行动地点第一周合约任务",
        "2023-03-21 16:00:00+08:00",
        "#起源行动", "#危机合约合约任务",
    )
    resource_stats.add(
        "合约赏金×200",
        "起源行动常驻行动地点第二周合约任务",
        "2023-03-28 04:00:00+08:00",
        "#起源行动", "#危机合约合约任务",
    )
    resource_stats.add(
        "合约赏金×145 行动协议×2",
        "起源行动轮换行动地点合约任务",
        DateTrigger("2023-03-21 16:00:00+08:00")
        | CronTrigger(hour=4, start_time="2023-03-23 04:00:00+08:00", end_time="2023-04-04 04:00:00+08:00", timezone=CST),
        "#起源行动", "#危机合约合约任务",
    )
    resource_stats.add(
        "合约赏金×-500 奇工妙想×1 “危机记忆”×1 起源之旗×1",
        "起源行动常设兑换所",
        "2023-03-21 16:00:00+08:00",
        "#起源行动", "#危机合约常设兑换所",
    )
    resource_stats.add(
        "合约赏金×-3475 D32钢×2 模组数据块×1 改量装置×5 五水研磨石×5 聚合凝胶×5 扭转醇×15 炽合金×15 半自然溶剂×15 龙门币×60000 中级作战记录×60 家具零件×400",
        "起源行动特设兑换所",
        "2023-03-21 16:00:00+08:00",
        "#起源行动", "#危机合约特设兑换所",
    )
    resource_stats.add(
        "行动协议×-28 起源行动物资补给×28",
        "起源行动物资补给",
        "2023-04-04 04:00:00+08:00",
        "#起源行动", "#危机合约物资补给",
    )
    resource_stats.add(
        "合约赏金×100 罗德岛物资补给×5",
        "起源行动无名庇护所训练场",
        "2023-04-04 04:00:00+08:00",  # 具体时间不明
        "#起源行动", "#危机合约训练场",
    )
    resource_stats.add(
        "合约赏金×100 罗德岛物资补给×5",
        "起源行动迷雾战区训练场",
        "2023-04-04 04:00:00+08:00",  # 具体时间不明
        "#起源行动", "#危机合约训练场",
    )


@manager.register
def add_第十二章惊霆无声_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×21 至纯源石×2 至纯源石×17 未知材料×1",
        "第十二章惊霆无声首次通关",
        "2023-04-06 16:00:00+08:00",
        "#第十二章惊霆无声", "#主题曲首次通关",
    )
    resource_stats.add(
        "理智×-40 至纯源石×4"
        "第十二章惊霆无声绝境作战首次通关",
        "2023-04-13 16:00:00+08:00",
        "#第十二章惊霆无声", "#主题曲首次通关",
    )


@manager.register
def add_2023愚人节活动_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "U-Official的文件夹×1 "
        "U-Official的文件夹×1 主播U的直播切片×1832 "
        "至纯源石×1 "
        "U-Official的文件夹×1 主播U的直播切片×5138 "
        "U-Official的文件夹×1 主播U的直播切片×6200 "
        "U-Official的文件夹×1 主播U的直播切片×6200 "
        "U-Official的文件夹×1 主播U的直播切片×6200",
        "2023愚人节活动",
        "2023-04-01 16:00:00+08:00",
        "#愚人节活动",
    )


@manager.register
def add_愚人号_复刻_resources(resource_stats: ResourceStats):
    # 普通关卡不计理智消耗，EX和S关卡计算理智消耗
    resource_stats.add(
        "理智×-120 理智×-195 锈蚀的罗盘×1450 流明×1 情报凭证×200 情报凭证×150 龙门币×140000 高级作战记录×70 双极纳米片×1 模组数据块×1 切削原液×1 异铁块×1 晶体电路 酮阵列 改量装置 白马醇 三水锰矿 炽合金块 聚合凝胶 凝胶×4 RMA70-12×4 技巧概要·卷3×10 情报凭证×110 情报凭证×85 情报凭证×495 情报凭证×70 情报凭证×205",
        "愚人号·复刻宝箱",
        "2023-04-20 16:00:00+08:00",
        "#愚人号·复刻", "#愚人号宝箱",
    )
    resource_stats.add(
        "锈蚀的罗盘×-3654 流明的信物×1 流明的信物×1 流明的信物×1 流明的信物×1 流明的信物×1 寻访凭证×3 聚合剂×1 三水锰矿×3 异铁块×3 提纯源岩×3 情报凭证×115 情报凭证×115 情报凭证×100 情报凭证×85 情报凭证×30 情报凭证×130 情报凭证×90 研磨石×5 凝胶×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 固源岩×8 糖×8 酮凝集×8 医疗芯片×5",
        "愚人号·复刻商店",
        "2023-04-20 16:00:00+08:00",
        "#愚人号·复刻", "#SideStory商店",
    )


@manager.register
def add_孤星_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×16 飞行数据记录芯片×530 “电视” “蔓延” 龙门币×40000 中级作战记录×20 特殊作战许可·α×-2 特殊作战许可·β×-2",
        "孤星【未来将至】首次通关",
        "2023-05-01 16:00:00+08:00",
        "#孤星", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-240 至纯源石×16 飞行数据记录芯片×480",
        "孤星【过往未尽】首次通关",
        "2023-05-08 16:00:00+08:00",
        "#孤星", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-170 至纯源石×8 飞行数据记录芯片×440",
        "孤星【紧握当下】首次通关",
        "2023-05-15 16:00:00+08:00",
        "#孤星", "#SideStory首次通关",
    )
    resource_stats.add(
        "龙门币×10000 中级作战记录×10 特殊作战许可·α 酮凝集组×3 数据增补条×10 D32钢 "
        "龙门币×10000 中级作战记录×10 特殊作战许可·β 扭转醇×3 数据增补仪×5 聚合剂 "
        "龙门币×10000 中级作战记录×10 特殊作战许可·α 半自然溶剂×3 数据增补仪×5 晶体电子单元 "
        "龙门币×10000 中级作战记录×10 特殊作战许可·β 转质盐组×3 模组数据块 烧结核凝晶 ",
        "孤星专项调查",
        "2023-05-01 16:00:00+08:00",
        "#孤星", "#SideStory",
    )
    # 孤星技术调查补给数量参考https://bbs.nga.cn/read.php?pid=691713832&opt=128，取144个（但是为什么我算出来最多只能获得141个？）
    # 0 130 160 190 220 250 280 310 340 370 400 400 ... 400（21天）这些加起来除以100乘2，再加上送的8个，等于141
    resource_stats.add(
        "技术调查补给×144",
        "孤星技术调查补给",
        "2023-05-01 16:00:00+08:00",
        "#孤星", "#SideStory物资箱",
    )
    resource_stats.add(
        "飞行数据记录芯片×-8495 淬羽赫默的信物×1 淬羽赫默的信物×1 淬羽赫默的信物×1 淬羽赫默的信物×1 淬羽赫默的信物×1 寻访凭证×3 模组数据块×3 双极纳米片×5 酮阵列×10 白马醇×10 精炼溶剂×10 转质盐聚块×10 “收纳盒”×1 “闹钟”×1 “枝丫”×1 “羽兽窝”×1 “林荫之光”×1 “后山”×1 “故乡”×1 数据增补仪×10 数据增补条×60 固源岩组×15 全新装置×15 RMA70-12×15 化合切削液×15 龙门币×600000 高级作战记录×60 中级作战记录×100 初级作战记录×300 技巧概要·卷3×25 技巧概要·卷2×50 固源岩×40 糖×30 聚酸酯×30 异铁×25 酮凝集×25 装置×20 辅助芯片×5 家具零件×2000",
        "孤星商店",
        "2023-05-01 16:00:00+08:00",
        "#孤星", "#SideStory商店",
    )


@manager.register
def add_未来序曲签到活动_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "林野",
        "未来序曲签到活动全服玩家首次通关【孤星】CW-ST-1累计1,000,000次",
        "2023-05-01 16:00:00+08:00"  # 具体时间不明
        "#未来序曲签到活动", "#签到活动",
    )
    resource_stats.add(
        "真理",
        "未来序曲签到活动全服玩家通关【孤星】CW-10累计10,000,000次",
        "2023-05-01 16:00:00+08:00"  # 具体时间不明
        "#未来序曲签到活动", "#签到活动",
    )
    # 累计签到第一日：应急理智浓缩液*1、龙门币*30000
    # 累计签到第二日：合成玉*200、招聘许可*5
    # 累计签到第三日：芯片助剂*1、技巧概要·卷1*30
    # 累计签到第四日：数据增补条*10、家具零件*300
    # 累计签到第五日：中级作战记录*20、时装【斗争血脉系列-“衣缕往昔”-梓兰】*1
    # 累计签到第六日：合成玉*200、赤金*20
    # 累计签到第七日：数据增补仪*3、技巧概要·卷2*20
    # 累计签到第八日：技巧概要·卷3*8、龙门币*30000
    # 累计签到第九日：模组数据块*1 、加急许可*5
    # 累计签到第十日：合成玉*200、中级作战记录*20
    resource_stats.add("应急理智浓缩液×1 龙门币×30000",
                       "未来序曲签到活动累计签到第一日", "2023-05-01 16:00:00+08:00", "#未来序曲签到活动", "#签到活动")
    resource_stats.add("合成玉×200 招聘许可×5",
                       "未来序曲签到活动累计签到第二日", "2023-05-02 04:00:00+08:00", "#未来序曲签到活动", "#签到活动")
    resource_stats.add("芯片助剂×1 技巧概要·卷1×30",
                       "未来序曲签到活动累计签到第三日", "2023-05-03 04:00:00+08:00", "#未来序曲签到活动", "#签到活动")
    resource_stats.add("数据增补条×10 家具零件×300",
                       "未来序曲签到活动累计签到第四日", "2023-05-04 04:00:00+08:00", "#未来序曲签到活动", "#签到活动")
    resource_stats.add("中级作战记录×20 衣缕往昔×1",
                       "未来序曲签到活动累计签到第五日", "2023-05-05 04:00:00+08:00", "#未来序曲签到活动", "#签到活动")
    resource_stats.add("合成玉×200 赤金×20",
                       "未来序曲签到活动累计签到第六日", "2023-05-06 04:00:00+08:00", "#未来序曲签到活动", "#签到活动")
    resource_stats.add("数据增补仪×3 技巧概要·卷2×20",
                       "未来序曲签到活动累计签到第七日", "2023-05-07 04:00:00+08:00", "#未来序曲签到活动", "#签到活动")
    resource_stats.add("技巧概要·卷3×8 龙门币×30000",
                       "未来序曲签到活动累计签到第八日", "2023-05-08 04:00:00+08:00", "#未来序曲签到活动", "#签到活动")
    resource_stats.add("模组数据块×1 加急许可×5",
                       "未来序曲签到活动累计签到第九日", "2023-05-09 04:00:00+08:00", "#未来序曲签到活动", "#签到活动")
    resource_stats.add("合成玉×200 中级作战记录×20",
                       "未来序曲签到活动累计签到第十日", "2023-05-10 04:00:00+08:00", "#未来序曲签到活动", "#签到活动")


@manager.register
def add_四周年庆典_resources(resource_stats: ResourceStats):
    resource_stats.add(
        [II("合成玉", 9000 / 14)],
        "潘尼谷矿区",
        DateTrigger("2023-05-01 16:00:00+08:00")
        | CronTrigger(hour=4, start_time="2023-05-02 04:00:00+08:00", end_time="2023-05-15 04:00:00+08:00", timezone=CST),
        "#矿区",
    )
    resource_stats.add(
        "暴行的信物",
        "暴行赠送",
        "2023-05-01 16:00:00+08:00",
        "#暴行赠送",
    )
    resource_stats.add(
        "资深干员调用凭证-【奔崖怒号】",
        "四周年庆典资深干员特别调用活动",
        "2023-05-01 16:00:00+08:00",
        "#?",
    )
    resource_stats.add(
        "ID信息更新卡",
        "四周年庆典ID信息更新礼包",
        "2023-05-01 16:00:00+08:00",
        "#?",
    )
    resource_stats.add(
        "庆典",
        "四周年庆典首页场景更新",
        "2023-05-01 16:00:00+08:00",
        "#?",
    )


@manager.register
def add_尖灭测试作战_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "正义骑士号 Friston-3 模组数据块×3 数据增补条×15 数据增补仪×5",
        "尖灭测试作战晶块陈列室",
        "2023-05-22 16:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶化源石×3000 晶化源石×2000 晶化源石×3000 晶化源石×5000",
        "尖灭测试作战作战任务",
        "2023-05-22 16:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        "龙门币×20000 中级作战记录×20 技巧概要·卷3×10 改量装置 晶体电路 转质盐聚块 全新装置×3 晶体元件×3 转质盐组×3",
        "尖灭测试作战零碎晶块",
        "2023-05-22 16:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶化源石×400 晶化源石×800 晶化源石×800",
        "尖灭测试作战翻修中沙滩地块作战任务",
        "2023-05-25 04:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        "聚合剂 晶化源石×3000",
        "尖灭测试作战翻修中沙滩节点激活奖励",
        "2023-05-25 04:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶化源石×400 晶化源石×800 晶化源石×800",
        "尖灭测试作战淤浊沼泽地块作战任务",
        "2023-05-28 04:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        "烧结核凝晶 晶化源石×3000",
        "尖灭测试作战淤浊沼泽节点激活奖励",
        "2023-05-28 04:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶化源石×400 晶化源石×800 晶化源石×800",
        "尖灭测试作战13区废墟地块作战任务",
        "2023-05-31 04:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体电子单元 晶化源石×3000",
        "尖灭测试作战13区废墟节点激活奖励",
        "2023-05-31 04:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶化源石×10550",
        "尖灭测试作战主要测试场地指标首通奖励",
        "2023-05-22 16:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶化源石×190",
        "尖灭测试作战翻修中沙滩指标首通奖励",
        "2023-05-25 16:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶化源石×230",
        "尖灭测试作战淤浊沼泽指标首通奖励",
        "2023-05-28 16:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶化源石×230",
        "尖灭测试作战13区废墟指标首通奖励",
        "2023-05-31 16:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )
    resource_stats.add(
        # 有限池
        "晶化源石×-33575 D32钢×2 模组数据块×1 改量装置×3 RMA70-24×3 五水研磨石×3 切削原液×3 聚合凝胶×3 全新装置×10 半自然溶剂×10 轻锰矿×10 炽合金×10 扭转醇×10 龙门币×60000 中级作战记录×60 家具零件×400 固源岩×5 糖×5 聚酸酯×5 异铁×5 酮凝集×5 装置×5 "
        # 无限池
        "晶化源石×-5625 龙门币×78750",
        "尖灭测试作战商店",
        "2023-05-22 16:00:00+08:00",
        "#尖灭测试作战", "#尖灭测试",
    )


@manager.register
def add_空想花庭_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×13 圣像碎片×400",
        "空想花庭“安布罗修修道院”首次通关",
        "2023-06-08 16:00:00+08:00",
        "#空想花庭", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-240 至纯源石×16 圣像碎片×480",
        "空想花庭“废弃圣堂”首次通关",
        "2023-06-15 16:00:00+08:00",
        "#空想花庭", "#SideStory首次通关",
    )
    resource_stats.add(
        "圣像碎片×-6245 隐现的信物×1 隐现的信物×1 隐现的信物×1 隐现的信物×1 隐现的信物×1 寻访凭证×3 模组数据块×2 晶体电子单元×5 提纯源岩×10 三水锰矿×10 RMA70-24×10 “栽培希望”×1 “记叙苦厄”×1 “谛听救赎”×1 “消弭残缺”×1 “见证友谊”×1 数据增补仪×10 数据增补条×60 糖组×15 扭转醇×10 龙门币×500000 高级作战记录×50 中级作战记录×100 初级作战记录×240 技巧概要·卷3×25 技巧概要·卷2×50 固源岩×25 异铁×25 酮凝集×25 狙击芯片×5 家具零件×2000",
        "空想花庭商店",
        "2023-06-08 16:00:00+08:00",
        "#空想花庭", "#SideStory商店",
    )


@manager.register
def add_尘影余音_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "乐谱草稿×-3085 车尔尼的信物×1 车尔尼的信物×1 车尔尼的信物×1 车尔尼的信物×1 车尔尼的信物×1 寻访凭证×3 聚合剂×1 酮阵列×3 炽合金块×3 精炼溶剂×3 情报凭证×145 情报凭证×145 情报凭证×105 情报凭证×300 情报凭证×200 异铁组×5 炽合金×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 装置×8 聚酸酯×8 糖×8 重装芯片×5",
        "尘影余音·复刻商店",
        "2023-06-20 16:00:00+08:00",
    )


@manager.register
def add_2023端阳正午签到活动_resources(resource_stats: ResourceStats):
    # 累计签到第一日：应急理智浓缩液*1、龙门币*30000
    # 累计签到第二日：合成玉*200、加急许可*5
    # 由于一个Bug，该日奖励中的“加急许可”曾被误配置为“招聘许可”，随后被紧急修复。
    # 官方于活动结束后第二日为所有领取了该日奖励的玩家补发奖励，最终可获得的奖励为：在上述原有奖励的基础上追加招聘许可*5。
    # 累计签到第三日：芯片助剂*1、技巧概要·卷1*30
    # 累计签到第四日：数据增补条*10、招聘许可*5
    # 累计签到第五日：应急理智浓缩液*1、中级作战记录*20
    # 累计签到第六日：家具零件*300、赤金*20
    # 累计签到第七日：模组数据块*1 、技巧概要·卷2*20
    resource_stats.add("端午粽子椅×1",
                       "2023端阳正午签到活动端午粽子椅", "2023-06-26 04:00:00+08:00", "#2023端阳正午签到活动", "#签到活动")
    resource_stats.add("应急理智浓缩液×1 龙门币×30000",
                       "2023端阳正午签到活动累计签到第一日", "2023-06-21 04:00:00+08:00", "#2023端阳正午签到活动", "#签到活动")
    resource_stats.add("合成玉×200 加急许可×5",
                       "2023端阳正午签到活动累计签到第二日", "2023-06-22 04:00:00+08:00", "#2023端阳正午签到活动", "#签到活动")
    resource_stats.add("芯片助剂×1 技巧概要·卷1×30",
                       "2023端阳正午签到活动累计签到第三日", "2023-06-23 04:00:00+08:00", "#2023端阳正午签到活动", "#签到活动")
    resource_stats.add("数据增补条×10 招聘许可×5",
                       "2023端阳正午签到活动累计签到第四日", "2023-06-24 04:00:00+08:00", "#2023端阳正午签到活动", "#签到活动")
    resource_stats.add("应急理智浓缩液×1 中级作战记录×20",
                       "2023端阳正午签到活动累计签到第五日", "2023-06-25 04:00:00+08:00", "#2023端阳正午签到活动", "#签到活动")
    resource_stats.add("家具零件×300 赤金×20",
                       "2023端阳正午签到活动累计签到第六日", "2023-06-26 04:00:00+08:00", "#2023端阳正午签到活动", "#签到活动")
    resource_stats.add("模组数据块×1 技巧概要·卷2×20",
                       "2023端阳正午签到活动累计签到第七日", "2023-06-27 04:00:00+08:00", "#2023端阳正午签到活动", "#签到活动")
    resource_stats.add("招聘许可×5",
                       "2023端阳正午签到活动累计签到第二日补偿", "2023-06-28 04:00:00+08:00", "#2023端阳正午签到活动", "#签到活动")


@manager.register
def add_宿于繁星合作活动_resources(resource_stats: ResourceStats):
    resource_stats.add("航天模型板件 家具零件×500 中级作战记录×20",  # 具体时间不明
                       "宿于繁星合作活动全平台PV播放量达到50万次", "2023-06-29 16:00:00+08:00", "#宿于繁星合作活动", "#签到活动")
    resource_stats.add("“天外引航” 龙门币×50000 高级作战记录×30",  # 具体时间不明
                       "宿于繁星合作活动全平台PV播放量达到200万次", "2023-06-29 16:00:00+08:00", "#宿于繁星合作活动", "#签到活动")


@manager.register
def add_眠于树影之中_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "理智×-114 至纯源石×18 指木雕刻×560 饰牌《万有》×1",
        "眠于树影之中首次通关",
        "2023-07-06 16:00:00+08:00",
        "#眠于树影之中", "#故事集首次通关",
    )
    resource_stats.add(
        "指木雕刻×-2235 悠然假日\\sHD29×1 事相碎片×7 模组数据块×2 数据增补仪×8 数据增补条×40 D32钢×1 芯片助剂×1 五水研磨石×2 轻锰矿×4 RMA70-12×4 龙门币×20000 高级作战记录×5 中级作战记录×10 技巧概要·卷3×5 技巧概要·卷2×10 赤金×20 装置×5 招聘许可×5 家具零件×100",
        "眠于树影之中商店",
        "2023-07-06 16:00:00+08:00",
        "#眠于树影之中", "#故事集商店",
    )


@manager.register
def add_绿野幻梦_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "神秘试剂×-3067 星源的信物×1 星源的信物×1 星源的信物×1 星源的信物×1 星源的信物×1 寻访凭证×3 烧结核凝晶×1 异铁块×3 切削原液×3 聚合凝胶×3 情报凭证×220 情报凭证×180 情报凭证×170 情报凭证×95 酮凝集组×5 晶体元件×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 固源岩×8 异铁×8 装置×8 术师芯片×5",
        "绿野幻梦·复刻危险物品回收处商店",
        "2023-07-18 16:00:00+08:00",
        "#绿野幻梦·复刻", "#SideStory商店",
    )


@manager.register
def add_火山旅梦_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×13 毛茸茸生物的毛×640",
        "火山旅梦【温泉假日】首次通关",
        "2023-08-01 16:00:00+08:00",
        "#火山旅梦", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智-240 至纯源石×16 毛茸茸生物的毛×480",
        "火山旅梦【城市寻宝】首次通关",
        "2023-08-08 16:00:00+08:00",
        "#火山旅梦", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-172 至纯源石×11 毛茸茸生物的毛×560",
        "火山旅梦【岩浆冲浪】首次通关",
        "2023-08-15 16:00:00+08:00",
        "#火山旅梦", "#SideStory首次通关",
    )
    resource_stats.add(
        "龙门币×20000 精炼溶剂×1 D32钢×1 异铁组×4 可以游的小矮凳×1 中级作战记录×20 提纯源岩×1 技巧概要·卷2×20 半自然溶剂×4 数据增补条×10 龙门币×20000 炽合金块×1 双极纳米片×1 异铁组×4 风情街户外圆桌×1 中级作战记录×20 异铁块×1 技巧概要·卷3×10 炽合金×4 数据增补条×10 龙门币×20000 提纯源岩×1 晶体电子单元×1 固源岩组×4 可以转的大靠椅×1 中级作战记录×20 炽合金块×1 技巧概要·卷2×20 炽合金×4 模组数据块×1 龙门币×20000 异铁组×4 技巧概要·卷3×10 半自然溶剂×4 缤纷冲浪板架×1 中级作战记录×20 精炼溶剂×1 固源岩组×4 半自然溶剂×4 数据增补条×10 龙门币×20000 异铁块×1 中级作战记录×20 炽合金×4 聚合剂×1",
        "火山旅梦汐斯塔风情街营业里程碑奖励",
        "2023-08-01 16:00:00+08:00",
        "#火山旅梦", "#SideStory",
    )
    resource_stats.add(
        "峯联贸易物流补给×2",
        "火山旅梦汐斯塔风情街营业日常奖励",
        DateTrigger("2023-08-01 16:00:00+08:00")
        | CronTrigger(hour=4, start_time="2023-08-02 04:00:00+08:00", end_time="2023-08-22 04:00:00+08:00", timezone=CST),
        "#火山旅梦", "#SideStory",
    )
    resource_stats.add(
        "毛绒绒生物的毛×-7800 苍苔的信物×1 苍苔的信物×1 苍苔的信物×1 苍苔的信物×1 苍苔的信物×1 寻访凭证×3 模组数据块×3 双极纳米片×5 提纯源岩×10 转质盐聚块×10 三水锰矿×10 晶体电路×10 乐淘淘拼接桌×1 矮墩墩冰箱×1 黄蒙蒙纱帘×1 暖融融店灯×1 晕乎乎转椅×2 数据增补仪×10 数据增补条×60 聚酸酯组×15 凝胶×15 化合切削液×15 转质盐组×15 龙门币×600000 高级作战记录×60 中级作战记录×100 初级作战记录×300 技巧概要·卷3×25 技巧概要·卷2×50 固源岩×40 糖×30 聚酸酯×30 异铁×25 酮凝集×25 装置×20 近卫芯片×5 家具零件×2000",
        "火山旅梦商店",
        "2023-08-01 16:00:00+08:00",
        "#火山旅梦", "#SideStory商店",
    )


@manager.register
def add_理想城_长夏狂欢季_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "《奇谈怪论》复印本×1000",
        "理想城：长夏狂欢季·复刻开始时邮件赠送",
        "2023-08-31 16:00:00+08:00",
        "#理想城：长夏狂欢季·复刻", "#邮件",
    )
    resource_stats.add(
        "龙门币×6000",
        "理想城：长夏狂欢季·复刻自走车友会",
        DateTrigger("2023-08-31 16:00:00+08:00")
        | CronTrigger(hour=4, start_time="2023-09-01 04:00:00+08:00", end_time="2023-09-10 04:00:00+08:00", timezone=CST),
        "#理想城：长夏狂欢季·复刻", "#SideStory",
    )
    resource_stats.add(
        "《奇谈怪论》复印本×-3262 至简的信物×1 至简的信物×1 至简的信物×1 至简的信物×1 至简的信物×1 寻访凭证×3 聚合剂×1 酮阵列×3 RMA70-24×3 精炼溶剂×3 情报凭证×155 情报凭证×130 情报凭证×125 情报凭证×125 情报凭证×50 情报凭证×120 研磨石×5 固源岩组×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 糖×8 聚酸酯×8 酮凝集×8 术师芯片×5",
        "理想城：长夏狂欢季·复刻跳跳钳兽大市集商店",
        "2023-08-31 16:00:00+08:00",
        "#理想城：长夏狂欢季·复刻", "#SideStory商店",
    )


@manager.register
def add_不义之财_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×12 劣质燃料×480",
        "不义之财“苍白平台”首次通关",
        "2023-09-05 16:00:00+08:00",
        "#不义之财", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-240 至纯源石×16 劣质燃料×480",
        "不义之财“黑色舰船”首次通关",
        "2023-09-12 16:00:00+08:00",
        "#不义之财", "#SideStory首次通关",
    )
    resource_stats.add(
        "劣质燃料×-6320 冰酿的信物×1 冰酿的信物×1 冰酿的信物×1 冰酿的信物×1 冰酿的信物×1 寻访凭证×3 模组数据块×2 双极纳米片×5 提纯源岩×10 异铁块×10 五水研磨石×10 加固工作凳×1 防爆荧光灯×1 抗震支柱×1 “提前补丁”×1 装配工作台×1 数据增补仪×10 数据增补条×60 扭转醇×15 半自然溶剂×10 龙门币×500000 高级作战记录×50 中级作战记录×100 初级作战记录×240 技巧概要·卷3×25 技巧概要·卷2×50 固源岩×25 异铁×25 装置×25 狙击芯片×5 家具零件×2000",
        "不义之财巨塔下的棚屋商店",
        "2023-09-05 16:00:00+08:00",
        "#不义之财", "#SideStory商店",
    )


@manager.register
def add_登览锦绣合作活动_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "流石滩立体书堆 家具零件×500 中级作战记录×20",
        "登览锦绣合作活动全平台PV播放量达到50万次",
        "2023-09-05 16:00:00+08:00",  # 具体时间不明
        "#登览锦绣合作活动", "#签到活动",
    )
    resource_stats.add(
        "胡杨覆沙窗台 龙门币×50000 高级作战记录×30",
        "登览锦绣合作活动全平台PV播放量达到200万次",
        "2023-09-05 16:00:00+08:00",  # 具体时间不明
        "#登览锦绣合作活动", "#签到活动",
    )


@manager.register
def add_第十三章预热_战备支援_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "龙门币×6000 初级作战记录×15 固源岩×5 固源岩组×2 技巧概要·卷2×5 龙门币×6000 初级作战记录×15 龙门币×8000 五水研磨石×2 聚合凝胶×2 三水锰矿×2 迷城×1 酮阵列×2 白马醇×2 晶体电路×2 烧结核凝晶×1 提纯源岩×2 龙门币×10000 半自然溶剂×2 精炼溶剂×2 化合切削液×2 切削原液×2 龙门币×10000 转质盐组×2 转质盐聚块×2 中级作战记录×10 转质盐组×2 转质盐聚块×2 技巧概要·卷2×10 凝胶×2 烧结核凝晶×1 RMA70-12×3 糖组×3 晶体电子单元×1 全新装置×3 聚酸酯组×3 模组数据块×1 酮凝集组×3 炽合金×3 模组数据块×1",
        "第十三章预热支援里程碑",
        "2023-10-08 16:00:00+08:00",
        "#?"
    )


@manager.register
def add_第十三章恶兆湍流_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×22 至纯源石×19 至纯源石×2 未知材料×1",
        "第十三章恶兆湍流首次通关",
        "2023-10-08 16:00:00+08:00",
        "#第十三章恶兆湍流", "#主题曲首次通关",
    )
    resource_stats.add(
        "理智×-40 至纯源石×4",
        "第十三章恶兆湍流绝境作战首次通关",
        "2023-10-15 16:00:00+08:00",
        "#第十三章恶兆湍流", "#主题曲首次通关",
    )


@manager.register
def add_纷争演绎_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "龙门币×10000 全新装置×2 中级作战记录×15 龙门币×10000 炽合金×2 D32钢×1 龙门币×10000 RMA70-24×1 技巧概要·卷2×15 龙门币×10000 全新装置×2 中级作战记录×15 龙门币×10000 炽合金×2 模组数据块×1 龙门币×10000 晶体电路×1 技巧概要·卷2×15 龙门币×10000 全新装置×2 D32钢×1 龙门币×10000 炽合金×2 中级作战记录×15 龙门币×10000 全新装置×2 RMA70-24×1 龙门币×10000 全新装置×2 技巧概要·卷2×15 龙门币×10000 中级作战记录×15 炽合金×2 龙门币×10000 晴日×1 技巧概要·卷2×15 龙门币×10000 晶体电路×1 全新装置×2 D32钢×1 龙门币×10000 中级作战记录×15 炽合金×2 龙门币×10000 技巧概要·卷2×15 RMA70-24×1 龙门币×10000 全新装置×2 中级作战记录×15 龙门币×10000 D32钢×1 技巧概要·卷2×15 龙门币×10000 炽合金×2 晶体电路×1 龙门币×5000 龙门币×5000 龙门币×5000 龙门币×5000 龙门币×5000 龙门币×5000 龙门币×5000 龙门币×5000 龙门币×5000 龙门币×5000",
        "纷争演绎思维下潜里程碑",
        "2023-09-27 16:00:00+08:00",
        "#纷争演绎"
    )


@manager.register
def add_清光邀月签到活动_resources(resource_stats: ResourceStats):
    # 其他天数的奖励在check_in.py中
    resource_stats.add(
        "中秋限定家具×1 月饼×1",
        "清光邀月签到活动第三日",
        "2023-09-30 04:00:00+08:00",
        "#清光邀月签到活动", "#签到活动"
    )


@manager.register
def add_夜间主题赠送_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "夜间",
        "夜间主题赠送",
        "2023-10-01 04:00:00+08:00",
        "#?"
    )


@manager.register
def add_叙拉古人_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "进货通行证×-2114 寻访凭证×3 双极纳米片×1 晶体电子单元×1 精炼溶剂×3 炽合金块×3 酮阵列×3 三水锰矿×3 聚合凝胶×3 提纯源岩×3 情报凭证×75 情报凭证×145 情报凭证×165 情报凭证×190 糖组×5 RMA70-12×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 固源岩×8 异铁×8 酮凝集×8 先锋芯片×5",
        "叙拉古人·复刻商店",
        "2023-10-22 16:00:00+08:00",
        "#叙拉古人·复刻", "#SideStory商店",
    )


@manager.register
def add_崔林特尔梅之金_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "理智×-10 至纯源石×15 调律追忆×640 乐之节符×12 怒之节符×12 哀之节符×12 惧之节符×12",
        "崔林特尔梅之金【朝见双塔】首次通关",
        "2023-11-01 16:00:00+08:00",
        "#崔林特尔梅之金", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-240 至纯源石×16 调律追忆×480",
        "崔林特尔梅之金【恩典永恒】首次通关",
        "2023-11-08 16:00:00+08:00",
        "#崔林特尔梅之金", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-172 至纯源石×10 调律追忆×460",
        "崔林特尔梅之金【权威无情】首次通关",
        "2023-11-15 16:00:00+08:00",
        "#崔林特尔梅之金", "#SideStory首次通关",
    )
    resource_stats.add(
        "查访补给×3",
        "崔林特尔梅之金例行查访",
        DateTrigger("2023-11-01 16:00:00+08:00")
        | CronTrigger(hour=4, start_time="2023-11-02 04:00:00+08:00", end_time="2023-11-22 04:00:00+08:00", timezone=CST),
        "#崔林特尔梅之金", "#SideStory物资箱",
    )
    resource_stats.add(
        "止颂的文件夹",
        "崔林特尔梅之金密令查访",
        DateTrigger("2023-11-01 16:00:00+08:00")
        | CronTrigger(hour=4, start_time="2023-11-02 04:00:00+08:00", end_time="2023-11-07 04:00:00+08:00", timezone=CST),
    )
    resource_stats.add(
        "调律追忆×-7465 寻访凭证×3 模组数据块×3 聚合剂×5 烧结核凝晶×5 提纯源岩×10 异铁块×10 五水研磨石×10 聚合凝胶×10 切削原液×10 转质盐聚块×10 管风琴书卷台×1 图书馆阶梯×1 “知识之景”×1 求知厅堂地板×1 数据增补仪×10 数据增补条×60 聚酸酯组×15 轻锰矿×15 凝胶×15 晶体元件×15 龙门币×600000 高级作战记录×60 中级作战记录×100 初级作战记录×300 技巧概要·卷3×25 技巧概要·卷2×50 固源岩×40 糖×30 聚酸酯×30 异铁×25 酮凝集×25 装置×20 近卫芯片×5 家具零件×2000",
        "崔林特尔梅之金商店",
        "2023-11-01 16:00:00+08:00",
        "#崔林特尔梅之金", "#SideStory商店",
    )


@manager.register
def add_2023感谢庆典_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "采购凭证×-4500 跃跃×5 折光×5",
        "采购凭证兑换跃跃和折光",
        "2023-11-01 16:00:00+08:00",
        "#采购凭证区",
    )
    resource_stats.add(
        "ID信息更新卡",
        "2023感谢庆典ID信息更新礼包",
        "2023-11-01 16:00:00+08:00",
        "#?",
    )
    resource_stats.add(
        "庆典",
        "2023感谢庆典首页场景“庆典”限时赠送",
        "2023-11-01 16:00:00+08:00",
        "#?",
    )


@manager.register
def add_铁腕城产业合作洽谈会_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "合成玉×462.5",
        "铁腕城产业合作洽谈会（生物医药/仓储物流）",
        DateTrigger("2023-11-01 16:00:00+08:00")
        | CronTrigger(hour=4, start_time="2023-11-02 04:00:00+08:00", end_time="2023-11-04 04:00:00+08:00", timezone=CST)
        | CronTrigger(hour=4, start_time="2023-11-09 04:00:00+08:00", end_time="2023-11-11 04:00:00+08:00", timezone=CST),
        "#铁腕城产业合作洽谈会", "#产业合作洽谈会",
    )
    resource_stats.add(
        "合成玉×482.1",
        "铁腕城产业合作洽谈会（军事工业）",
        CronTrigger(hour=4, start_time="2023-11-04 04:00:00+08:00", end_time="2023-11-07 04:00:00+08:00", timezone=CST),
        "#铁腕城产业合作洽谈会", "#产业合作洽谈会",
    )
    resource_stats.add(
        "合成玉×471.1",
        "铁腕城产业合作洽谈会（安全顾问）",
        CronTrigger(hour=4, start_time="2023-11-07 04:00:00+08:00", end_time="2023-11-09 04:00:00+08:00", timezone=CST),
        "#铁腕城产业合作洽谈会", "#产业合作洽谈会",
    )
    resource_stats.add(
        "合成玉×469.1",
        "铁腕城产业合作洽谈会（矿产开发）",
        CronTrigger(hour=4, start_time="2023-11-11 04:00:00+08:00", end_time="2023-11-13 04:00:00+08:00", timezone=CST),
        "#铁腕城产业合作洽谈会", "#产业合作洽谈会",
    )
    resource_stats.add(
        "合成玉×475.1",
        "铁腕城产业合作洽谈会（餐饮服务）",
        CronTrigger(hour=4, start_time="2023-11-13 04:00:00+08:00", end_time="2023-11-15 04:00:00+08:00", timezone=CST),
        "#铁腕城产业合作洽谈会", "#产业合作洽谈会",
    )


@manager.register
def add_浊燃作战_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "单刀 浊燃之旗 模组数据块×3 数据增补条×15 数据增补仪×5",
        "浊燃作战晶块陈列室",
        "2023-11-21 16:00:00+08:00",
        "#浊燃作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×300 晶体合约赏金×300 晶体合约赏金×500",
        "浊燃作战阵眼任务",
        "2023-11-21 16:00:00+08:00",
        "#浊燃作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×150 晶体合约赏金×150 晶体合约赏金×150 晶体合约赏金×150 晶体合约赏金×200 晶体合约赏金×200 晶体合约赏金×150 晶体合约赏金×150 ",
        "浊燃作战指标集任务",
        "2023-11-21 16:00:00+08:00",
        "#浊燃作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×100 龙门币×5000 晶体合约赏金×100 初级作战记录×10 晶体合约赏金×100 技巧概要·卷2×5",
        "浊燃作战设防关隘阵眼任务",
        "2023-11-21 16:00:00+08:00",
        "#浊燃作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×100 龙门币×5000 晶体合约赏金×100 初级作战记录×10 晶体合约赏金×100 技巧概要·卷2×5",
        "浊燃作战联邦监狱阵眼任务",
        "2023-11-25 04:00:00+08:00",
        "#浊燃作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×100 龙门币×5000 晶体合约赏金×100 初级作战记录×10 晶体合约赏金×100 技巧概要·卷2×5",
        "浊燃作战翻修中沙滩阵眼任务",
        "2023-11-28 04:00:00+08:00",
        "#浊燃作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×100 龙门币×5000 晶体合约赏金×100 初级作战记录×10 晶体合约赏金×100 技巧概要·卷2×5",
        "浊燃作战13区废墟阵眼任务",
        "2023-12-01 04:00:00+08:00",
        "#浊燃作战", "#尖灭测试",
    )
    resource_stats.add(
        # 有限池
        "晶体合约赏金×-3345 双极纳米片×2 模组数据块×1 改量装置×3 白马醇×3 RMA70-24×3 晶体电路×3 精炼溶剂×3 固源岩组×10 异铁组×10 酮凝集组×10 研磨石×10 化合切削液×10 龙门币×60000 中级作战记录×60 家具零件×400 固源岩×5 糖×5 聚酸酯×5 异铁×5 酮凝集×5 装置×5 ",
        # 无限池
        # "晶体合约赏金×-255 龙门币×17850"
        "浊燃作战商店",
        "2023-11-21 16:00:00+08:00",
        "#浊燃作战", "#尖灭测试",
    )


@manager.register
def add_银心湖列车_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×12 驼兽盲盒×480",
        "银心湖列车“三号站台”首次通关",
        "2023-12-05 16:00:00+08:00",
        "#银心湖列车", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-240 至纯源石×16 驼兽盲盒×480",
        "银心湖列车“特快列车”首次通关",
        "2023-12-12 16:00:00+08:00",
        "#银心湖列车", "#SideStory首次通关",
    )
    resource_stats.add(
        "驮兽盲盒×-6530 哈洛德的信物×1 哈洛德的信物×1 哈洛德的信物×1 哈洛德的信物×1 哈洛德的信物×1 寻访凭证×3 模组数据块×2 D32钢×5 酮阵列×10 三水锰矿×10 RMA70-24×10 “雪山之窗”×1 寄件柜台×1 小邮筒×1 “耶拉冈德之骨”×1 小邮局地板×1 数据增补仪×10 数据增补条×60 酮凝集组×15 转质盐组×10 龙门币×500000 高级作战记录×50 中级作战记录×100 初级作战记录×240 技巧概要·卷3×25 技巧概要·卷2×50 异铁×25 酮凝集×25 装置×25 医疗芯片×5 家具零件×2000",
        "银心湖列车商店",
        "2023-12-05 16:00:00+08:00",
        "#银心湖列车", "#SideStory商店",
    )


@manager.register
def add_照我以火_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "手抄歌谣集×-3147 谜图的信物×1 谜图的信物×1 谜图的信物×1 谜图的信物×1 谜图的信物×1 寻访凭证×3 双极纳米片×1 酮阵列×3 聚合凝胶×3 炽合金块×3 情报凭证×80 情报凭证×200 情报凭证×125 情报凭证×235 聚酸酯组×5 轻锰矿×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 固源岩×8 糖×8 装置×8 先锋芯片×5",
        "照我以火·复刻商店",
        "2023-12-22 16:00:00+08:00",
        "#照我以火·复刻", "#SideStory商店",
    )


@manager.register
def add_去咧嘴谷_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "理智×-114 至纯源石×18 辣瓶树水×560 饰牌《尘嚣》×1",
        "去咧嘴谷首次通关",
        "2024-01-09 16:00:00+08:00",
        "#去咧嘴谷", "#故事集首次通关",
    )
    resource_stats.add(
        "辣瓶树水×-2175 主修领域×1 事相碎片×6 模组数据块×2 数据增补仪×8 数据增补条×40 晶体电子单元×1 芯片助剂×1 聚合凝胶×2 酮凝集组×4 半自然溶剂×4 龙门币×20000 高级作战记录×5 中级作战记录×10 技巧概要·卷3×5 技巧概要·卷2×10 赤金×20 异铁×5 招聘许可×5 家具零件×100",
        "去咧嘴谷商店",
        "2024-01-09 16:00:00+08:00",
        "#去咧嘴谷", "#故事集商店",
    )


@manager.register
def add_登临意_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "新酿烈刀子×-3224 截云的信物×1 截云的信物×1 截云的信物×1 截云的信物×1 截云的信物×1 寻访凭证×3 D32钢×1 提纯源岩×3 五水研磨石×3 改量装置×3 情报凭证×230 情报凭证×145 情报凭证×120 情报凭证×95 情报凭证×50 RMA70-12×5 异铁组×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 固源岩×8 糖×8 酮凝集×8 狙击芯片×5",
        "登临意·复刻商店",
        "2024-01-18 16:00:00+08:00",
        "#登临意·复刻", "#SideStory商店",
    )


@manager.register
def add_大地与繁星交汇之际_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "极昼玩偶 漆黑玩偶",
        "大地与繁星交汇之际",
        "2024-02-27 04:00:00+08:00",
        "#大地与繁星交汇之际", "#邮件", "#网页活动",
    )


@manager.register
def add_怀黍离_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×14 天桩×450",
        "怀黍离“种植地块”首次通关",
        "2024-02-01 16:00:00+08:00",
        "#怀黍离", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-240 至纯源石×16 天桩×480",
        "怀黍离“荒城核心”首次通关",
        "2024-02-08 16:00:00+08:00",
        "#怀黍离", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-140 至纯源石×9 天桩×280",
        "怀黍离“大江北岸”首次通关",
        "2024-02-15 16:00:00+08:00",
        "#怀黍离", "#SideStory首次通关",
    )
    resource_stats.add(
        "天桩×-7630 万顷的信物×1 万顷的信物×1 万顷的信物×1 万顷的信物×1 万顷的信物×1 寻访凭证×3 模组数据块×3 聚合剂×5 提纯源岩×10 三水锰矿×10 RMA70-24×10 切削原液×10 “藏经阁”×1 “优秀作品”×1 感应式立灯×1 小型斗拱灯×1 数据增补仪×10 数据增补条×60 聚酸酯组×15 轻锰矿×15 凝胶×15 炽合金×15 龙门币×600000 高级作战记录×60 中级作战记录×100 初级作战记录×300 技巧概要·卷3×25 技巧概要·卷2×50 固源岩×40 糖×30 聚酸酯×30 异铁×25 酮凝集×25 装置×20 先锋芯片×5 家具零件×2000",
        "怀黍离商店",
        "2024-02-01 16:00:00+08:00",
        "#怀黍离", "#SideStory商店",
    )


@manager.register
def add_2024罗德岛新春签到_resources(resource_stats: ResourceStats):
    # 累计签到第一日：应急理智浓缩液*1、龙门币*30000
    # 累计签到第二日：中级作战记录*20、招聘许可*5
    # 累计签到第三日：芯片助剂*1、技巧概要·卷2*20
    # 累计签到第四日：高级作战记录*10、糖组*3
    # 累计签到第五日：龙门币*30000、加急许可*5
    # 累计签到第六日：技巧概要·卷3*8、晶体元件*3
    # 累计签到第七日：数据增补仪*3、赤金*20
    # 累计签到第八日：家具【炎国节日挂饰】*1、家具零件*300
    # 累计签到第九日：数据增补条*10、固源岩组*3
    # 累计签到第十日：模组数据块*1、技巧概要·卷1*30
    resource_stats.add("应急理智浓缩液×1 龙门币×30000",
                       "2024罗德岛新春签到第一日", "2024-02-09 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("中级作战记录×20 招聘许可×5",
                       "2024罗德岛新春签到第二日", "2024-02-10 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("芯片助剂×1 技巧概要·卷2×20",
                       "2024罗德岛新春签到第三日", "2024-02-11 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("高级作战记录×10 糖组×3",
                       "2024罗德岛新春签到第四日", "2024-02-12 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("龙门币×30000 加急许可×5",
                       "2024罗德岛新春签到第五日", "2024-02-13 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("技巧概要·卷3×8 晶体元件×3",
                       "2024罗德岛新春签到第六日", "2024-02-14 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("数据增补仪×3 赤金×20",
                       "2024罗德岛新春签到第七日", "2024-02-15 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("炎国节日挂饰×1 家具零件×300",
                       "2024罗德岛新春签到第八日", "2024-02-16 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("数据增补条×10 固源岩组×3",
                       "2024罗德岛新春签到第九日", "2024-02-17 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("模组数据块×1 技巧概要·卷1×30",
                       "2024罗德岛新春签到第十日", "2024-02-18 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("合成玉×500",
                       "2024罗德岛新春签到新春祝福·大年三十", "2024-02-09 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("合成玉×500",
                       "2024罗德岛新春签到新春祝福·大年初一", "2024-02-10 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("合成玉×500",
                       "2024罗德岛新春签到新春祝福·大年初五", "2024-02-14 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")
    resource_stats.add("合成玉×500",
                       "2024罗德岛新春签到新春祝福·大年初九", "2024-02-18 04:00:00+08:00", "#2024罗德岛新春签到", "#签到活动")


@manager.register
def add_水晶箭行动_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×12 艺术馆集章卡×410",
        "水晶箭行动“展厅漫游”首次通关",
        "2024-03-07 16:00:00+08:00",
        "#水晶箭行动", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-240 至纯源石×17 艺术馆集章卡×680",
        "水晶箭行动“高空速降”再次通关",
        "2024-03-14 16:00:00+08:00",
        "#水晶箭行动", "#SideStory首次通关",
    )
    resource_stats.add(
        "艺术馆集章卡×-6620 导火索的信物×1 导火索的信物×1 导火索的信物×1 导火索的信物×1 导火索的信物×1 寻访凭证×3 模组数据块×2 双极纳米片×5 白马醇×10 RMA70-24×10 固化纤维板×10 艺术馆照明系统×1 “颁奖典礼”×1 隐藏展品“禁止触摸”×1 “光和热”×1 艺术馆地毯×1 “脱轨”×1 “请自由使用”×1 艺术馆吊灯×1 艺术馆盆栽×1 数据增补仪×10 数据增补条×60 固源岩组×15 晶体元件×10 龙门币×500000 高级作战记录×50 中级作战记录×100 初级作战记录×240 技巧概要·卷3×25 技巧概要·卷2×50 固源岩×25 糖×25 异铁×25 近卫芯片×5 家具零件×2000",
        "水晶箭行动商店",
        "2024-03-07 16:00:00+08:00",
        "#水晶箭行动", "#SideStory商店",
    )
    resource_stats.add("决意", "个人名片更换功能上线", "2024-03-07 16:00:00+08:00", "#?")


@manager.register
def add_源石尘行动_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "罗德岛物资配给证书×-3192 战车的信物×1 战车的信物×1 战车的信物×1 战车的信物×1 战车的信物×1 寻访凭证×3 D32钢×1 异铁块×3 五水研磨石×3 白马醇×3 情报凭证×150 情报凭证×150 情报凭证×100 情报凭证×105 情报凭证×75 情报凭证×75 情报凭证×110 情报凭证×130 RMA70-12×5 凝胶×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 装置×8 固源岩×8 异铁×8 近卫芯片×5",
        "源石尘行动·复刻商店",
        "2024-03-21 16:00:00+08:00",
        "#源石尘行动·复刻", "#SideStory商店",
    )


@manager.register
def add_潮曦作战_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "从容时刻 潮曦之旗 模组数据块×3 数据增补条×15 数据增补仪×5",
        "潮曦作战晶块陈列室",
        "2024-03-28 16:00:00+08:00",
        "#潮曦作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×300 晶体合约赏金×300 晶体合约赏金×500",
        "潮曦作战阵眼任务",
        "2024-03-28 16:00:00+08:00",
        "#潮曦作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×150 晶体合约赏金×150 晶体合约赏金×150 晶体合约赏金×150 晶体合约赏金×200 晶体合约赏金×150 晶体合约赏金×200 晶体合约赏金×150",
        "潮曦作战指标集任务",
        "2024-03-28 16:00:00+08:00",
        "#潮曦作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×100 龙门币×5000 晶体合约赏金×100 初级作战记录×10 晶体合约赏金×100 技巧概要·卷2×5",
        "潮曦作战月落环巷阵眼任务",
        "2024-03-28 16:00:00+08:00",
        "#潮曦作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×100 龙门币×5000 晶体合约赏金×100 初级作战记录×10 晶体合约赏金×100 技巧概要·卷2×5",
        "潮曦作战枯苇泥淖阵眼任务",
        "2024-04-01 04:00:00+08:00",
        "#潮曦作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×100 龙门币×5000 晶体合约赏金×100 初级作战记录×10 晶体合约赏金×100 技巧概要·卷2×5",
        "潮曦作战设防关隘阵眼任务",
        "2024-04-04 04:00:00+08:00",
        "#潮曦作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×100 龙门币×5000 晶体合约赏金×100 初级作战记录×10 晶体合约赏金×100 技巧概要·卷2×5",
        "潮曦作战实验基地封锁区阵眼任务",
        "2024-04-07 04:00:00+08:00",
        "#潮曦作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×-3000 重装皇家信物×4",
        "潮曦作战常设兑换所",
        "2024-03-28 16:00:00+08:00",
        "#潮曦作战", "#尖灭测试",
    )
    resource_stats.add(
        "晶体合约赏金×-3205 晶体电子单元×2 模组数据块×1 异铁块×3 三水锰矿×3 精炼溶剂×3 切削原液×3 转质盐聚块×3 聚酸酯组×10 酮凝集组×10 扭转醇×10 半自然溶剂×10 化合切削液×10 龙门币×60000 中级作战记录×60 家具零件×400 固源岩×5 糖×5 聚酸酯×5 异铁×5 酮凝集×5 装置×5",
        "潮曦作战特设兑换所",
        "2024-03-28 16:00:00+08:00",
        "#潮曦作战", "#尖灭测试",
    )


@manager.register
def add_2024愚人节活动_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "“给你看点好东西” 至纯源石",
        "2024愚人节活动",
        "2024-04-01 04:00:00+08:00",
        "#愚人节活动",
    )


@manager.register
def add_巴别塔_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "理智×-10 至纯源石×14 粗制糖块×540",
        "巴别塔“我赠予未来”首次通关",
        "2024-04-11 16:00:00+08:00",
        "#巴别塔", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-240 至纯源石×16 粗制糖块×480",
        "巴别塔“我驻留往昔”首次通关",
        "2024-04-18 16:00:00+08:00",
        "#巴别塔", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-140 至纯源石×9 粗制糖块×380",
        "巴别塔“我始终如一”首次通关",
        "2024-04-25 16:00:00+08:00",
        "#巴别塔", "#SideStory首次通关",
    )
    resource_stats.add(
        "粗制糖块×-8045 奥达的信物×1 奥达的信物×1 奥达的信物×1 奥达的信物×1 奥达的信物×1 寻访凭证×3 模组数据块×3 D32钢×5 酮阵列×10 RMA70-24×10 晶体电路×10 环烃预制体×10 巫术工作台×1 拼接收纳箱×1 珍奇展示柜×1 承重支柱×1 冰冷的拼接墙纸×1 从不平整的地面×1 数据增补仪×10 数据增补条×60 糖组×15 轻锰矿×15 炽合金×15 转质盐组×15 龙门币×600000 高级作战记录×60 中级作战记录×100 初级作战记录×300 技巧概要·卷3×25 技巧概要·卷2×50 固源岩×40 糖×30 聚酸酯×30 异铁×25 酮凝集×25 装置×20 近卫芯片×5 家具零件×2000",
        "巴别塔商店",
        "2024-04-11 16:00:00+08:00",
        "#巴别塔", "#SideStory商店",
    )


@manager.register
def add_五周年专享活动_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "合成玉×200 应急理智加强剂×1",
        "五周年专享活动",
        DateTrigger("2024-04-27 21:30:00+08:00")
        | CronTrigger(hour=4, start_time="2024-04-28 04:00:00+08:00", end_time="2024-05-27 04:00:00+08:00"),
        "#五周年专享活动",
    )


@manager.register
def add_第十四章慈悲灯塔_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×23 至纯源石×1 至纯源石×1 至纯源石×18 未知材料×1",
        "第十四章慈悲灯塔首次通关",
        "2024-05-01 16:00:00+08:00",
        "#第十四章慈悲灯塔", "#主题曲首次通关",
    )
    resource_stats.add(
        "理智×-40 至纯源石×4",
        "第十四章慈悲灯塔绝境作战首次通关",
        "2024-05-08 16:00:00+08:00",
        "#第十四章慈悲灯塔", "#主题曲首次通关",
    )
    resource_stats.add(
        "装置×2 糖×3 异铁×5 技巧概要·卷1×10 辅助芯片×4 聚酸酯组×3 辅助芯片组×1 技巧概要·卷2×5 辅助芯片组×1 炽合金×5 芯片助剂×1 凝胶×4 “隐秘的生命线”×1 辅助芯片组×1 晶体电子单元×1 固化纤维板×2 聚合剂×1 转质盐聚块×2 聚合剂×1 聚合凝胶×2 聚合剂×1 环烃预制体×2 饰牌《理想》×1 三水锰矿×2 技巧概要·卷2×5 三水锰矿×2 饰牌《烁影》×1 芯片助剂×1 龙门币×15000 中级作战记录×8 龙门币×30000 龙门币×10000 龙门币×20000 龙门币×30000 辅助芯片组×1 五水研磨石×2 辅助芯片组×1 转质盐聚块×2 芯片助剂×1 固化纤维板×2 辅助芯片组×1 全新装置×2",
        "第十四章慈悲灯塔隐秘战线",
        "2024-05-01 16:00:00+08:00",
        "#第十四章慈悲灯塔",
    )
    resource_stats.add(
        "魔王 魔王的信物×3",
        "第十四章慈悲灯塔尘封密室Part1",
        "2024-05-01 16:00:00+08:00",
        "#第十四章慈悲灯塔",
    )
    resource_stats.add(
        "魔王的信物×2",
        "第十四章慈悲灯塔尘封密室Part2",
        "2024-05-08 16:00:00+08:00",
        "#第十四章慈悲灯塔",
    )


@manager.register
def add_慈悲灯塔活动_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "急性感染抑制剂×2160",
        "慈悲灯塔活动首次通关",
        "2024-05-01 16:00:00+08:00",
        "#慈悲灯塔活动", "#SideStory首次通关",
    )
    # 理智已在第十四章慈悲灯塔首次通关中扣除
    resource_stats.add(
        "急性感染抑制剂×400",
        "慈悲灯塔活动绝境作战首次通关",
        "2024-05-08 16:00:00+08:00",
        "#慈悲灯塔活动", "#SideStory首次通关",
    )
    resource_stats.add(
        "急性感染抑制剂×-5575 寻访凭证×3 模组数据块×2 聚合剂×5 提纯源岩×10 聚合凝胶×10 改量装置×10 “灵魂的投影”×1 钢制置物矮桌×1 钢制带桌隔断×1 实心钢隔断×1 天际全景显示屏×1 制式金属地板×1 “阴影中的光芒”×1 仪器控制台×1 钢制双层床×1 数据增补仪×10 数据增补条×60 固源岩组×15 凝胶×10 龙门币×500000 高级作战记录×50 中级作战记录×100 初级作战记录×240 技巧概要·卷3×25 技巧概要·卷2×50 聚酸酯×25 异铁×25 装置×25 辅助芯片×5 家具零件×2000",
        "慈悲灯塔活动商店",
        "2024-05-01 16:00:00+08:00",
        "#慈悲灯塔活动", "#SideStory商店",
    )


@manager.register
def add_五周年庆典_resources(resource_stats: ResourceStats):
    resource_stats.add(
        [II("合成玉", 9000 / 14)],
        "卡钳谷矿区",
        DateTrigger("2024-05-01 16:00:00+08:00")
        | CronTrigger(hour=4, start_time="2024-05-02 04:00:00+08:00", end_time="2024-05-15 04:00:00+08:00", timezone=CST),
        "#矿区",
    )
    resource_stats.add(
        "阿米娅(医疗)",
        "五周年升变系统更新",
        "2024-05-01 16:00:00+08:00",
        "#?",
    )
    resource_stats.add(
        "暴行的信物",
        "暴行赠送",
        "2024-05-01 16:00:00+08:00",
        "#暴行赠送",
    )
    resource_stats.add(
        "资深干员调用凭证-【犹在影中】",
        "五周年庆典资深干员特别调用活动",
        "2024-05-01 16:00:00+08:00",
        "#邮件", "#?",
    )
    resource_stats.add(
        "采购凭证×-5760 特种皇家信物×4 近卫皇家信物×4 "
        "采购凭证×-1440 先锋遗产信物×4 辅助遗产信物×4 ",
        # "采购凭证×-720 重装传承信物×4 医疗传承信物×4 术师传承信物×4 狙击传承信物×4 "
        "五周年采购凭证区更新",
        "2024-05-01 16:00:00+08:00",
        "#采购凭证区",
    )
    resource_stats.add(
        "ID信息更新卡",
        "五周年庆典ID信息更新礼包",
        "2024-05-01 16:00:00+08:00",
        "#?",
    )


@manager.register
def add_罗德岛促融共竞_resource(resource_stats: ResourceStats):
    resource_stats.add(
        "全新装置×2 龙门币×5000 中级作战记录×5 褐素纤维×2 技巧概要·卷1×10 五水研磨石×1 环烃聚质×2 龙门币×5000 家具零件×100 全新装置×2 龙门币×10000 中级作战记录×10 褐素纤维×2 技巧概要·卷1×10 寻访凭证×1 环烃聚质×2 龙门币×10000 家具零件×100 全新装置×2 数据增补条×15 中级作战记录×10 褐素纤维×2 技巧概要·卷2×5 炽合金块×1 健将×1 龙门币×10000 家具零件×100 环烃聚质×2 数据增补仪×5 中级作战记录×10 烧结核凝晶×1 技巧概要·卷2×5 五水研磨石×1 全新装置×2 双料四分卫×1 家具零件×100 褐素纤维×2 龙门币×10000 高级作战记录×5 环烃聚质×2 技巧概要·卷3×5 炽合金块×1 全新装置×2 龙门币×10000 烧结核凝晶×1",
        "罗德岛促融共竞里程碑奖励",
        "2024-05-15 16:00:00+08:00",
        "#罗德岛促融共竞", "#里程碑奖励",
    )


@manager.register
def add_孤星_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "龙门币×10000 中级作战记录×10 酮凝集组×3 "
        "龙门币×10000 中级作战记录×10 扭转醇×3 "
        "龙门币×10000 中级作战记录×10 半自然溶剂×3 "
        "龙门币×10000 中级作战记录×10 转质盐组×3 ",
        "孤星·复刻专项调查",
        "2024-05-24 16:00:00+08:00",
        "#孤星·复刻", "#SideStory",
    )
    # 孤星·复刻技术调查补给参考我自己的数据，我获得了78个
    # 0 250 400 400 400 400 400 400 400 400，这些加起来除以100乘2等于69，加上赠送的8个等于77个，我怎么获得78个的？
    resource_stats.add(
        "技术调查补给×78",
        "孤星·复刻技术调查补给",
        "2024-05-24 16:00:00+08:00",
        "#孤星·复刻", "#SideStory物资箱",
    )
    resource_stats.add(
        "飞行数据记录芯片×-3862 淬羽赫默的信物×1 淬羽赫默的信物×1 淬羽赫默的信物×1 淬羽赫默的信物×1 淬羽赫默的信物×1 寻访凭证×3 双极纳米片×1 异铁块×3 白马醇×3 切削原液×3 情报凭证×85 情报凭证×85 情报凭证×105 情报凭证×135 情报凭证×125 情报凭证×225 情报凭证×470 异铁组×5 晶体元件×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 糖×8 聚酸酯×8 酮凝集×8 辅助芯片×5",
        "孤星·复刻专案联络处商店",
        "2024-05-24 16:00:00+08:00",
        "#孤星·复刻", "#SideStory商店",
    )


@manager.register
def add_生路_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "理智×-10 至纯源石×13 “应急物资”蓝图芯片×500",
        "生路“信标投放”首次通关",
        "2024-06-05 16:00:00+08:00",
        "#生路", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-240 至纯源石×16 “应急物资”蓝图芯片×480",
        "生路“防线巩固”首次通关",
        "2024-06-12 16:00:00+08:00",
        "#生路", "#SideStory首次通关",
    )
    resource_stats.add(
        "“应急物资”蓝图芯片×-6625 深巡的信物×1 深巡的信物×1 深巡的信物×1 深巡的信物×1 深巡的信物×1 寻访凭证×3 模组数据块×2 聚合剂×5 三水锰矿×10 RMA70-24×10 炽合金块×10 自律手术云台×1 港口枢纽全景显示屏×1 承重特化型地面×1 自动分类文件架×1 “歌蕾蒂娅的倒影”×1 “斯卡蒂的刷新点”×1 “乌尔比安的帷幕”×1 数据增补仪×10 数据增补条×60 聚酸酯组×15 研磨石×10 龙门币×500000 高级作战记录×50 中级作战记录×100 初级作战记录×240 技巧概要·卷3×25 技巧概要·卷2×50 糖×25 异铁×25 装置×25 近卫芯片×5 家具零件×2000",
        "生路物质塑形操作终端商店",
        "2024-06-05 16:00:00+08:00",
        "#生路", "#SideStory商店",
    )


@manager.register
def add_2024_端阳正午签到活动_resources(resource_stats: ResourceStats):
    # 累计签到第一日：应急理智浓缩液*1、龙门币*30000
    # 累计签到第二日：合成玉*200、招聘许可*5
    # 累计签到第三日：芯片助剂*1、中级作战记录*20
    # 累计签到第四日：数据增补条*10、应急理智浓缩液*1
    # 累计签到第五日：技巧概要·卷1*30、加急许可*5
    # 累计签到第六日：家具零件*300、赤金*20
    # 累计签到第七日：模组数据块*1 、技巧概要·卷2*20
    resource_stats.add("应急理智浓缩液×1 龙门币×30000",
                       "2024端阳正午签到活动累计签到第一日", "2024-06-07 04:00:00+08:00", "#2024端阳正午签到活动", "#签到活动")
    resource_stats.add("合成玉×200 招聘许可×5",
                       "2024端阳正午签到活动累计签到第二日", "2024-06-08 04:00:00+08:00", "#2024端阳正午签到活动", "#签到活动")
    resource_stats.add("芯片助剂×1 中级作战记录×20",
                       "2024端阳正午签到活动累计签到第三日", "2024-06-09 04:00:00+08:00", "#2024端阳正午签到活动", "#签到活动")
    resource_stats.add("数据增补条×10 应急理智浓缩液×1",
                       "2024端阳正午签到活动累计签到第四日", "2024-06-10 04:00:00+08:00", "#2024端阳正午签到活动", "#签到活动")
    resource_stats.add("技巧概要·卷1×30 加急许可×5",
                       "2024端阳正午签到活动累计签到第五日", "2024-06-11 04:00:00+08:00", "#2024端阳正午签到活动", "#签到活动")
    resource_stats.add("家具零件×300 赤金×20 端午粽子装饰台",
                       "2024端阳正午签到活动累计签到第六日", "2024-06-12 04:00:00+08:00", "#2024端阳正午签到活动", "#签到活动")
    resource_stats.add("模组数据块×1 技巧概要·卷2×20",
                       "2024端阳正午签到活动累计签到第七日", "2024-06-13 04:00:00+08:00", "#2024端阳正午签到活动", "#签到活动")


@manager.register
def add_虹彩茶会_resources(resource_stats: ResourceStats):
    # 全平台播放量达到50万次可获得：家具【田园小沙发】*1、家具零件*500、中级作战记录*20
    # 全平台播放量达到200万次可获得：家具【飞天肉桂卷】*1、龙门币*50000、高级作战记录*30
    resource_stats.add(
        "田园小沙发×1 家具零件×500 中级作战记录×20",
        "虹彩茶会全平台播放量达到50万次",
        "2024-06-20 16:00:00+08:00",  # 具体时间不明
        "#虹彩茶会",
    )
    resource_stats.add(
        "飞天肉桂卷×1 龙门币×50000 高级作战记录×30",
        "虹彩茶会全平台播放量达到200万次",
        "2024-06-20 16:00:00+08:00",  # 具体时间不明
        "#虹彩茶会",
    )


@manager.register
def add_空想花庭_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "圣像碎片×-3254 隐现的信物×1 隐现的信物×1 隐现的信物×1 隐现的信物×1 隐现的信物×1 寻访凭证×3 晶体电子单元×1 酮阵列×3 晶体电路×3 改量装置×3 情报凭证×120 情报凭证×115 情报凭证×115 情报凭证×125 情报凭证×165 固源岩组×5 RMA70-12×5 龙门币×100000 高级作战记录×10 中级作战记录×20 初级作战记录×40 技巧概要·卷3×10 技巧概要·卷2×20 固源岩×8 聚酸酯×8 酮凝集×8 狙击芯片×5",
        "空想花庭·复刻居民晚餐会商店",
        "2024-06-25 16:00:00+08:00",
        "#空想花庭·复刻", "#SideStory商店",
    )


@manager.register
def add_熔炉还魂记_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "理智×-114 至纯源石×18 炉渣×560 饰牌《迷梦》",
        "熔炉“还魂”记首次通关",
        "2024-07-09 16:00:00+08:00",
        "#熔炉“还魂”记", "#故事集首次通关",
    )
    resource_stats.add(
        "炉渣×-2175 悠然假日\\sHD66×1 事相碎片×6 模组数据块×2 数据增补仪×8 数据增补条×40 双极纳米片×1 芯片助剂×1 五水研磨石×2 半自然溶剂×4 扭转醇×4 龙门币×20000 高级作战记录×5 中级作战记录×10 技巧概要·卷3×5 技巧概要·卷2×10 赤金×20 异铁×5 招聘许可×5 家具零件×100",
        "熔炉“还魂”记商店",
        "2024-07-09 16:00:00+08:00",
        "#熔炉“还魂”记", "#故事集商店",
    )


@manager.register
def add_太阳甩在身后_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "至纯源石×13 流光之沙×440",
        "太阳甩在身后【市民花园】首次通关",
        "2024-08-01 16:00:00+08:00",
        "#太阳甩在身后", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-240 至纯源石×16 流光之沙×480",
        "太阳甩在身后【丰获集会】首次通关",
        "2024-08-08 16:00:00+08:00",
        "#太阳甩在身后", "#SideStory首次通关",
    )
    resource_stats.add(
        "理智×-140 至纯源石×9 流光之沙×380",
        "太阳甩在身后【藏珍宝库】首次通关",
        "2024-08-15 16:00:00+08:00",
        "#太阳甩在身后", "#SideStory首次通关",
    )
    resource_stats.add(
        "龙门币×10000 RMA70-12×3 高级作战记录×10 凝胶×3 数据增补条×15 RMA70-24×1 技巧概要·卷2×10 酮凝集组×3 龙门币×20000 默言石凳×1 RMA70-12×3 中级作战记录×20 D32钢×1 技巧概要·卷3×5 “青春陪伴”×1 凝胶×3 龙门币×10000 酮凝集组×3 高级作战记录×10 模组数据块×1 聚合凝胶×1 技巧概要·卷2×10 RMA70-12×3 龙门币×20000 “凝视者”×1 凝胶×3 中级作战记录×20 聚合剂×1 技巧概要·卷3×5 宝石洗手池×1 酮凝集组×3 龙门币×10000 RMA70-12×3 高级作战记录×10 数据增补条×15 酮阵列×1 技巧概要·卷2×10 凝胶×3 龙门币×20000 家具零件×200 酮凝集组×3 中级作战记录×20 晶体电子单元×1 技巧概要·卷3×5 龙门币×10000",
        "太阳甩在身后宝石铭刻结业进度",
        "2024-08-01 16:00:00+08:00",  # 时间不对，8/5之前拿不满全部奖励
        "#太阳甩在身后", "#SideStory进度",
    )
    resource_stats.add(
        "流光之沙×-7675 莎草的信物×1 莎草的信物×1 莎草的信物×1 莎草的信物×1 莎草的信物×1 寻访凭证×3 模组数据块×3 晶体电子单元×5 提纯源岩×10 聚合凝胶×10 精炼溶剂×10 五水研磨石×10 木雕装饰×1 “此处止步”×1 月纹台×1 历史石瓶×1 生命之墙×1 数据增补仪×10 数据增补条×60 糖组×15 酮凝集组×15 轻锰矿×15 化合切削液×15 龙门币×600000 高级作战记录×60 中级作战记录×100 初级作战记录×300 技巧概要·卷3×25 技巧概要·卷2×50 固源岩×40 糖×30 聚酸酯×30 异铁×25 酮凝集×25 装置×20 医疗芯片×5 家具零件×2000",
        "太阳甩在身后米城大巴扎商店",
        "2024-08-01 16:00:00+08:00",
        "#太阳甩在身后", "#SideStory商店",
    )


@manager.register
def add_2024夏日嘉年华_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "高级干员调用凭证-新人 十连中坚寻访凭证 寻访凭证 资深干员特训邀请函 资深干员特训装置 高级材料提货券×8",
        "2024夏日嘉年华新手博士奖励追加",
        "2024-08-01 16:00:00+08:00",
        "#邮件",
    )


@manager.register
def add_火山旅梦_复刻_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "龙门币×3000 半自然溶剂×1 异铁组×1 龙门币×3000 可以游的小矮凳×1 中级作战记录×5 固源岩组×1 龙门币×3000 技巧概要·卷2×5 半自然溶剂×1 龙门币×3000 异铁组×1 中级作战记录×5 炽合金×1 风情街户外圆桌×1 龙门币×3000 异铁组×1 技巧概要·卷3×3 龙门币×4000 炽合金×1 龙门币×4000 固源岩组×1 龙门币×4000 半自然溶剂×1 可以转的大靠椅×1 中级作战记录×5 炽合金×1 技巧概要·卷2×5 龙门币×5000 固源岩组×1 龙门币×5000 炽合金×1 技巧概要·卷3×3 异铁组×1 缤纷冲浪板架×1 半自然溶剂×1 中级作战记录×5 固源岩组×1 龙门币×6000 半自然溶剂×1 中级作战记录×5 龙门币×6000 异铁组×1 炽合金×1 龙门币×6000",
        "火山旅梦·复刻汐斯塔风情街营业里程碑奖励",
        "2024-08-22 16:00:00+08:00",
        "#火山旅梦·复刻", "#SideStory",
    )
    resource_stats.add(
        "峯联贸易物流补给×2",
        "火山旅梦·复刻汐斯塔风情街营业日常奖励",
        DateTrigger("2024-08-22 16:00:00+08:00")
        | CronTrigger(hour=4, start_time="2024-08-23 04:00:00+08:00", end_time="2024-09-05 04:00:00+08:00", timezone=CST),
        "#火山旅梦·复刻", "#SideStory",
    )


@manager.register
def add_生息演算限时任务_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "中级作战记录×20 技巧概要·卷2×10 炽合金×5 芯片助剂×1 招聘许可×5 三水锰矿×3 龙门币×30000 赤金×20 晶体电子单元×1 技巧概要·卷3×10 研磨石×5 家具零件×200 夏卉\\sFA083×1 聚合凝胶×3 应急理智浓缩液×1 高级作战记录×10 RMA70-12×5 技巧概要·卷2×10 D32钢×1 龙门币×30000",
        "生息演算限时任务",
        "2024-08-29 16:00:00+08:00",
        "#签到任务",
    )
