from models import ResourceStats

from .manager import manager


@manager.register
def add_stationary_security_service_resources(resource_stats: ResourceStats):
    resource_stats.add(
        '数据增补条×2 数据增补条×3 数据增补仪×1 数据增补条×4 数据增补仪×1 模组数据块×1 数据增补条×5 数据增补仪×2 模组数据块×1 数据增补条×6 数据增补仪×3 模组数据块×1 数据增补条×10 数据增补仪×3 模组数据块×2',
        '多索雷斯在建地块首次清理记录',
        '2022-12-15 12:00:00+08:00',
        '#保全派驻首次清理记录',
    )
    resource_stats.add(
        '数据增补条×2 数据增补条×3 数据增补仪×1 数据增补条×4 数据增补仪×1 模组数据块×1 数据增补条×5 数据增补仪×2 模组数据块×1 数据增补条×6 数据增补仪×3 模组数据块×1 数据增补条×10 数据增补仪×3 模组数据块×2',
        '阿卡胡拉丛林首次清理记录',
        '2022-12-15 12:00:00+08:00',
        '#保全派驻首次清理记录',
    )
    resource_stats.add(
        '数据增补条×2 数据增补条×3 数据增补仪×1 数据增补条×4 数据增补仪×1 模组数据块×1 数据增补条×5 数据增补仪×2 模组数据块×1 数据增补条×6 数据增补仪×3 模组数据块×1 数据增补条×10 数据增补仪×3 模组数据块×2',
        '约翰老妈新建地块首次清理记录',
        '2023-04-16 04:00:00+08:00',
        '#保全派驻首次清理记录',
    )
    resource_stats.add(
        '数据增补条×2 数据增补条×3 数据增补仪×1 数据增补条×4 数据增补仪×1 模组数据块×1 数据增补条×5 数据增补仪×2 模组数据块×1 数据增补条×6 数据增补仪×3 模组数据块×1 数据增补条×10 数据增补仪×3 模组数据块×2',
        '雷神工业测试平台 首次清理记录',
        '2023-04-16 04:00:00+08:00',
        '#保全派驻首次清理记录',
    )
    resource_stats.add(
        '数据增补条×2 数据增补条×3 数据增补仪×1 数据增补条×4 数据增补仪×1 模组数据块×1 数据增补条×5 数据增补仪×2 模组数据块×1 数据增补条×6 数据增补仪×3 模组数据块×1 数据增补条×10 数据增补仪×3 模组数据块×2',
        '阿尔斯特甜品制作平台首次清理记录',
        '2023-08-16 04:00:00+08:00',
        '#保全派驻首次清理记录',
    )
    resource_stats.add(
        '数据增补条×2 数据增补条×3 数据增补仪×1 数据增补条×4 数据增补仪×1 模组数据块×1 数据增补条×5 数据增补仪×2 模组数据块×1 数据增补条×6 数据增补仪×3 模组数据块×1 数据增补条×10 数据增补仪×3 模组数据块×2',
        '荒废灯塔首次清理记录',
        '2023-08-16 04:00:00+08:00',
        '#保全派驻首次清理记录',
    )
    resource_stats.add(
        '数据增补条×2 数据增补条×3 数据增补仪×1 数据增补条×4 数据增补仪×1 模组数据块×1 数据增补条×5 数据增补仪×2 模组数据块×1 数据增补条×6 数据增补仪×3 模组数据块×1 数据增补条×10 数据增补仪×3 模组数据块×2',
        '塔山农业实验平台首次清理记录',
        '2023-12-16 04:00:00+08:00',
        '#保全派驻首次清理记录',
    )
    resource_stats.add(
        '数据增补条×2 数据增补条×3 数据增补仪×1 数据增补条×4 数据增补仪×1 模组数据块×1 数据增补条×5 数据增补仪×2 模组数据块×1 数据增补条×6 数据增补仪×3 模组数据块×1 数据增补条×10 数据增补仪×3 模组数据块×2',
        '自走机械搏斗场首次清理记录',
        '2023-12-16 04:00:00+08:00',
        '#保全派驻首次清理记录',
    )
    resource_stats.add(
        '数据增补条×2 数据增补条×3 数据增补仪×1 数据增补条×4 数据增补仪×1 模组数据块×1 数据增补条×5 数据增补仪×2 模组数据块×1 数据增补条×6 数据增补仪×3 模组数据块×1 数据增补条×10 数据增补仪×3 模组数据块×2',
        '边地移动城镇首次清理记录',
        '2024-04-16 04:00:00+08:00',
        '#保全派驻首次清理记录',
    )
    resource_stats.add(
        '数据增补条×2 数据增补条×3 数据增补仪×1 数据增补条×4 数据增补仪×1 模组数据块×1 数据增补条×5 数据增补仪×2 模组数据块×1 数据增补条×6 数据增补仪×3 模组数据块×1 数据增补条×10 数据增补仪×3 模组数据块×2',
        '多索雷斯商业地块首次清理记录',
        '2024-04-16 04:00:00+08:00',
        '#保全派驻首次清理记录',
    )
    resource_stats.add(
        '数据增补条×2 数据增补条×3 数据增补仪×1 数据增补条×4 数据增补仪×1 模组数据块×1 数据增补条×5 数据增补仪×2 模组数据块×1 数据增补条×6 数据增补仪×3 模组数据块×1 数据增补条×10 数据增补仪×3 模组数据块×2',
        '交战荒野首次清理记录',
        '2024-08-16 04:00:00+08:00',
        '#保全派驻首次清理记录',
    )
    resource_stats.add(
        '数据增补条×2 数据增补条×3 数据增补仪×1 数据增补条×4 数据增补仪×1 模组数据块×1 数据增补条×5 数据增补仪×2 模组数据块×1 数据增补条×6 数据增补仪×3 模组数据块×1 数据增补条×10 数据增补仪×3 模组数据块×2',
        '玉门市集首次清理记录',
        '2024-08-16 04:00:00+08:00',
        '#保全派驻首次清理记录',
    )
    resource_stats.add(
        '三水锰矿×2 龙门币×20000 双极纳米片×1 龙门币×60000 精炼溶剂×2 龙门币×20000 D32钢×1 龙门币×60000 RMA70-24×2 龙门币×20000 异铁块×2 龙门币×20000 固源岩组×5 高级作战记录×10 糖组×5 高级作战记录×10',
        '极西安保派驻任务',
        '2022-12-15 12:00:00+08:00',
        '#保全派驻任务',
    )
    resource_stats.add(
        '五水研磨石×2 龙门币×20000 聚合剂×1 龙门币×60000 切削原液×2 龙门币×20000 晶体电子单元×1 龙门币×60000 炽合金块×2 龙门币×20000 酮阵列×2 龙门币×20000 异铁组×5 高级作战记录×10 聚酸酯组×5 高级作战记录×10',
        '掠地安保派驻任务',
        '2023-04-16 04:00:00+08:00',
        '#保全派驻任务',
    )
    resource_stats.add(
        '白马醇×2 龙门币×20000 双极纳米片×1 龙门币×60000 聚合凝胶×2 龙门币×20000 烧结核凝晶×1 龙门币×60000 晶体电路×2 龙门币×20000 改量装置×2 龙门币×20000 酮凝集组×5 高级作战记录×10 全新装置×5 高级作战记录×10',
        '南方安保派驻任务',
        '2023-08-16 04:00:00+08:00',
        '#保全派驻任务',
    )
    resource_stats.add(
        '提纯源岩×2 龙门币×20000 D32钢×1 龙门币×60000 聚酸酯块×2 龙门币×20000 聚合剂×1 龙门币×60000 异铁块×2 龙门币×20000 转质盐聚块×2 龙门币×20000 扭转醇×5 高级作战记录×10 轻锰矿×5 高级作战记录×10',
        '边域安保派驻任务',
        '2023-12-16 04:00:00+08:00',
        '#保全派驻任务',
    )
    resource_stats.add(
        '酮阵列×2 龙门币×20000 双极纳米片×1 龙门币×60000 固化纤维板×2 龙门币×20000 聚合剂×1 龙门币×60000 精炼溶剂×2 龙门币×20000 环烃预制体×2 龙门币×20000 研磨石×5 高级作战记录×10 RMA70-12×5 高级作战记录×10',
        '声浪安保派驻任务',
        '2024-04-16 04:00:00+08:00',
        '#保全派驻任务',
    )
    resource_stats.add(
        '提纯源岩×2 龙门币×20000 D32钢×1 龙门币×60000 三水锰矿×2 龙门币×20000 烧结核凝晶×1 龙门币×60000 改量装置×2 龙门币×20000 五水研磨石×2 龙门币×20000 凝胶×5 高级作战记录×10 炽合金×5 高级作战记录×10',
        '荒原安保派驻任务',
        '2024-08-16 04:00:00+08:00',
        '#保全派驻任务',
    )
