from models import ResourceStats


def add_trials_for_navigator_resources(resource_stats: ResourceStats):
    resource_stats.add(
        '试炼经验×-3625 龙门币×10000 中级作战记录×5 异铁块×1 糖组×2 数据增补仪×5 全新装置×2 技巧概要·卷2×5 龙门币×10000 中级作战记录×5 模组数据块×1 家具零件×100 技巧概要·卷2×5 糖组×2 全新装置×2 寻访凭证×1 数据增补条×5 技巧概要·卷2×5 糖组×2 D32钢×1 数据增补仪×5 中级作战记录×5 全新装置×2 糖组×2 酮阵列×1 贺新禧×1 全新装置×2 龙门币×10000 技巧概要·卷3×5 高级作战记录×5 数据增补仪×5 家具零件×100 烧结核凝晶×1 龙门币×10000 高级作战记录×5 模组数据整合块×1 晶体电路×1 技巧概要·卷2×5 龙门币×10000 糖组×2 中级作战记录×5 家具零件×100 技巧概要·卷3×5 全新装置×2 高级作战记录×5 龙门币×10000',
        '引航者试炼#04试炼之路',
        '2024-02-22 16:00:00+08:00',
        '#引航者试炼#04', '#引航者试炼',
    )
    resource_stats.add(
        '试炼经验×-3625 龙门币×10000 中级作战记录×5 改量装置×1 RMA70-12×2 数据增补仪×5 异铁组×2 技巧概要·卷2×5 龙门币×10000 中级作战记录×5 模组数据块×1 家具零件×100 技巧概要·卷2×5 异铁组×2 RMA70-12×2 寻访凭证×1 数据增补条×5 技巧概要·卷2×5 RMA70-12×2 D32钢×1 数据增补仪×5 中级作战记录×5 RMA70-12×2 异铁组×2 白马醇×1 悠然假日\\sHD49×1 异铁组×2 龙门币×10000 技巧概要·卷3×5 高级作战记录×5 数据增补仪×5 家具零件×100 烧结核凝晶×1 龙门币×10000 高级作战记录×5 模组数据整合块×1 炽合金块×1 技巧概要·卷2×5 龙门币×10000 异铁组×2 中级作战记录×5 家具零件×100 技巧概要·卷3×5 RMA70-12×2 高级作战记录×5 龙门币×10000',
        '引航者试炼#03试炼之路',
        '2023-08-18 16:00:00+08:00',
        '#引航者试炼#03', '#引航者试炼',
    )
    resource_stats.add(
        '试炼经验×-3625 龙门币×10000 中级作战记录×5 精炼溶剂×1 扭转醇×2 数据增补仪×5 转质盐组×2 技巧概要·卷2×5 龙门币×10000 中级作战记录×5 模组数据块×1 家具零件×100 技巧概要·卷2×5 转质盐组×2 扭转醇×2 寻访凭证×1 数据增补条×5 技巧概要·卷2×5 扭转醇×2 聚合剂×1 数据增补仪×5 中级作战记录×5 扭转醇×2 转质盐组×2 三水锰矿×1 枝头馥×1 转质盐组×2 龙门币×10000 技巧概要·卷3×5 高级作战记录×5 数据增补仪×5 家具零件×100 烧结核凝晶×1 龙门币×10000 高级作战记录×5 模组数据整合块×1 聚合凝胶×1 技巧概要·卷2×5 龙门币×10000 转质盐组×2 中级作战记录×5 家具零件×100 技巧概要·卷3×5 扭转醇×2 高级作战记录×5 龙门币×10000',
        '引航者试炼#02试炼之路',
        '2023-01-10 16:00:00+08:00',
        '#引航者试炼#02', '#引航者试炼',
    )
    resource_stats.add(
        '试炼经验×-3625 龙门币×10000 中级作战记录×5 数据增补条×10 凝胶×2 模组数据块×1 炽合金×2 技巧概要·卷2×5 龙门币×10000 中级作战记录×5 数据增补仪×5 家具零件×100 技巧概要·卷2×5 模组数据块×1 凝胶×2 寻访凭证×1 炽合金×2 技巧概要·卷2×5 数据增补条×10 D32钢×1 数据增补仪×5 中级作战记录×5 凝胶×2 炽合金×2 异铁块×1 夏卉\\sFA374×1 模组数据块×1 龙门币×10000 技巧概要·卷3×5 高级作战记录×5 数据增补仪×5 晶体电子单元×1 家具零件×100 龙门币×10000 高级作战记录×5 模组数据块×1 五水研磨石×1 炽合金×2 技巧概要·卷2×5 技巧概要·卷3×5 数据增补仪×5 凝胶×2 炽合金×2 切削原液×1 凝胶×2 龙门币×10000',
        '引航者试炼#01试炼之路',
        '2022-08-18 16:00:00+08:00',
        '#引航者试炼#01', '#引航者试炼',
    )
