from models import ResourceStats

from .manager import manager


@manager.register
def add_web_event_resources(resource_stats: ResourceStats):
    resource_stats.add(
        "龙门币×30000",
        "罗德岛鳞丸移动食坊",
        "2023-01-19 11:00:00+08:00",
        "#罗德岛鳞丸移动食坊", "#网页活动",
    )
    resource_stats.add(
        "龙门币×30000",
        "软绵绵工坊",
        "2023-07-23 21:00:00+08:00",
        "#软绵绵工坊", "#网页活动",
    )
    resource_stats.add(
        "龙门币×30000",
        "心灵之音",
        "2023-10-22 21:00:00+08:00",
        "#心灵之音", "#网页活动",
    )
    resource_stats.add(
        "龙门币×30000",
        "沙洲遗闻预热活动",
        "2024-01-16 16:00:00+08:00",
        "#沙洲遗闻预热活动", "#网页活动",
    )
    resource_stats.add(
        "龙门币×30000 龙门币×20000 高级作战记录×10 模组数据块×1",
        "黍的试验田",
        "2024-01-27 21:00:00+08:00",
        "#黍的试验田", "#网页活动",
    )
    resource_stats.add(
        "极昼玩偶 漆黑玩偶",
        "大地与繁星交汇之际",
        "2024-02-27 04:00:00+08:00",
        "#大地与繁星交汇之际", "#网页活动",
    )
    resource_stats.add(
        "龙门币×30000",
        "特派信使！使命必达？",
        "2024-03-29 11:00:00+08:00",
        "#特派信使！使命必达？", "#网页活动",
    )
    resource_stats.add(
        "龙门币×80000",
        "泰拉巡旅",
        "2024-04-27 20:00:00+08:00",
        "#泰拉巡旅", "#网页活动",
    )
    resource_stats.add(
        "龙门币×30000",
        "笞心钥索",
        "2024-07-10 16:00:00+08:00",
        "#笞心钥索", "#网页活动",
    )
    resource_stats.add(
        "龙门币×5000 龙门币×10000",
        "回归之旅",
        "2024-07-27 20:00:00+08:00",
        "#回归之旅", "#网页活动",
    )
