from models import ResourceStats


def add_zone_record_resources(resource_stats: ResourceStats):
    resource_stats.add(
        '中级作战记录×3 技巧概要·卷1×5 技巧概要·卷1×5 装置×3 芯片助剂×1 聚合凝胶×2 中级作战记录×5 龙门币×10000 技巧概要·卷2×5 龙门币×20000 芯片助剂×1 炽合金块×2 辅助芯片×4 异铁×3 龙门币×20000 海蒂×1 聚酸酯×5 龙门币×30000 芯片助剂×1 RMA70-24×2 技巧概要·卷2×5 半自然溶剂×3 固源岩×2 海蒂的信物×1 辅助芯片组×6 龙门币×50000 海蒂的信物×1 三水锰矿×2 晶体电路×2 “碎片大厦”×1 全新装置×5 RMA70-12×2 海蒂的信物×1 “日冕”×1 精炼溶剂×4 饰牌《克己》×1 聚合剂×1 异铁块×2 海蒂的信物×1 双极纳米片×1 D32钢×1 聚合凝胶×2 饰牌《谦虚》×1 海蒂的信物×1 晶体电子单元×1',
        '第十章破碎日冕 - 未署名的笔记本',
        '2022-04-14 12:00:00+08:00',
        '#第十章破碎日冕', '#主题曲记录点奖励',
    )
    resource_stats.add(
        '中级作战记录×3 技巧概要·卷1×5 技巧概要·卷1×5 装置×3 芯片助剂×1 炽合金块×2 中级作战记录×5 龙门币×10000 技巧概要·卷2×5 龙门币×20000 芯片助剂×1 精炼溶剂×2 近卫芯片×4 装置×3 龙门币×20000 固源岩组×4 聚酸酯×4 龙门币×30000 芯片助剂×1 改量装置×2 技巧概要·卷2×5 半自然溶剂×3 研磨石×2 达格达×1 近卫芯片组×6 龙门币×50000 达格达的信物×1 异铁块×2 聚合凝胶×2 达格达的信物×1 “诸王之息”×1 饰牌《复弑》×1 烧结核凝晶×1 炽合金块×2 转质盐组×4 达格达的信物×1 改量装置×2 达格达的信物×1 提纯源岩×2 双极纳米片×1 烧结核凝晶×1 饰牌《洞察》×1 达格达的信物×1 双极纳米片×1',
        '第十一章淬火尘霾 - 塔楼骑士之书',
        '2022-10-11 16:00:00+08:00',
        '#第十一章淬火尘霾', '#主题曲记录点奖励',
    )
    resource_stats.add(
        '中级作战记录×3 技巧概要·卷1×5 技巧概要·卷1×5 聚酸酯×3 后勤特别许可证×2 芯片助剂×1 改量装置×2 中级作战记录×5 龙门币×20000 技巧概要·卷2×5 龙门币×30000 后勤特别许可证×2 芯片助剂×1 扭转醇×2 后勤特别许可证×2 近卫芯片×4 固源岩×3 龙门币×30000 异铁组×4 龙门币×50000 后勤特别许可证×2 芯片助剂×1 精炼溶剂×2 后勤特别许可证×2 技巧概要·卷2×5 研磨石×3 酮凝集×2 摩根×1 近卫芯片组×6 后勤特别许可证×2 摩根的信物×1 晶体电路×2 酮阵列×2 “影之缚”×1 扭转醇×5 凝胶×2 摩根的信物×1 切削原液×4 后勤特别许可证×2 饰牌《视界》×1 晶体电子单元×1 后勤特别许可证×2 摩根的信物×1 白马醇×2 摩根的信物×1 提纯源岩×2 烧结核凝晶×1 晶体电子单元×1 饰牌《可达》×1 摩根的信物×1 烧结核凝晶×1',
        '第十二章惊霆无声 - 清理人的收藏',
        '2023-04-06 12:00:00+08:00',
        '#第十二章惊霆无声', '#主题曲记录点奖励',
    )
    resource_stats.add(
        '术师芯片×4 技巧概要·卷1×5 戴菲恩×1 固源岩×5 芯片助剂×1 晶体电路×2 中级作战记录×3 龙门币×20000 技巧概要·卷1×5 龙门币×30000 芯片助剂×1 精炼溶剂×2 中级作战记录×5 装置×3 龙门币×30000 技巧概要·卷2×5 龙门币×50000 芯片助剂×1 异铁块×2 技巧概要·卷2×5 半自然溶剂×3 异铁×2 异铁组×4 术师芯片组×6 戴菲恩的信物×1 精炼溶剂×2 晶体电路×2 “巨骸湍流”×1 研磨石×5 化合切削液×2 戴菲恩的信物×1 环烃预制体×4 饰牌《方舟》×1 聚合剂×1 戴菲恩的信物×1 聚合凝胶×2 戴菲恩的信物×1 转质盐聚块×2 烧结核凝晶×1 聚合剂×1 饰牌《渴求》×1 戴菲恩的信物×1 烧结核凝晶×1',
        '第十三章恶兆湍流 - 温德米尔的快乐之家',
        '2023-10-08 12:00:00+08:00',
        '#第十三章恶兆湍流', '#主题曲记录点奖励',
    )
